{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "game_start": 4,
      "view_complete": 5,
      "view_imperfect": 6,
      "rule_player_3": 7,
      "rule_player_4": 8,
      "rule_length_tonpu": 9,
      "rule_length_hanchan": 10,
      "game_end": 11,
      "round_start": 12,
      "bakaze_0": 13,
      "bakaze_1": 14,
      "bakaze_2": 15,
      "kyoku_0": 16,
      "kyoku_1": 17,
      "kyoku_2": 18,
      "kyoku_3": 19,
      "honba": 20,
      "riichi_sticks": 21,
      "TENBO_ZERO": 22,
      "TENBO_PLUS": 23,
      "TENBO_MINUS": 24,
      "TENBO_100": 25,
      "TENBO_200": 26,
      "TENBO_300": 27,
      "TENBO_500": 28,
      "TENBO_1000": 29,
      "TENBO_2000": 30,
      "TENBO_3000": 31,
      "TENBO_5000": 32,
      "TENBO_10000": 33,
      "TENBO_20000": 34,
      "TENBO_30000": 35,
      "dora": 36,
      "ura_dora": 37,
      "hidden_haipai_0": 38,
      "hidden_haipai_1": 39,
      "hidden_haipai_2": 40,
      "hidden_haipai_3": 41,
      "haipai_0": 42,
      "haipai_1": 43,
      "haipai_2": 44,
      "haipai_3": 45,
      "m1": 46,
      "m2": 47,
      "m3": 48,
      "m4": 49,
      "m0": 50,
      "m5": 51,
      "m6": 52,
      "m7": 53,
      "m8": 54,
      "m9": 55,
      "p1": 56,
      "p2": 57,
      "p3": 58,
      "p4": 59,
      "p0": 60,
      "p5": 61,
      "p6": 62,
      "p7": 63,
      "p8": 64,
      "p9": 65,
      "s1": 66,
      "s2": 67,
      "s3": 68,
      "s4": 69,
      "s0": 70,
      "s5": 71,
      "s6": 72,
      "s7": 73,
      "s8": 74,
      "s9": 75,
      "z1": 76,
      "z2": 77,
      "z3": 78,
      "z4": 79,
      "z5": 80,
      "z6": 81,
      "z7": 82,
      "draw_0_hidden": 83,
      "draw_0_m1": 84,
      "discard_0_m1": 85,
      "draw_0_m2": 86,
      "discard_0_m2": 87,
      "draw_0_m3": 88,
      "discard_0_m3": 89,
      "draw_0_m4": 90,
      "discard_0_m4": 91,
      "draw_0_m0": 92,
      "discard_0_m0": 93,
      "draw_0_m5": 94,
      "discard_0_m5": 95,
      "draw_0_m6": 96,
      "discard_0_m6": 97,
      "draw_0_m7": 98,
      "discard_0_m7": 99,
      "draw_0_m8": 100,
      "discard_0_m8": 101,
      "draw_0_m9": 102,
      "discard_0_m9": 103,
      "draw_0_p1": 104,
      "discard_0_p1": 105,
      "draw_0_p2": 106,
      "discard_0_p2": 107,
      "draw_0_p3": 108,
      "discard_0_p3": 109,
      "draw_0_p4": 110,
      "discard_0_p4": 111,
      "draw_0_p0": 112,
      "discard_0_p0": 113,
      "draw_0_p5": 114,
      "discard_0_p5": 115,
      "draw_0_p6": 116,
      "discard_0_p6": 117,
      "draw_0_p7": 118,
      "discard_0_p7": 119,
      "draw_0_p8": 120,
      "discard_0_p8": 121,
      "draw_0_p9": 122,
      "discard_0_p9": 123,
      "draw_0_s1": 124,
      "discard_0_s1": 125,
      "draw_0_s2": 126,
      "discard_0_s2": 127,
      "draw_0_s3": 128,
      "discard_0_s3": 129,
      "draw_0_s4": 130,
      "discard_0_s4": 131,
      "draw_0_s0": 132,
      "discard_0_s0": 133,
      "draw_0_s5": 134,
      "discard_0_s5": 135,
      "draw_0_s6": 136,
      "discard_0_s6": 137,
      "draw_0_s7": 138,
      "discard_0_s7": 139,
      "draw_0_s8": 140,
      "discard_0_s8": 141,
      "draw_0_s9": 142,
      "discard_0_s9": 143,
      "draw_0_z1": 144,
      "discard_0_z1": 145,
      "draw_0_z2": 146,
      "discard_0_z2": 147,
      "draw_0_z3": 148,
      "discard_0_z3": 149,
      "draw_0_z4": 150,
      "discard_0_z4": 151,
      "draw_0_z5": 152,
      "discard_0_z5": 153,
      "draw_0_z6": 154,
      "discard_0_z6": 155,
      "draw_0_z7": 156,
      "discard_0_z7": 157,
      "draw_1_hidden": 158,
      "draw_1_m1": 159,
      "discard_1_m1": 160,
      "draw_1_m2": 161,
      "discard_1_m2": 162,
      "draw_1_m3": 163,
      "discard_1_m3": 164,
      "draw_1_m4": 165,
      "discard_1_m4": 166,
      "draw_1_m0": 167,
      "discard_1_m0": 168,
      "draw_1_m5": 169,
      "discard_1_m5": 170,
      "draw_1_m6": 171,
      "discard_1_m6": 172,
      "draw_1_m7": 173,
      "discard_1_m7": 174,
      "draw_1_m8": 175,
      "discard_1_m8": 176,
      "draw_1_m9": 177,
      "discard_1_m9": 178,
      "draw_1_p1": 179,
      "discard_1_p1": 180,
      "draw_1_p2": 181,
      "discard_1_p2": 182,
      "draw_1_p3": 183,
      "discard_1_p3": 184,
      "draw_1_p4": 185,
      "discard_1_p4": 186,
      "draw_1_p0": 187,
      "discard_1_p0": 188,
      "draw_1_p5": 189,
      "discard_1_p5": 190,
      "draw_1_p6": 191,
      "discard_1_p6": 192,
      "draw_1_p7": 193,
      "discard_1_p7": 194,
      "draw_1_p8": 195,
      "discard_1_p8": 196,
      "draw_1_p9": 197,
      "discard_1_p9": 198,
      "draw_1_s1": 199,
      "discard_1_s1": 200,
      "draw_1_s2": 201,
      "discard_1_s2": 202,
      "draw_1_s3": 203,
      "discard_1_s3": 204,
      "draw_1_s4": 205,
      "discard_1_s4": 206,
      "draw_1_s0": 207,
      "discard_1_s0": 208,
      "draw_1_s5": 209,
      "discard_1_s5": 210,
      "draw_1_s6": 211,
      "discard_1_s6": 212,
      "draw_1_s7": 213,
      "discard_1_s7": 214,
      "draw_1_s8": 215,
      "discard_1_s8": 216,
      "draw_1_s9": 217,
      "discard_1_s9": 218,
      "draw_1_z1": 219,
      "discard_1_z1": 220,
      "draw_1_z2": 221,
      "discard_1_z2": 222,
      "draw_1_z3": 223,
      "discard_1_z3": 224,
      "draw_1_z4": 225,
      "discard_1_z4": 226,
      "draw_1_z5": 227,
      "discard_1_z5": 228,
      "draw_1_z6": 229,
      "discard_1_z6": 230,
      "draw_1_z7": 231,
      "discard_1_z7": 232,
      "draw_2_hidden": 233,
      "draw_2_m1": 234,
      "discard_2_m1": 235,
      "draw_2_m2": 236,
      "discard_2_m2": 237,
      "draw_2_m3": 238,
      "discard_2_m3": 239,
      "draw_2_m4": 240,
      "discard_2_m4": 241,
      "draw_2_m0": 242,
      "discard_2_m0": 243,
      "draw_2_m5": 244,
      "discard_2_m5": 245,
      "draw_2_m6": 246,
      "discard_2_m6": 247,
      "draw_2_m7": 248,
      "discard_2_m7": 249,
      "draw_2_m8": 250,
      "discard_2_m8": 251,
      "draw_2_m9": 252,
      "discard_2_m9": 253,
      "draw_2_p1": 254,
      "discard_2_p1": 255,
      "draw_2_p2": 256,
      "discard_2_p2": 257,
      "draw_2_p3": 258,
      "discard_2_p3": 259,
      "draw_2_p4": 260,
      "discard_2_p4": 261,
      "draw_2_p0": 262,
      "discard_2_p0": 263,
      "draw_2_p5": 264,
      "discard_2_p5": 265,
      "draw_2_p6": 266,
      "discard_2_p6": 267,
      "draw_2_p7": 268,
      "discard_2_p7": 269,
      "draw_2_p8": 270,
      "discard_2_p8": 271,
      "draw_2_p9": 272,
      "discard_2_p9": 273,
      "draw_2_s1": 274,
      "discard_2_s1": 275,
      "draw_2_s2": 276,
      "discard_2_s2": 277,
      "draw_2_s3": 278,
      "discard_2_s3": 279,
      "draw_2_s4": 280,
      "discard_2_s4": 281,
      "draw_2_s0": 282,
      "discard_2_s0": 283,
      "draw_2_s5": 284,
      "discard_2_s5": 285,
      "draw_2_s6": 286,
      "discard_2_s6": 287,
      "draw_2_s7": 288,
      "discard_2_s7": 289,
      "draw_2_s8": 290,
      "discard_2_s8": 291,
      "draw_2_s9": 292,
      "discard_2_s9": 293,
      "draw_2_z1": 294,
      "discard_2_z1": 295,
      "draw_2_z2": 296,
      "discard_2_z2": 297,
      "draw_2_z3": 298,
      "discard_2_z3": 299,
      "draw_2_z4": 300,
      "discard_2_z4": 301,
      "draw_2_z5": 302,
      "discard_2_z5": 303,
      "draw_2_z6": 304,
      "discard_2_z6": 305,
      "draw_2_z7": 306,
      "discard_2_z7": 307,
      "draw_3_hidden": 308,
      "draw_3_m1": 309,
      "discard_3_m1": 310,
      "draw_3_m2": 311,
      "discard_3_m2": 312,
      "draw_3_m3": 313,
      "discard_3_m3": 314,
      "draw_3_m4": 315,
      "discard_3_m4": 316,
      "draw_3_m0": 317,
      "discard_3_m0": 318,
      "draw_3_m5": 319,
      "discard_3_m5": 320,
      "draw_3_m6": 321,
      "discard_3_m6": 322,
      "draw_3_m7": 323,
      "discard_3_m7": 324,
      "draw_3_m8": 325,
      "discard_3_m8": 326,
      "draw_3_m9": 327,
      "discard_3_m9": 328,
      "draw_3_p1": 329,
      "discard_3_p1": 330,
      "draw_3_p2": 331,
      "discard_3_p2": 332,
      "draw_3_p3": 333,
      "discard_3_p3": 334,
      "draw_3_p4": 335,
      "discard_3_p4": 336,
      "draw_3_p0": 337,
      "discard_3_p0": 338,
      "draw_3_p5": 339,
      "discard_3_p5": 340,
      "draw_3_p6": 341,
      "discard_3_p6": 342,
      "draw_3_p7": 343,
      "discard_3_p7": 344,
      "draw_3_p8": 345,
      "discard_3_p8": 346,
      "draw_3_p9": 347,
      "discard_3_p9": 348,
      "draw_3_s1": 349,
      "discard_3_s1": 350,
      "draw_3_s2": 351,
      "discard_3_s2": 352,
      "draw_3_s3": 353,
      "discard_3_s3": 354,
      "draw_3_s4": 355,
      "discard_3_s4": 356,
      "draw_3_s0": 357,
      "discard_3_s0": 358,
      "draw_3_s5": 359,
      "discard_3_s5": 360,
      "draw_3_s6": 361,
      "discard_3_s6": 362,
      "draw_3_s7": 363,
      "discard_3_s7": 364,
      "draw_3_s8": 365,
      "discard_3_s8": 366,
      "draw_3_s9": 367,
      "discard_3_s9": 368,
      "draw_3_z1": 369,
      "discard_3_z1": 370,
      "draw_3_z2": 371,
      "discard_3_z2": 372,
      "draw_3_z3": 373,
      "discard_3_z3": 374,
      "draw_3_z4": 375,
      "discard_3_z4": 376,
      "draw_3_z5": 377,
      "discard_3_z5": 378,
      "draw_3_z6": 379,
      "discard_3_z6": 380,
      "draw_3_z7": 381,
      "discard_3_z7": 382,
      "tedashi": 383,
      "tsumogiri": 384,
      "opt_self_0_ankan": 385,
      "take_self_0_ankan": 386,
      "pass_self_0_ankan": 387,
      "opt_self_0_kakan": 388,
      "take_self_0_kakan": 389,
      "pass_self_0_kakan": 390,
      "opt_self_0_penuki": 391,
      "take_self_0_penuki": 392,
      "pass_self_0_penuki": 393,
      "opt_self_0_kyushukyuhai": 394,
      "take_self_0_kyushukyuhai": 395,
      "pass_self_0_kyushukyuhai": 396,
      "opt_self_0_riichi": 397,
      "take_self_0_riichi": 398,
      "pass_self_0_riichi": 399,
      "opt_self_0_tsumo": 400,
      "take_self_0_tsumo": 401,
      "pass_self_0_tsumo": 402,
      "opt_self_1_ankan": 403,
      "take_self_1_ankan": 404,
      "pass_self_1_ankan": 405,
      "opt_self_1_kakan": 406,
      "take_self_1_kakan": 407,
      "pass_self_1_kakan": 408,
      "opt_self_1_penuki": 409,
      "take_self_1_penuki": 410,
      "pass_self_1_penuki": 411,
      "opt_self_1_kyushukyuhai": 412,
      "take_self_1_kyushukyuhai": 413,
      "pass_self_1_kyushukyuhai": 414,
      "opt_self_1_riichi": 415,
      "take_self_1_riichi": 416,
      "pass_self_1_riichi": 417,
      "opt_self_1_tsumo": 418,
      "take_self_1_tsumo": 419,
      "pass_self_1_tsumo": 420,
      "opt_self_2_ankan": 421,
      "take_self_2_ankan": 422,
      "pass_self_2_ankan": 423,
      "opt_self_2_kakan": 424,
      "take_self_2_kakan": 425,
      "pass_self_2_kakan": 426,
      "opt_self_2_penuki": 427,
      "take_self_2_penuki": 428,
      "pass_self_2_penuki": 429,
      "opt_self_2_kyushukyuhai": 430,
      "take_self_2_kyushukyuhai": 431,
      "pass_self_2_kyushukyuhai": 432,
      "opt_self_2_riichi": 433,
      "take_self_2_riichi": 434,
      "pass_self_2_riichi": 435,
      "opt_self_2_tsumo": 436,
      "take_self_2_tsumo": 437,
      "pass_self_2_tsumo": 438,
      "opt_self_3_ankan": 439,
      "take_self_3_ankan": 440,
      "pass_self_3_ankan": 441,
      "opt_self_3_kakan": 442,
      "take_self_3_kakan": 443,
      "pass_self_3_kakan": 444,
      "opt_self_3_penuki": 445,
      "take_self_3_penuki": 446,
      "pass_self_3_penuki": 447,
      "opt_self_3_kyushukyuhai": 448,
      "take_self_3_kyushukyuhai": 449,
      "pass_self_3_kyushukyuhai": 450,
      "opt_self_3_riichi": 451,
      "take_self_3_riichi": 452,
      "pass_self_3_riichi": 453,
      "opt_self_3_tsumo": 454,
      "take_self_3_tsumo": 455,
      "pass_self_3_tsumo": 456,
      "opt_react_0_chi": 457,
      "take_react_0_chi": 458,
      "pass_react_0_chi_forced_priority": 459,
      "pass_react_0_chi_voluntary": 460,
      "opt_react_0_minkan": 461,
      "take_react_0_minkan": 462,
      "pass_react_0_minkan_forced_priority": 463,
      "pass_react_0_minkan_voluntary": 464,
      "opt_react_0_pon": 465,
      "take_react_0_pon": 466,
      "pass_react_0_pon_forced_priority": 467,
      "pass_react_0_pon_voluntary": 468,
      "opt_react_0_ron": 469,
      "take_react_0_ron": 470,
      "pass_react_0_ron_voluntary": 471,
      "opt_react_1_chi": 472,
      "take_react_1_chi": 473,
      "pass_react_1_chi_forced_priority": 474,
      "pass_react_1_chi_voluntary": 475,
      "opt_react_1_minkan": 476,
      "take_react_1_minkan": 477,
      "pass_react_1_minkan_forced_priority": 478,
      "pass_react_1_minkan_voluntary": 479,
      "opt_react_1_pon": 480,
      "take_react_1_pon": 481,
      "pass_react_1_pon_forced_priority": 482,
      "pass_react_1_pon_voluntary": 483,
      "opt_react_1_ron": 484,
      "take_react_1_ron": 485,
      "pass_react_1_ron_voluntary": 486,
      "opt_react_2_chi": 487,
      "take_react_2_chi": 488,
      "pass_react_2_chi_forced_priority": 489,
      "pass_react_2_chi_voluntary": 490,
      "opt_react_2_minkan": 491,
      "take_react_2_minkan": 492,
      "pass_react_2_minkan_forced_priority": 493,
      "pass_react_2_minkan_voluntary": 494,
      "opt_react_2_pon": 495,
      "take_react_2_pon": 496,
      "pass_react_2_pon_forced_priority": 497,
      "pass_react_2_pon_voluntary": 498,
      "opt_react_2_ron": 499,
      "take_react_2_ron": 500,
      "pass_react_2_ron_voluntary": 501,
      "opt_react_3_chi": 502,
      "take_react_3_chi": 503,
      "pass_react_3_chi_forced_priority": 504,
      "pass_react_3_chi_voluntary": 505,
      "opt_react_3_minkan": 506,
      "take_react_3_minkan": 507,
      "pass_react_3_minkan_forced_priority": 508,
      "pass_react_3_minkan_voluntary": 509,
      "opt_react_3_pon": 510,
      "take_react_3_pon": 511,
      "pass_react_3_pon_forced_priority": 512,
      "pass_react_3_pon_voluntary": 513,
      "opt_react_3_ron": 514,
      "take_react_3_ron": 515,
      "pass_react_3_ron_voluntary": 516,
      "chi_pos_low": 517,
      "chi_pos_mid": 518,
      "chi_pos_high": 519,
      "red_chi_used": 520,
      "red_chi_not_used": 521,
      "red_pon_used": 522,
      "red_pon_not_used": 523,
      "opened_hand_0": 524,
      "opened_hand_1": 525,
      "opened_hand_2": 526,
      "opened_hand_3": 527,
      "score_0": 528,
      "score_delta_0": 529,
      "final_score_0": 530,
      "score_1": 531,
      "score_delta_1": 532,
      "final_score_1": 533,
      "score_2": 534,
      "score_delta_2": 535,
      "final_score_2": 536,
      "score_3": 537,
      "score_delta_3": 538,
      "final_score_3": 539,
      "rank_0_1": 540,
      "rank_0_2": 541,
      "rank_0_3": 542,
      "rank_0_4": 543,
      "rank_1_1": 544,
      "rank_1_2": 545,
      "rank_1_3": 546,
      "rank_1_4": 547,
      "rank_2_1": 548,
      "rank_2_2": 549,
      "rank_2_3": 550,
      "rank_2_4": 551,
      "rank_3_1": 552,
      "rank_3_2": 553,
      "rank_3_3": 554,
      "rank_3_4": 555,
      "final_rank_0_1": 556,
      "final_rank_0_2": 557,
      "final_rank_0_3": 558,
      "final_rank_0_4": 559,
      "final_rank_1_1": 560,
      "final_rank_1_2": 561,
      "final_rank_1_3": 562,
      "final_rank_1_4": 563,
      "final_rank_2_1": 564,
      "final_rank_2_2": 565,
      "final_rank_2_3": 566,
      "final_rank_2_4": 567,
      "final_rank_3_1": 568,
      "final_rank_3_2": 569,
      "final_rank_3_3": 570,
      "final_rank_3_4": 571,
      "yaku_menzen_tsumo": 572,
      "yaku_riichi": 573,
      "yaku_ippatsu": 574,
      "yaku_chankan": 575,
      "yaku_rinshan": 576,
      "yaku_haitei": 577,
      "yaku_houtei": 578,
      "yaku_pinfu": 579,
      "yaku_tanyao": 580,
      "yaku_iipeikou": 581,
      "yaku_jikaze_ton": 582,
      "yaku_jikaze_nan": 583,
      "yaku_jikaze_shaa": 584,
      "yaku_jikaze_pei": 585,
      "yaku_bakaze_ton": 586,
      "yaku_bakaze_nan": 587,
      "yaku_bakaze_shaa": 588,
      "yaku_bakaze_pei": 589,
      "yaku_haku": 590,
      "yaku_hatsu": 591,
      "yaku_chun": 592,
      "yaku_double_riichi": 593,
      "yaku_chiitoitsu": 594,
      "yaku_chanta": 595,
      "yaku_ittsu": 596,
      "yaku_sanshoku_doujun": 597,
      "yaku_sanshoku_doukou": 598,
      "yaku_sankantsu": 599,
      "yaku_toitoi": 600,
      "yaku_sanankou": 601,
      "yaku_shousangen": 602,
      "yaku_honroutou": 603,
      "yaku_ryanpeikou": 604,
      "yaku_junchan": 605,
      "yaku_honitsu": 606,
      "yaku_chinitsu": 607,
      "yaku_tenhou": 608,
      "yaku_chiihou": 609,
      "yaku_daisangen": 610,
      "yaku_suuankou": 611,
      "yaku_suuankou_tanki": 612,
      "yaku_tsuuiisou": 613,
      "yaku_ryuuiisou": 614,
      "yaku_chinroutou": 615,
      "yaku_chuuren_poutou": 616,
      "yaku_junsei_chuuren_poutou": 617,
      "yaku_kokushi_musou": 618,
      "yaku_kokushi_musou_13_wait": 619,
      "yaku_daisuushi": 620,
      "yaku_shousuushi": 621,
      "yaku_suukantsu": 622,
      "yaku_dora": 623,
      "yaku_ura_dora": 624,
      "yaku_aka_dora": 625,
      "han_1": 626,
      "han_2": 627,
      "han_3": 628,
      "han_4": 629,
      "han_5": 630,
      "han_6": 631,
      "han_7": 632,
      "han_8": 633,
      "han_9": 634,
      "han_10": 635,
      "han_11": 636,
      "han_12": 637,
      "han_13": 638,
      "fu_20": 639,
      "fu_25": 640,
      "fu_30": 641,
      "fu_40": 642,
      "fu_50": 643,
      "fu_60": 644,
      "fu_70": 645,
      "fu_80": 646,
      "fu_90": 647,
      "fu_100": 648,
      "fu_110": 649,
      "yakuman_1": 650,
      "yakuman_2": 651,
      "yakuman_3": 652,
      "yakuman_4": 653,
      "yakuman_5": 654,
      "yakuman_6": 655,
      "pingju_ryukyoku": 656,
      "pingju_kyushukyuhai": 657,
      "pingju_nagashimangan": 658,
      "pingju_sufurenda": 659,
      "pingju_sukantsu": 660,
      "pingju_suuchariichi": 661,
      "pingju_sanchahou": 662
    },
    "unk_token": "<unk>"
  }
}