{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "game_start": 4,
      "game_end": 5,
      "view_complete": 6,
      "view_imperfect_0": 7,
      "view_imperfect_1": 8,
      "view_imperfect_2": 9,
      "view_imperfect_3": 10,
      "rule_player_3": 11,
      "rule_player_4": 12,
      "rule_length_tonpu": 13,
      "rule_length_hanchan": 14,
      "round_start": 15,
      "round_end": 16,
      "bakaze_0": 17,
      "bakaze_1": 18,
      "bakaze_2": 19,
      "kyoku_0": 20,
      "kyoku_1": 21,
      "kyoku_2": 22,
      "kyoku_3": 23,
      "honba": 24,
      "riichi_sticks": 25,
      "TENBO_ZERO": 26,
      "TENBO_PLUS": 27,
      "TENBO_MINUS": 28,
      "TENBO_100": 29,
      "TENBO_200": 30,
      "TENBO_300": 31,
      "TENBO_500": 32,
      "TENBO_1000": 33,
      "TENBO_2000": 34,
      "TENBO_3000": 35,
      "TENBO_5000": 36,
      "TENBO_10000": 37,
      "TENBO_20000": 38,
      "TENBO_30000": 39,
      "dora": 40,
      "ura_dora": 41,
      "hidden_haipai_0": 42,
      "hidden_haipai_1": 43,
      "hidden_haipai_2": 44,
      "hidden_haipai_3": 45,
      "haipai_0": 46,
      "haipai_1": 47,
      "haipai_2": 48,
      "haipai_3": 49,
      "m1": 50,
      "m2": 51,
      "m3": 52,
      "m4": 53,
      "m0": 54,
      "m5": 55,
      "m6": 56,
      "m7": 57,
      "m8": 58,
      "m9": 59,
      "p1": 60,
      "p2": 61,
      "p3": 62,
      "p4": 63,
      "p0": 64,
      "p5": 65,
      "p6": 66,
      "p7": 67,
      "p8": 68,
      "p9": 69,
      "s1": 70,
      "s2": 71,
      "s3": 72,
      "s4": 73,
      "s0": 74,
      "s5": 75,
      "s6": 76,
      "s7": 77,
      "s8": 78,
      "s9": 79,
      "z1": 80,
      "z2": 81,
      "z3": 82,
      "z4": 83,
      "z5": 84,
      "z6": 85,
      "z7": 86,
      "draw_0_hidden": 87,
      "draw_0_m1": 88,
      "discard_0_m1_tedashi": 89,
      "discard_0_m1_tsumogiri": 90,
      "draw_0_m2": 91,
      "discard_0_m2_tedashi": 92,
      "discard_0_m2_tsumogiri": 93,
      "draw_0_m3": 94,
      "discard_0_m3_tedashi": 95,
      "discard_0_m3_tsumogiri": 96,
      "draw_0_m4": 97,
      "discard_0_m4_tedashi": 98,
      "discard_0_m4_tsumogiri": 99,
      "draw_0_m0": 100,
      "discard_0_m0_tedashi": 101,
      "discard_0_m0_tsumogiri": 102,
      "draw_0_m5": 103,
      "discard_0_m5_tedashi": 104,
      "discard_0_m5_tsumogiri": 105,
      "draw_0_m6": 106,
      "discard_0_m6_tedashi": 107,
      "discard_0_m6_tsumogiri": 108,
      "draw_0_m7": 109,
      "discard_0_m7_tedashi": 110,
      "discard_0_m7_tsumogiri": 111,
      "draw_0_m8": 112,
      "discard_0_m8_tedashi": 113,
      "discard_0_m8_tsumogiri": 114,
      "draw_0_m9": 115,
      "discard_0_m9_tedashi": 116,
      "discard_0_m9_tsumogiri": 117,
      "draw_0_p1": 118,
      "discard_0_p1_tedashi": 119,
      "discard_0_p1_tsumogiri": 120,
      "draw_0_p2": 121,
      "discard_0_p2_tedashi": 122,
      "discard_0_p2_tsumogiri": 123,
      "draw_0_p3": 124,
      "discard_0_p3_tedashi": 125,
      "discard_0_p3_tsumogiri": 126,
      "draw_0_p4": 127,
      "discard_0_p4_tedashi": 128,
      "discard_0_p4_tsumogiri": 129,
      "draw_0_p0": 130,
      "discard_0_p0_tedashi": 131,
      "discard_0_p0_tsumogiri": 132,
      "draw_0_p5": 133,
      "discard_0_p5_tedashi": 134,
      "discard_0_p5_tsumogiri": 135,
      "draw_0_p6": 136,
      "discard_0_p6_tedashi": 137,
      "discard_0_p6_tsumogiri": 138,
      "draw_0_p7": 139,
      "discard_0_p7_tedashi": 140,
      "discard_0_p7_tsumogiri": 141,
      "draw_0_p8": 142,
      "discard_0_p8_tedashi": 143,
      "discard_0_p8_tsumogiri": 144,
      "draw_0_p9": 145,
      "discard_0_p9_tedashi": 146,
      "discard_0_p9_tsumogiri": 147,
      "draw_0_s1": 148,
      "discard_0_s1_tedashi": 149,
      "discard_0_s1_tsumogiri": 150,
      "draw_0_s2": 151,
      "discard_0_s2_tedashi": 152,
      "discard_0_s2_tsumogiri": 153,
      "draw_0_s3": 154,
      "discard_0_s3_tedashi": 155,
      "discard_0_s3_tsumogiri": 156,
      "draw_0_s4": 157,
      "discard_0_s4_tedashi": 158,
      "discard_0_s4_tsumogiri": 159,
      "draw_0_s0": 160,
      "discard_0_s0_tedashi": 161,
      "discard_0_s0_tsumogiri": 162,
      "draw_0_s5": 163,
      "discard_0_s5_tedashi": 164,
      "discard_0_s5_tsumogiri": 165,
      "draw_0_s6": 166,
      "discard_0_s6_tedashi": 167,
      "discard_0_s6_tsumogiri": 168,
      "draw_0_s7": 169,
      "discard_0_s7_tedashi": 170,
      "discard_0_s7_tsumogiri": 171,
      "draw_0_s8": 172,
      "discard_0_s8_tedashi": 173,
      "discard_0_s8_tsumogiri": 174,
      "draw_0_s9": 175,
      "discard_0_s9_tedashi": 176,
      "discard_0_s9_tsumogiri": 177,
      "draw_0_z1": 178,
      "discard_0_z1_tedashi": 179,
      "discard_0_z1_tsumogiri": 180,
      "draw_0_z2": 181,
      "discard_0_z2_tedashi": 182,
      "discard_0_z2_tsumogiri": 183,
      "draw_0_z3": 184,
      "discard_0_z3_tedashi": 185,
      "discard_0_z3_tsumogiri": 186,
      "draw_0_z4": 187,
      "discard_0_z4_tedashi": 188,
      "discard_0_z4_tsumogiri": 189,
      "draw_0_z5": 190,
      "discard_0_z5_tedashi": 191,
      "discard_0_z5_tsumogiri": 192,
      "draw_0_z6": 193,
      "discard_0_z6_tedashi": 194,
      "discard_0_z6_tsumogiri": 195,
      "draw_0_z7": 196,
      "discard_0_z7_tedashi": 197,
      "discard_0_z7_tsumogiri": 198,
      "draw_1_hidden": 199,
      "draw_1_m1": 200,
      "discard_1_m1_tedashi": 201,
      "discard_1_m1_tsumogiri": 202,
      "draw_1_m2": 203,
      "discard_1_m2_tedashi": 204,
      "discard_1_m2_tsumogiri": 205,
      "draw_1_m3": 206,
      "discard_1_m3_tedashi": 207,
      "discard_1_m3_tsumogiri": 208,
      "draw_1_m4": 209,
      "discard_1_m4_tedashi": 210,
      "discard_1_m4_tsumogiri": 211,
      "draw_1_m0": 212,
      "discard_1_m0_tedashi": 213,
      "discard_1_m0_tsumogiri": 214,
      "draw_1_m5": 215,
      "discard_1_m5_tedashi": 216,
      "discard_1_m5_tsumogiri": 217,
      "draw_1_m6": 218,
      "discard_1_m6_tedashi": 219,
      "discard_1_m6_tsumogiri": 220,
      "draw_1_m7": 221,
      "discard_1_m7_tedashi": 222,
      "discard_1_m7_tsumogiri": 223,
      "draw_1_m8": 224,
      "discard_1_m8_tedashi": 225,
      "discard_1_m8_tsumogiri": 226,
      "draw_1_m9": 227,
      "discard_1_m9_tedashi": 228,
      "discard_1_m9_tsumogiri": 229,
      "draw_1_p1": 230,
      "discard_1_p1_tedashi": 231,
      "discard_1_p1_tsumogiri": 232,
      "draw_1_p2": 233,
      "discard_1_p2_tedashi": 234,
      "discard_1_p2_tsumogiri": 235,
      "draw_1_p3": 236,
      "discard_1_p3_tedashi": 237,
      "discard_1_p3_tsumogiri": 238,
      "draw_1_p4": 239,
      "discard_1_p4_tedashi": 240,
      "discard_1_p4_tsumogiri": 241,
      "draw_1_p0": 242,
      "discard_1_p0_tedashi": 243,
      "discard_1_p0_tsumogiri": 244,
      "draw_1_p5": 245,
      "discard_1_p5_tedashi": 246,
      "discard_1_p5_tsumogiri": 247,
      "draw_1_p6": 248,
      "discard_1_p6_tedashi": 249,
      "discard_1_p6_tsumogiri": 250,
      "draw_1_p7": 251,
      "discard_1_p7_tedashi": 252,
      "discard_1_p7_tsumogiri": 253,
      "draw_1_p8": 254,
      "discard_1_p8_tedashi": 255,
      "discard_1_p8_tsumogiri": 256,
      "draw_1_p9": 257,
      "discard_1_p9_tedashi": 258,
      "discard_1_p9_tsumogiri": 259,
      "draw_1_s1": 260,
      "discard_1_s1_tedashi": 261,
      "discard_1_s1_tsumogiri": 262,
      "draw_1_s2": 263,
      "discard_1_s2_tedashi": 264,
      "discard_1_s2_tsumogiri": 265,
      "draw_1_s3": 266,
      "discard_1_s3_tedashi": 267,
      "discard_1_s3_tsumogiri": 268,
      "draw_1_s4": 269,
      "discard_1_s4_tedashi": 270,
      "discard_1_s4_tsumogiri": 271,
      "draw_1_s0": 272,
      "discard_1_s0_tedashi": 273,
      "discard_1_s0_tsumogiri": 274,
      "draw_1_s5": 275,
      "discard_1_s5_tedashi": 276,
      "discard_1_s5_tsumogiri": 277,
      "draw_1_s6": 278,
      "discard_1_s6_tedashi": 279,
      "discard_1_s6_tsumogiri": 280,
      "draw_1_s7": 281,
      "discard_1_s7_tedashi": 282,
      "discard_1_s7_tsumogiri": 283,
      "draw_1_s8": 284,
      "discard_1_s8_tedashi": 285,
      "discard_1_s8_tsumogiri": 286,
      "draw_1_s9": 287,
      "discard_1_s9_tedashi": 288,
      "discard_1_s9_tsumogiri": 289,
      "draw_1_z1": 290,
      "discard_1_z1_tedashi": 291,
      "discard_1_z1_tsumogiri": 292,
      "draw_1_z2": 293,
      "discard_1_z2_tedashi": 294,
      "discard_1_z2_tsumogiri": 295,
      "draw_1_z3": 296,
      "discard_1_z3_tedashi": 297,
      "discard_1_z3_tsumogiri": 298,
      "draw_1_z4": 299,
      "discard_1_z4_tedashi": 300,
      "discard_1_z4_tsumogiri": 301,
      "draw_1_z5": 302,
      "discard_1_z5_tedashi": 303,
      "discard_1_z5_tsumogiri": 304,
      "draw_1_z6": 305,
      "discard_1_z6_tedashi": 306,
      "discard_1_z6_tsumogiri": 307,
      "draw_1_z7": 308,
      "discard_1_z7_tedashi": 309,
      "discard_1_z7_tsumogiri": 310,
      "draw_2_hidden": 311,
      "draw_2_m1": 312,
      "discard_2_m1_tedashi": 313,
      "discard_2_m1_tsumogiri": 314,
      "draw_2_m2": 315,
      "discard_2_m2_tedashi": 316,
      "discard_2_m2_tsumogiri": 317,
      "draw_2_m3": 318,
      "discard_2_m3_tedashi": 319,
      "discard_2_m3_tsumogiri": 320,
      "draw_2_m4": 321,
      "discard_2_m4_tedashi": 322,
      "discard_2_m4_tsumogiri": 323,
      "draw_2_m0": 324,
      "discard_2_m0_tedashi": 325,
      "discard_2_m0_tsumogiri": 326,
      "draw_2_m5": 327,
      "discard_2_m5_tedashi": 328,
      "discard_2_m5_tsumogiri": 329,
      "draw_2_m6": 330,
      "discard_2_m6_tedashi": 331,
      "discard_2_m6_tsumogiri": 332,
      "draw_2_m7": 333,
      "discard_2_m7_tedashi": 334,
      "discard_2_m7_tsumogiri": 335,
      "draw_2_m8": 336,
      "discard_2_m8_tedashi": 337,
      "discard_2_m8_tsumogiri": 338,
      "draw_2_m9": 339,
      "discard_2_m9_tedashi": 340,
      "discard_2_m9_tsumogiri": 341,
      "draw_2_p1": 342,
      "discard_2_p1_tedashi": 343,
      "discard_2_p1_tsumogiri": 344,
      "draw_2_p2": 345,
      "discard_2_p2_tedashi": 346,
      "discard_2_p2_tsumogiri": 347,
      "draw_2_p3": 348,
      "discard_2_p3_tedashi": 349,
      "discard_2_p3_tsumogiri": 350,
      "draw_2_p4": 351,
      "discard_2_p4_tedashi": 352,
      "discard_2_p4_tsumogiri": 353,
      "draw_2_p0": 354,
      "discard_2_p0_tedashi": 355,
      "discard_2_p0_tsumogiri": 356,
      "draw_2_p5": 357,
      "discard_2_p5_tedashi": 358,
      "discard_2_p5_tsumogiri": 359,
      "draw_2_p6": 360,
      "discard_2_p6_tedashi": 361,
      "discard_2_p6_tsumogiri": 362,
      "draw_2_p7": 363,
      "discard_2_p7_tedashi": 364,
      "discard_2_p7_tsumogiri": 365,
      "draw_2_p8": 366,
      "discard_2_p8_tedashi": 367,
      "discard_2_p8_tsumogiri": 368,
      "draw_2_p9": 369,
      "discard_2_p9_tedashi": 370,
      "discard_2_p9_tsumogiri": 371,
      "draw_2_s1": 372,
      "discard_2_s1_tedashi": 373,
      "discard_2_s1_tsumogiri": 374,
      "draw_2_s2": 375,
      "discard_2_s2_tedashi": 376,
      "discard_2_s2_tsumogiri": 377,
      "draw_2_s3": 378,
      "discard_2_s3_tedashi": 379,
      "discard_2_s3_tsumogiri": 380,
      "draw_2_s4": 381,
      "discard_2_s4_tedashi": 382,
      "discard_2_s4_tsumogiri": 383,
      "draw_2_s0": 384,
      "discard_2_s0_tedashi": 385,
      "discard_2_s0_tsumogiri": 386,
      "draw_2_s5": 387,
      "discard_2_s5_tedashi": 388,
      "discard_2_s5_tsumogiri": 389,
      "draw_2_s6": 390,
      "discard_2_s6_tedashi": 391,
      "discard_2_s6_tsumogiri": 392,
      "draw_2_s7": 393,
      "discard_2_s7_tedashi": 394,
      "discard_2_s7_tsumogiri": 395,
      "draw_2_s8": 396,
      "discard_2_s8_tedashi": 397,
      "discard_2_s8_tsumogiri": 398,
      "draw_2_s9": 399,
      "discard_2_s9_tedashi": 400,
      "discard_2_s9_tsumogiri": 401,
      "draw_2_z1": 402,
      "discard_2_z1_tedashi": 403,
      "discard_2_z1_tsumogiri": 404,
      "draw_2_z2": 405,
      "discard_2_z2_tedashi": 406,
      "discard_2_z2_tsumogiri": 407,
      "draw_2_z3": 408,
      "discard_2_z3_tedashi": 409,
      "discard_2_z3_tsumogiri": 410,
      "draw_2_z4": 411,
      "discard_2_z4_tedashi": 412,
      "discard_2_z4_tsumogiri": 413,
      "draw_2_z5": 414,
      "discard_2_z5_tedashi": 415,
      "discard_2_z5_tsumogiri": 416,
      "draw_2_z6": 417,
      "discard_2_z6_tedashi": 418,
      "discard_2_z6_tsumogiri": 419,
      "draw_2_z7": 420,
      "discard_2_z7_tedashi": 421,
      "discard_2_z7_tsumogiri": 422,
      "draw_3_hidden": 423,
      "draw_3_m1": 424,
      "discard_3_m1_tedashi": 425,
      "discard_3_m1_tsumogiri": 426,
      "draw_3_m2": 427,
      "discard_3_m2_tedashi": 428,
      "discard_3_m2_tsumogiri": 429,
      "draw_3_m3": 430,
      "discard_3_m3_tedashi": 431,
      "discard_3_m3_tsumogiri": 432,
      "draw_3_m4": 433,
      "discard_3_m4_tedashi": 434,
      "discard_3_m4_tsumogiri": 435,
      "draw_3_m0": 436,
      "discard_3_m0_tedashi": 437,
      "discard_3_m0_tsumogiri": 438,
      "draw_3_m5": 439,
      "discard_3_m5_tedashi": 440,
      "discard_3_m5_tsumogiri": 441,
      "draw_3_m6": 442,
      "discard_3_m6_tedashi": 443,
      "discard_3_m6_tsumogiri": 444,
      "draw_3_m7": 445,
      "discard_3_m7_tedashi": 446,
      "discard_3_m7_tsumogiri": 447,
      "draw_3_m8": 448,
      "discard_3_m8_tedashi": 449,
      "discard_3_m8_tsumogiri": 450,
      "draw_3_m9": 451,
      "discard_3_m9_tedashi": 452,
      "discard_3_m9_tsumogiri": 453,
      "draw_3_p1": 454,
      "discard_3_p1_tedashi": 455,
      "discard_3_p1_tsumogiri": 456,
      "draw_3_p2": 457,
      "discard_3_p2_tedashi": 458,
      "discard_3_p2_tsumogiri": 459,
      "draw_3_p3": 460,
      "discard_3_p3_tedashi": 461,
      "discard_3_p3_tsumogiri": 462,
      "draw_3_p4": 463,
      "discard_3_p4_tedashi": 464,
      "discard_3_p4_tsumogiri": 465,
      "draw_3_p0": 466,
      "discard_3_p0_tedashi": 467,
      "discard_3_p0_tsumogiri": 468,
      "draw_3_p5": 469,
      "discard_3_p5_tedashi": 470,
      "discard_3_p5_tsumogiri": 471,
      "draw_3_p6": 472,
      "discard_3_p6_tedashi": 473,
      "discard_3_p6_tsumogiri": 474,
      "draw_3_p7": 475,
      "discard_3_p7_tedashi": 476,
      "discard_3_p7_tsumogiri": 477,
      "draw_3_p8": 478,
      "discard_3_p8_tedashi": 479,
      "discard_3_p8_tsumogiri": 480,
      "draw_3_p9": 481,
      "discard_3_p9_tedashi": 482,
      "discard_3_p9_tsumogiri": 483,
      "draw_3_s1": 484,
      "discard_3_s1_tedashi": 485,
      "discard_3_s1_tsumogiri": 486,
      "draw_3_s2": 487,
      "discard_3_s2_tedashi": 488,
      "discard_3_s2_tsumogiri": 489,
      "draw_3_s3": 490,
      "discard_3_s3_tedashi": 491,
      "discard_3_s3_tsumogiri": 492,
      "draw_3_s4": 493,
      "discard_3_s4_tedashi": 494,
      "discard_3_s4_tsumogiri": 495,
      "draw_3_s0": 496,
      "discard_3_s0_tedashi": 497,
      "discard_3_s0_tsumogiri": 498,
      "draw_3_s5": 499,
      "discard_3_s5_tedashi": 500,
      "discard_3_s5_tsumogiri": 501,
      "draw_3_s6": 502,
      "discard_3_s6_tedashi": 503,
      "discard_3_s6_tsumogiri": 504,
      "draw_3_s7": 505,
      "discard_3_s7_tedashi": 506,
      "discard_3_s7_tsumogiri": 507,
      "draw_3_s8": 508,
      "discard_3_s8_tedashi": 509,
      "discard_3_s8_tsumogiri": 510,
      "draw_3_s9": 511,
      "discard_3_s9_tedashi": 512,
      "discard_3_s9_tsumogiri": 513,
      "draw_3_z1": 514,
      "discard_3_z1_tedashi": 515,
      "discard_3_z1_tsumogiri": 516,
      "draw_3_z2": 517,
      "discard_3_z2_tedashi": 518,
      "discard_3_z2_tsumogiri": 519,
      "draw_3_z3": 520,
      "discard_3_z3_tedashi": 521,
      "discard_3_z3_tsumogiri": 522,
      "draw_3_z4": 523,
      "discard_3_z4_tedashi": 524,
      "discard_3_z4_tsumogiri": 525,
      "draw_3_z5": 526,
      "discard_3_z5_tedashi": 527,
      "discard_3_z5_tsumogiri": 528,
      "draw_3_z6": 529,
      "discard_3_z6_tedashi": 530,
      "discard_3_z6_tsumogiri": 531,
      "draw_3_z7": 532,
      "discard_3_z7_tedashi": 533,
      "discard_3_z7_tsumogiri": 534,
      "opt_self_0_ankan": 535,
      "take_self_0_ankan": 536,
      "pass_self_0_ankan": 537,
      "opt_self_0_kakan": 538,
      "take_self_0_kakan": 539,
      "pass_self_0_kakan": 540,
      "opt_self_0_penuki": 541,
      "take_self_0_penuki": 542,
      "pass_self_0_penuki": 543,
      "opt_self_0_kyushukyuhai": 544,
      "take_self_0_kyushukyuhai": 545,
      "pass_self_0_kyushukyuhai": 546,
      "opt_self_0_riichi": 547,
      "take_self_0_riichi": 548,
      "pass_self_0_riichi": 549,
      "opt_self_0_tsumo": 550,
      "take_self_0_tsumo": 551,
      "pass_self_0_tsumo": 552,
      "opt_self_1_ankan": 553,
      "take_self_1_ankan": 554,
      "pass_self_1_ankan": 555,
      "opt_self_1_kakan": 556,
      "take_self_1_kakan": 557,
      "pass_self_1_kakan": 558,
      "opt_self_1_penuki": 559,
      "take_self_1_penuki": 560,
      "pass_self_1_penuki": 561,
      "opt_self_1_kyushukyuhai": 562,
      "take_self_1_kyushukyuhai": 563,
      "pass_self_1_kyushukyuhai": 564,
      "opt_self_1_riichi": 565,
      "take_self_1_riichi": 566,
      "pass_self_1_riichi": 567,
      "opt_self_1_tsumo": 568,
      "take_self_1_tsumo": 569,
      "pass_self_1_tsumo": 570,
      "opt_self_2_ankan": 571,
      "take_self_2_ankan": 572,
      "pass_self_2_ankan": 573,
      "opt_self_2_kakan": 574,
      "take_self_2_kakan": 575,
      "pass_self_2_kakan": 576,
      "opt_self_2_penuki": 577,
      "take_self_2_penuki": 578,
      "pass_self_2_penuki": 579,
      "opt_self_2_kyushukyuhai": 580,
      "take_self_2_kyushukyuhai": 581,
      "pass_self_2_kyushukyuhai": 582,
      "opt_self_2_riichi": 583,
      "take_self_2_riichi": 584,
      "pass_self_2_riichi": 585,
      "opt_self_2_tsumo": 586,
      "take_self_2_tsumo": 587,
      "pass_self_2_tsumo": 588,
      "opt_self_3_ankan": 589,
      "take_self_3_ankan": 590,
      "pass_self_3_ankan": 591,
      "opt_self_3_kakan": 592,
      "take_self_3_kakan": 593,
      "pass_self_3_kakan": 594,
      "opt_self_3_penuki": 595,
      "take_self_3_penuki": 596,
      "pass_self_3_penuki": 597,
      "opt_self_3_kyushukyuhai": 598,
      "take_self_3_kyushukyuhai": 599,
      "pass_self_3_kyushukyuhai": 600,
      "opt_self_3_riichi": 601,
      "take_self_3_riichi": 602,
      "pass_self_3_riichi": 603,
      "opt_self_3_tsumo": 604,
      "take_self_3_tsumo": 605,
      "pass_self_3_tsumo": 606,
      "opt_react_0_chi": 607,
      "take_react_0_chi": 608,
      "pass_react_0_chi_forced_priority": 609,
      "pass_react_0_chi_voluntary": 610,
      "opt_react_0_minkan": 611,
      "take_react_0_minkan": 612,
      "pass_react_0_minkan_forced_priority": 613,
      "pass_react_0_minkan_voluntary": 614,
      "opt_react_0_pon": 615,
      "take_react_0_pon": 616,
      "pass_react_0_pon_forced_priority": 617,
      "pass_react_0_pon_voluntary": 618,
      "opt_react_0_ron": 619,
      "take_react_0_ron": 620,
      "pass_react_0_ron_voluntary": 621,
      "opt_react_1_chi": 622,
      "take_react_1_chi": 623,
      "pass_react_1_chi_forced_priority": 624,
      "pass_react_1_chi_voluntary": 625,
      "opt_react_1_minkan": 626,
      "take_react_1_minkan": 627,
      "pass_react_1_minkan_forced_priority": 628,
      "pass_react_1_minkan_voluntary": 629,
      "opt_react_1_pon": 630,
      "take_react_1_pon": 631,
      "pass_react_1_pon_forced_priority": 632,
      "pass_react_1_pon_voluntary": 633,
      "opt_react_1_ron": 634,
      "take_react_1_ron": 635,
      "pass_react_1_ron_voluntary": 636,
      "opt_react_2_chi": 637,
      "take_react_2_chi": 638,
      "pass_react_2_chi_forced_priority": 639,
      "pass_react_2_chi_voluntary": 640,
      "opt_react_2_minkan": 641,
      "take_react_2_minkan": 642,
      "pass_react_2_minkan_forced_priority": 643,
      "pass_react_2_minkan_voluntary": 644,
      "opt_react_2_pon": 645,
      "take_react_2_pon": 646,
      "pass_react_2_pon_forced_priority": 647,
      "pass_react_2_pon_voluntary": 648,
      "opt_react_2_ron": 649,
      "take_react_2_ron": 650,
      "pass_react_2_ron_voluntary": 651,
      "opt_react_3_chi": 652,
      "take_react_3_chi": 653,
      "pass_react_3_chi_forced_priority": 654,
      "pass_react_3_chi_voluntary": 655,
      "opt_react_3_minkan": 656,
      "take_react_3_minkan": 657,
      "pass_react_3_minkan_forced_priority": 658,
      "pass_react_3_minkan_voluntary": 659,
      "opt_react_3_pon": 660,
      "take_react_3_pon": 661,
      "pass_react_3_pon_forced_priority": 662,
      "pass_react_3_pon_voluntary": 663,
      "opt_react_3_ron": 664,
      "take_react_3_ron": 665,
      "pass_react_3_ron_voluntary": 666,
      "chi_pos_low": 667,
      "chi_pos_mid": 668,
      "chi_pos_high": 669,
      "red_used": 670,
      "red_not_used": 671,
      "opened_hand_0": 672,
      "opened_hand_1": 673,
      "opened_hand_2": 674,
      "opened_hand_3": 675,
      "score_0": 676,
      "score_delta_0": 677,
      "final_score_0": 678,
      "score_1": 679,
      "score_delta_1": 680,
      "final_score_1": 681,
      "score_2": 682,
      "score_delta_2": 683,
      "final_score_2": 684,
      "score_3": 685,
      "score_delta_3": 686,
      "final_score_3": 687,
      "rank_0_1": 688,
      "rank_0_2": 689,
      "rank_0_3": 690,
      "rank_0_4": 691,
      "rank_1_1": 692,
      "rank_1_2": 693,
      "rank_1_3": 694,
      "rank_1_4": 695,
      "rank_2_1": 696,
      "rank_2_2": 697,
      "rank_2_3": 698,
      "rank_2_4": 699,
      "rank_3_1": 700,
      "rank_3_2": 701,
      "rank_3_3": 702,
      "rank_3_4": 703,
      "final_rank_0_1": 704,
      "final_rank_0_2": 705,
      "final_rank_0_3": 706,
      "final_rank_0_4": 707,
      "final_rank_1_1": 708,
      "final_rank_1_2": 709,
      "final_rank_1_3": 710,
      "final_rank_1_4": 711,
      "final_rank_2_1": 712,
      "final_rank_2_2": 713,
      "final_rank_2_3": 714,
      "final_rank_2_4": 715,
      "final_rank_3_1": 716,
      "final_rank_3_2": 717,
      "final_rank_3_3": 718,
      "final_rank_3_4": 719,
      "yaku_menzen_tsumo": 720,
      "yaku_riichi": 721,
      "yaku_ippatsu": 722,
      "yaku_chankan": 723,
      "yaku_rinshan": 724,
      "yaku_haitei": 725,
      "yaku_houtei": 726,
      "yaku_pinfu": 727,
      "yaku_tanyao": 728,
      "yaku_iipeikou": 729,
      "yaku_jikaze_ton": 730,
      "yaku_jikaze_nan": 731,
      "yaku_jikaze_shaa": 732,
      "yaku_jikaze_pei": 733,
      "yaku_bakaze_ton": 734,
      "yaku_bakaze_nan": 735,
      "yaku_bakaze_shaa": 736,
      "yaku_bakaze_pei": 737,
      "yaku_haku": 738,
      "yaku_hatsu": 739,
      "yaku_chun": 740,
      "yaku_double_riichi": 741,
      "yaku_chiitoitsu": 742,
      "yaku_chanta": 743,
      "yaku_ittsu": 744,
      "yaku_sanshoku_doujun": 745,
      "yaku_sanshoku_doukou": 746,
      "yaku_sankantsu": 747,
      "yaku_toitoi": 748,
      "yaku_sanankou": 749,
      "yaku_shousangen": 750,
      "yaku_honroutou": 751,
      "yaku_ryanpeikou": 752,
      "yaku_junchan": 753,
      "yaku_honitsu": 754,
      "yaku_chinitsu": 755,
      "yaku_tenhou": 756,
      "yaku_chiihou": 757,
      "yaku_daisangen": 758,
      "yaku_suuankou": 759,
      "yaku_suuankou_tanki": 760,
      "yaku_tsuuiisou": 761,
      "yaku_ryuuiisou": 762,
      "yaku_chinroutou": 763,
      "yaku_chuuren_poutou": 764,
      "yaku_junsei_chuuren_poutou": 765,
      "yaku_kokushi_musou": 766,
      "yaku_kokushi_musou_13_wait": 767,
      "yaku_daisuushi": 768,
      "yaku_shousuushi": 769,
      "yaku_suukantsu": 770,
      "yaku_dora": 771,
      "yaku_ura_dora": 772,
      "yaku_aka_dora": 773,
      "han_1": 774,
      "han_2": 775,
      "han_3": 776,
      "han_4": 777,
      "han_5": 778,
      "han_6": 779,
      "han_7": 780,
      "han_8": 781,
      "han_9": 782,
      "han_10": 783,
      "han_11": 784,
      "han_12": 785,
      "han_13": 786,
      "fu_20": 787,
      "fu_25": 788,
      "fu_30": 789,
      "fu_40": 790,
      "fu_50": 791,
      "fu_60": 792,
      "fu_70": 793,
      "fu_80": 794,
      "fu_90": 795,
      "fu_100": 796,
      "fu_110": 797,
      "fu_120": 798,
      "fu_130": 799,
      "fu_140": 800,
      "yakuman_1": 801,
      "yakuman_2": 802,
      "yakuman_3": 803,
      "yakuman_4": 804,
      "yakuman_5": 805,
      "yakuman_6": 806,
      "pingju_ryukyoku": 807,
      "pingju_kyushukyuhai": 808,
      "pingju_nagashimangan": 809,
      "pingju_sufurenda": 810,
      "pingju_sukantsu": 811,
      "pingju_suuchariichi": 812,
      "pingju_sanchahou": 813
    },
    "unk_token": "<unk>"
  }
}