{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "game_start": 4,
      "game_end": 5,
      "view_complete": 6,
      "view_imperfect_0": 7,
      "view_imperfect_1": 8,
      "view_imperfect_2": 9,
      "view_imperfect_3": 10,
      "view_omniscient": 11,
      "rule_player_3": 12,
      "rule_player_4": 13,
      "rule_length_tonpu": 14,
      "rule_length_hanchan": 15,
      "round_start": 16,
      "wall": 17,
      "round_end": 18,
      "bakaze_0": 19,
      "bakaze_1": 20,
      "bakaze_2": 21,
      "kyoku_0": 22,
      "kyoku_1": 23,
      "kyoku_2": 24,
      "kyoku_3": 25,
      "honba": 26,
      "riichi_sticks": 27,
      "TENBO_ZERO": 28,
      "TENBO_PLUS": 29,
      "TENBO_MINUS": 30,
      "TENBO_100": 31,
      "TENBO_200": 32,
      "TENBO_300": 33,
      "TENBO_400": 34,
      "TENBO_500": 35,
      "TENBO_600": 36,
      "TENBO_700": 37,
      "TENBO_800": 38,
      "TENBO_900": 39,
      "TENBO_1000": 40,
      "TENBO_2000": 41,
      "TENBO_3000": 42,
      "TENBO_4000": 43,
      "TENBO_5000": 44,
      "TENBO_6000": 45,
      "TENBO_7000": 46,
      "TENBO_8000": 47,
      "TENBO_9000": 48,
      "TENBO_10000": 49,
      "dora": 50,
      "ura_dora": 51,
      "hidden_haipai_0": 52,
      "hidden_haipai_1": 53,
      "hidden_haipai_2": 54,
      "hidden_haipai_3": 55,
      "haipai_0": 56,
      "haipai_1": 57,
      "haipai_2": 58,
      "haipai_3": 59,
      "m1": 60,
      "m2": 61,
      "m3": 62,
      "m4": 63,
      "m0": 64,
      "m5": 65,
      "m6": 66,
      "m7": 67,
      "m8": 68,
      "m9": 69,
      "p1": 70,
      "p2": 71,
      "p3": 72,
      "p4": 73,
      "p0": 74,
      "p5": 75,
      "p6": 76,
      "p7": 77,
      "p8": 78,
      "p9": 79,
      "s1": 80,
      "s2": 81,
      "s3": 82,
      "s4": 83,
      "s0": 84,
      "s5": 85,
      "s6": 86,
      "s7": 87,
      "s8": 88,
      "s9": 89,
      "z1": 90,
      "z2": 91,
      "z3": 92,
      "z4": 93,
      "z5": 94,
      "z6": 95,
      "z7": 96,
      "draw_0_hidden": 97,
      "draw_0_m1": 98,
      "discard_0_m1_tedashi": 99,
      "discard_0_m1_tsumogiri": 100,
      "draw_0_m2": 101,
      "discard_0_m2_tedashi": 102,
      "discard_0_m2_tsumogiri": 103,
      "draw_0_m3": 104,
      "discard_0_m3_tedashi": 105,
      "discard_0_m3_tsumogiri": 106,
      "draw_0_m4": 107,
      "discard_0_m4_tedashi": 108,
      "discard_0_m4_tsumogiri": 109,
      "draw_0_m0": 110,
      "discard_0_m0_tedashi": 111,
      "discard_0_m0_tsumogiri": 112,
      "draw_0_m5": 113,
      "discard_0_m5_tedashi": 114,
      "discard_0_m5_tsumogiri": 115,
      "draw_0_m6": 116,
      "discard_0_m6_tedashi": 117,
      "discard_0_m6_tsumogiri": 118,
      "draw_0_m7": 119,
      "discard_0_m7_tedashi": 120,
      "discard_0_m7_tsumogiri": 121,
      "draw_0_m8": 122,
      "discard_0_m8_tedashi": 123,
      "discard_0_m8_tsumogiri": 124,
      "draw_0_m9": 125,
      "discard_0_m9_tedashi": 126,
      "discard_0_m9_tsumogiri": 127,
      "draw_0_p1": 128,
      "discard_0_p1_tedashi": 129,
      "discard_0_p1_tsumogiri": 130,
      "draw_0_p2": 131,
      "discard_0_p2_tedashi": 132,
      "discard_0_p2_tsumogiri": 133,
      "draw_0_p3": 134,
      "discard_0_p3_tedashi": 135,
      "discard_0_p3_tsumogiri": 136,
      "draw_0_p4": 137,
      "discard_0_p4_tedashi": 138,
      "discard_0_p4_tsumogiri": 139,
      "draw_0_p0": 140,
      "discard_0_p0_tedashi": 141,
      "discard_0_p0_tsumogiri": 142,
      "draw_0_p5": 143,
      "discard_0_p5_tedashi": 144,
      "discard_0_p5_tsumogiri": 145,
      "draw_0_p6": 146,
      "discard_0_p6_tedashi": 147,
      "discard_0_p6_tsumogiri": 148,
      "draw_0_p7": 149,
      "discard_0_p7_tedashi": 150,
      "discard_0_p7_tsumogiri": 151,
      "draw_0_p8": 152,
      "discard_0_p8_tedashi": 153,
      "discard_0_p8_tsumogiri": 154,
      "draw_0_p9": 155,
      "discard_0_p9_tedashi": 156,
      "discard_0_p9_tsumogiri": 157,
      "draw_0_s1": 158,
      "discard_0_s1_tedashi": 159,
      "discard_0_s1_tsumogiri": 160,
      "draw_0_s2": 161,
      "discard_0_s2_tedashi": 162,
      "discard_0_s2_tsumogiri": 163,
      "draw_0_s3": 164,
      "discard_0_s3_tedashi": 165,
      "discard_0_s3_tsumogiri": 166,
      "draw_0_s4": 167,
      "discard_0_s4_tedashi": 168,
      "discard_0_s4_tsumogiri": 169,
      "draw_0_s0": 170,
      "discard_0_s0_tedashi": 171,
      "discard_0_s0_tsumogiri": 172,
      "draw_0_s5": 173,
      "discard_0_s5_tedashi": 174,
      "discard_0_s5_tsumogiri": 175,
      "draw_0_s6": 176,
      "discard_0_s6_tedashi": 177,
      "discard_0_s6_tsumogiri": 178,
      "draw_0_s7": 179,
      "discard_0_s7_tedashi": 180,
      "discard_0_s7_tsumogiri": 181,
      "draw_0_s8": 182,
      "discard_0_s8_tedashi": 183,
      "discard_0_s8_tsumogiri": 184,
      "draw_0_s9": 185,
      "discard_0_s9_tedashi": 186,
      "discard_0_s9_tsumogiri": 187,
      "draw_0_z1": 188,
      "discard_0_z1_tedashi": 189,
      "discard_0_z1_tsumogiri": 190,
      "draw_0_z2": 191,
      "discard_0_z2_tedashi": 192,
      "discard_0_z2_tsumogiri": 193,
      "draw_0_z3": 194,
      "discard_0_z3_tedashi": 195,
      "discard_0_z3_tsumogiri": 196,
      "draw_0_z4": 197,
      "discard_0_z4_tedashi": 198,
      "discard_0_z4_tsumogiri": 199,
      "draw_0_z5": 200,
      "discard_0_z5_tedashi": 201,
      "discard_0_z5_tsumogiri": 202,
      "draw_0_z6": 203,
      "discard_0_z6_tedashi": 204,
      "discard_0_z6_tsumogiri": 205,
      "draw_0_z7": 206,
      "discard_0_z7_tedashi": 207,
      "discard_0_z7_tsumogiri": 208,
      "draw_1_hidden": 209,
      "draw_1_m1": 210,
      "discard_1_m1_tedashi": 211,
      "discard_1_m1_tsumogiri": 212,
      "draw_1_m2": 213,
      "discard_1_m2_tedashi": 214,
      "discard_1_m2_tsumogiri": 215,
      "draw_1_m3": 216,
      "discard_1_m3_tedashi": 217,
      "discard_1_m3_tsumogiri": 218,
      "draw_1_m4": 219,
      "discard_1_m4_tedashi": 220,
      "discard_1_m4_tsumogiri": 221,
      "draw_1_m0": 222,
      "discard_1_m0_tedashi": 223,
      "discard_1_m0_tsumogiri": 224,
      "draw_1_m5": 225,
      "discard_1_m5_tedashi": 226,
      "discard_1_m5_tsumogiri": 227,
      "draw_1_m6": 228,
      "discard_1_m6_tedashi": 229,
      "discard_1_m6_tsumogiri": 230,
      "draw_1_m7": 231,
      "discard_1_m7_tedashi": 232,
      "discard_1_m7_tsumogiri": 233,
      "draw_1_m8": 234,
      "discard_1_m8_tedashi": 235,
      "discard_1_m8_tsumogiri": 236,
      "draw_1_m9": 237,
      "discard_1_m9_tedashi": 238,
      "discard_1_m9_tsumogiri": 239,
      "draw_1_p1": 240,
      "discard_1_p1_tedashi": 241,
      "discard_1_p1_tsumogiri": 242,
      "draw_1_p2": 243,
      "discard_1_p2_tedashi": 244,
      "discard_1_p2_tsumogiri": 245,
      "draw_1_p3": 246,
      "discard_1_p3_tedashi": 247,
      "discard_1_p3_tsumogiri": 248,
      "draw_1_p4": 249,
      "discard_1_p4_tedashi": 250,
      "discard_1_p4_tsumogiri": 251,
      "draw_1_p0": 252,
      "discard_1_p0_tedashi": 253,
      "discard_1_p0_tsumogiri": 254,
      "draw_1_p5": 255,
      "discard_1_p5_tedashi": 256,
      "discard_1_p5_tsumogiri": 257,
      "draw_1_p6": 258,
      "discard_1_p6_tedashi": 259,
      "discard_1_p6_tsumogiri": 260,
      "draw_1_p7": 261,
      "discard_1_p7_tedashi": 262,
      "discard_1_p7_tsumogiri": 263,
      "draw_1_p8": 264,
      "discard_1_p8_tedashi": 265,
      "discard_1_p8_tsumogiri": 266,
      "draw_1_p9": 267,
      "discard_1_p9_tedashi": 268,
      "discard_1_p9_tsumogiri": 269,
      "draw_1_s1": 270,
      "discard_1_s1_tedashi": 271,
      "discard_1_s1_tsumogiri": 272,
      "draw_1_s2": 273,
      "discard_1_s2_tedashi": 274,
      "discard_1_s2_tsumogiri": 275,
      "draw_1_s3": 276,
      "discard_1_s3_tedashi": 277,
      "discard_1_s3_tsumogiri": 278,
      "draw_1_s4": 279,
      "discard_1_s4_tedashi": 280,
      "discard_1_s4_tsumogiri": 281,
      "draw_1_s0": 282,
      "discard_1_s0_tedashi": 283,
      "discard_1_s0_tsumogiri": 284,
      "draw_1_s5": 285,
      "discard_1_s5_tedashi": 286,
      "discard_1_s5_tsumogiri": 287,
      "draw_1_s6": 288,
      "discard_1_s6_tedashi": 289,
      "discard_1_s6_tsumogiri": 290,
      "draw_1_s7": 291,
      "discard_1_s7_tedashi": 292,
      "discard_1_s7_tsumogiri": 293,
      "draw_1_s8": 294,
      "discard_1_s8_tedashi": 295,
      "discard_1_s8_tsumogiri": 296,
      "draw_1_s9": 297,
      "discard_1_s9_tedashi": 298,
      "discard_1_s9_tsumogiri": 299,
      "draw_1_z1": 300,
      "discard_1_z1_tedashi": 301,
      "discard_1_z1_tsumogiri": 302,
      "draw_1_z2": 303,
      "discard_1_z2_tedashi": 304,
      "discard_1_z2_tsumogiri": 305,
      "draw_1_z3": 306,
      "discard_1_z3_tedashi": 307,
      "discard_1_z3_tsumogiri": 308,
      "draw_1_z4": 309,
      "discard_1_z4_tedashi": 310,
      "discard_1_z4_tsumogiri": 311,
      "draw_1_z5": 312,
      "discard_1_z5_tedashi": 313,
      "discard_1_z5_tsumogiri": 314,
      "draw_1_z6": 315,
      "discard_1_z6_tedashi": 316,
      "discard_1_z6_tsumogiri": 317,
      "draw_1_z7": 318,
      "discard_1_z7_tedashi": 319,
      "discard_1_z7_tsumogiri": 320,
      "draw_2_hidden": 321,
      "draw_2_m1": 322,
      "discard_2_m1_tedashi": 323,
      "discard_2_m1_tsumogiri": 324,
      "draw_2_m2": 325,
      "discard_2_m2_tedashi": 326,
      "discard_2_m2_tsumogiri": 327,
      "draw_2_m3": 328,
      "discard_2_m3_tedashi": 329,
      "discard_2_m3_tsumogiri": 330,
      "draw_2_m4": 331,
      "discard_2_m4_tedashi": 332,
      "discard_2_m4_tsumogiri": 333,
      "draw_2_m0": 334,
      "discard_2_m0_tedashi": 335,
      "discard_2_m0_tsumogiri": 336,
      "draw_2_m5": 337,
      "discard_2_m5_tedashi": 338,
      "discard_2_m5_tsumogiri": 339,
      "draw_2_m6": 340,
      "discard_2_m6_tedashi": 341,
      "discard_2_m6_tsumogiri": 342,
      "draw_2_m7": 343,
      "discard_2_m7_tedashi": 344,
      "discard_2_m7_tsumogiri": 345,
      "draw_2_m8": 346,
      "discard_2_m8_tedashi": 347,
      "discard_2_m8_tsumogiri": 348,
      "draw_2_m9": 349,
      "discard_2_m9_tedashi": 350,
      "discard_2_m9_tsumogiri": 351,
      "draw_2_p1": 352,
      "discard_2_p1_tedashi": 353,
      "discard_2_p1_tsumogiri": 354,
      "draw_2_p2": 355,
      "discard_2_p2_tedashi": 356,
      "discard_2_p2_tsumogiri": 357,
      "draw_2_p3": 358,
      "discard_2_p3_tedashi": 359,
      "discard_2_p3_tsumogiri": 360,
      "draw_2_p4": 361,
      "discard_2_p4_tedashi": 362,
      "discard_2_p4_tsumogiri": 363,
      "draw_2_p0": 364,
      "discard_2_p0_tedashi": 365,
      "discard_2_p0_tsumogiri": 366,
      "draw_2_p5": 367,
      "discard_2_p5_tedashi": 368,
      "discard_2_p5_tsumogiri": 369,
      "draw_2_p6": 370,
      "discard_2_p6_tedashi": 371,
      "discard_2_p6_tsumogiri": 372,
      "draw_2_p7": 373,
      "discard_2_p7_tedashi": 374,
      "discard_2_p7_tsumogiri": 375,
      "draw_2_p8": 376,
      "discard_2_p8_tedashi": 377,
      "discard_2_p8_tsumogiri": 378,
      "draw_2_p9": 379,
      "discard_2_p9_tedashi": 380,
      "discard_2_p9_tsumogiri": 381,
      "draw_2_s1": 382,
      "discard_2_s1_tedashi": 383,
      "discard_2_s1_tsumogiri": 384,
      "draw_2_s2": 385,
      "discard_2_s2_tedashi": 386,
      "discard_2_s2_tsumogiri": 387,
      "draw_2_s3": 388,
      "discard_2_s3_tedashi": 389,
      "discard_2_s3_tsumogiri": 390,
      "draw_2_s4": 391,
      "discard_2_s4_tedashi": 392,
      "discard_2_s4_tsumogiri": 393,
      "draw_2_s0": 394,
      "discard_2_s0_tedashi": 395,
      "discard_2_s0_tsumogiri": 396,
      "draw_2_s5": 397,
      "discard_2_s5_tedashi": 398,
      "discard_2_s5_tsumogiri": 399,
      "draw_2_s6": 400,
      "discard_2_s6_tedashi": 401,
      "discard_2_s6_tsumogiri": 402,
      "draw_2_s7": 403,
      "discard_2_s7_tedashi": 404,
      "discard_2_s7_tsumogiri": 405,
      "draw_2_s8": 406,
      "discard_2_s8_tedashi": 407,
      "discard_2_s8_tsumogiri": 408,
      "draw_2_s9": 409,
      "discard_2_s9_tedashi": 410,
      "discard_2_s9_tsumogiri": 411,
      "draw_2_z1": 412,
      "discard_2_z1_tedashi": 413,
      "discard_2_z1_tsumogiri": 414,
      "draw_2_z2": 415,
      "discard_2_z2_tedashi": 416,
      "discard_2_z2_tsumogiri": 417,
      "draw_2_z3": 418,
      "discard_2_z3_tedashi": 419,
      "discard_2_z3_tsumogiri": 420,
      "draw_2_z4": 421,
      "discard_2_z4_tedashi": 422,
      "discard_2_z4_tsumogiri": 423,
      "draw_2_z5": 424,
      "discard_2_z5_tedashi": 425,
      "discard_2_z5_tsumogiri": 426,
      "draw_2_z6": 427,
      "discard_2_z6_tedashi": 428,
      "discard_2_z6_tsumogiri": 429,
      "draw_2_z7": 430,
      "discard_2_z7_tedashi": 431,
      "discard_2_z7_tsumogiri": 432,
      "draw_3_hidden": 433,
      "draw_3_m1": 434,
      "discard_3_m1_tedashi": 435,
      "discard_3_m1_tsumogiri": 436,
      "draw_3_m2": 437,
      "discard_3_m2_tedashi": 438,
      "discard_3_m2_tsumogiri": 439,
      "draw_3_m3": 440,
      "discard_3_m3_tedashi": 441,
      "discard_3_m3_tsumogiri": 442,
      "draw_3_m4": 443,
      "discard_3_m4_tedashi": 444,
      "discard_3_m4_tsumogiri": 445,
      "draw_3_m0": 446,
      "discard_3_m0_tedashi": 447,
      "discard_3_m0_tsumogiri": 448,
      "draw_3_m5": 449,
      "discard_3_m5_tedashi": 450,
      "discard_3_m5_tsumogiri": 451,
      "draw_3_m6": 452,
      "discard_3_m6_tedashi": 453,
      "discard_3_m6_tsumogiri": 454,
      "draw_3_m7": 455,
      "discard_3_m7_tedashi": 456,
      "discard_3_m7_tsumogiri": 457,
      "draw_3_m8": 458,
      "discard_3_m8_tedashi": 459,
      "discard_3_m8_tsumogiri": 460,
      "draw_3_m9": 461,
      "discard_3_m9_tedashi": 462,
      "discard_3_m9_tsumogiri": 463,
      "draw_3_p1": 464,
      "discard_3_p1_tedashi": 465,
      "discard_3_p1_tsumogiri": 466,
      "draw_3_p2": 467,
      "discard_3_p2_tedashi": 468,
      "discard_3_p2_tsumogiri": 469,
      "draw_3_p3": 470,
      "discard_3_p3_tedashi": 471,
      "discard_3_p3_tsumogiri": 472,
      "draw_3_p4": 473,
      "discard_3_p4_tedashi": 474,
      "discard_3_p4_tsumogiri": 475,
      "draw_3_p0": 476,
      "discard_3_p0_tedashi": 477,
      "discard_3_p0_tsumogiri": 478,
      "draw_3_p5": 479,
      "discard_3_p5_tedashi": 480,
      "discard_3_p5_tsumogiri": 481,
      "draw_3_p6": 482,
      "discard_3_p6_tedashi": 483,
      "discard_3_p6_tsumogiri": 484,
      "draw_3_p7": 485,
      "discard_3_p7_tedashi": 486,
      "discard_3_p7_tsumogiri": 487,
      "draw_3_p8": 488,
      "discard_3_p8_tedashi": 489,
      "discard_3_p8_tsumogiri": 490,
      "draw_3_p9": 491,
      "discard_3_p9_tedashi": 492,
      "discard_3_p9_tsumogiri": 493,
      "draw_3_s1": 494,
      "discard_3_s1_tedashi": 495,
      "discard_3_s1_tsumogiri": 496,
      "draw_3_s2": 497,
      "discard_3_s2_tedashi": 498,
      "discard_3_s2_tsumogiri": 499,
      "draw_3_s3": 500,
      "discard_3_s3_tedashi": 501,
      "discard_3_s3_tsumogiri": 502,
      "draw_3_s4": 503,
      "discard_3_s4_tedashi": 504,
      "discard_3_s4_tsumogiri": 505,
      "draw_3_s0": 506,
      "discard_3_s0_tedashi": 507,
      "discard_3_s0_tsumogiri": 508,
      "draw_3_s5": 509,
      "discard_3_s5_tedashi": 510,
      "discard_3_s5_tsumogiri": 511,
      "draw_3_s6": 512,
      "discard_3_s6_tedashi": 513,
      "discard_3_s6_tsumogiri": 514,
      "draw_3_s7": 515,
      "discard_3_s7_tedashi": 516,
      "discard_3_s7_tsumogiri": 517,
      "draw_3_s8": 518,
      "discard_3_s8_tedashi": 519,
      "discard_3_s8_tsumogiri": 520,
      "draw_3_s9": 521,
      "discard_3_s9_tedashi": 522,
      "discard_3_s9_tsumogiri": 523,
      "draw_3_z1": 524,
      "discard_3_z1_tedashi": 525,
      "discard_3_z1_tsumogiri": 526,
      "draw_3_z2": 527,
      "discard_3_z2_tedashi": 528,
      "discard_3_z2_tsumogiri": 529,
      "draw_3_z3": 530,
      "discard_3_z3_tedashi": 531,
      "discard_3_z3_tsumogiri": 532,
      "draw_3_z4": 533,
      "discard_3_z4_tedashi": 534,
      "discard_3_z4_tsumogiri": 535,
      "draw_3_z5": 536,
      "discard_3_z5_tedashi": 537,
      "discard_3_z5_tsumogiri": 538,
      "draw_3_z6": 539,
      "discard_3_z6_tedashi": 540,
      "discard_3_z6_tsumogiri": 541,
      "draw_3_z7": 542,
      "discard_3_z7_tedashi": 543,
      "discard_3_z7_tsumogiri": 544,
      "opt_self_0_ankan": 545,
      "take_self_0_ankan": 546,
      "pass_self_0_ankan": 547,
      "opt_self_0_kakan": 548,
      "take_self_0_kakan": 549,
      "pass_self_0_kakan": 550,
      "opt_self_0_penuki": 551,
      "take_self_0_penuki": 552,
      "pass_self_0_penuki": 553,
      "opt_self_0_kyushukyuhai": 554,
      "take_self_0_kyushukyuhai": 555,
      "pass_self_0_kyushukyuhai": 556,
      "opt_self_0_riichi": 557,
      "take_self_0_riichi": 558,
      "pass_self_0_riichi": 559,
      "opt_self_0_tsumo": 560,
      "take_self_0_tsumo": 561,
      "pass_self_0_tsumo": 562,
      "opt_self_1_ankan": 563,
      "take_self_1_ankan": 564,
      "pass_self_1_ankan": 565,
      "opt_self_1_kakan": 566,
      "take_self_1_kakan": 567,
      "pass_self_1_kakan": 568,
      "opt_self_1_penuki": 569,
      "take_self_1_penuki": 570,
      "pass_self_1_penuki": 571,
      "opt_self_1_kyushukyuhai": 572,
      "take_self_1_kyushukyuhai": 573,
      "pass_self_1_kyushukyuhai": 574,
      "opt_self_1_riichi": 575,
      "take_self_1_riichi": 576,
      "pass_self_1_riichi": 577,
      "opt_self_1_tsumo": 578,
      "take_self_1_tsumo": 579,
      "pass_self_1_tsumo": 580,
      "opt_self_2_ankan": 581,
      "take_self_2_ankan": 582,
      "pass_self_2_ankan": 583,
      "opt_self_2_kakan": 584,
      "take_self_2_kakan": 585,
      "pass_self_2_kakan": 586,
      "opt_self_2_penuki": 587,
      "take_self_2_penuki": 588,
      "pass_self_2_penuki": 589,
      "opt_self_2_kyushukyuhai": 590,
      "take_self_2_kyushukyuhai": 591,
      "pass_self_2_kyushukyuhai": 592,
      "opt_self_2_riichi": 593,
      "take_self_2_riichi": 594,
      "pass_self_2_riichi": 595,
      "opt_self_2_tsumo": 596,
      "take_self_2_tsumo": 597,
      "pass_self_2_tsumo": 598,
      "opt_self_3_ankan": 599,
      "take_self_3_ankan": 600,
      "pass_self_3_ankan": 601,
      "opt_self_3_kakan": 602,
      "take_self_3_kakan": 603,
      "pass_self_3_kakan": 604,
      "opt_self_3_penuki": 605,
      "take_self_3_penuki": 606,
      "pass_self_3_penuki": 607,
      "opt_self_3_kyushukyuhai": 608,
      "take_self_3_kyushukyuhai": 609,
      "pass_self_3_kyushukyuhai": 610,
      "opt_self_3_riichi": 611,
      "take_self_3_riichi": 612,
      "pass_self_3_riichi": 613,
      "opt_self_3_tsumo": 614,
      "take_self_3_tsumo": 615,
      "pass_self_3_tsumo": 616,
      "opt_react_0_chi": 617,
      "take_react_0_chi": 618,
      "pass_react_0_chi_forced_priority": 619,
      "pass_react_0_chi_voluntary": 620,
      "opt_react_0_minkan": 621,
      "take_react_0_minkan": 622,
      "pass_react_0_minkan_forced_priority": 623,
      "pass_react_0_minkan_voluntary": 624,
      "opt_react_0_pon": 625,
      "take_react_0_pon": 626,
      "pass_react_0_pon_forced_priority": 627,
      "pass_react_0_pon_voluntary": 628,
      "opt_react_0_ron": 629,
      "take_react_0_ron": 630,
      "pass_react_0_ron_voluntary": 631,
      "opt_react_1_chi": 632,
      "take_react_1_chi": 633,
      "pass_react_1_chi_forced_priority": 634,
      "pass_react_1_chi_voluntary": 635,
      "opt_react_1_minkan": 636,
      "take_react_1_minkan": 637,
      "pass_react_1_minkan_forced_priority": 638,
      "pass_react_1_minkan_voluntary": 639,
      "opt_react_1_pon": 640,
      "take_react_1_pon": 641,
      "pass_react_1_pon_forced_priority": 642,
      "pass_react_1_pon_voluntary": 643,
      "opt_react_1_ron": 644,
      "take_react_1_ron": 645,
      "pass_react_1_ron_voluntary": 646,
      "opt_react_2_chi": 647,
      "take_react_2_chi": 648,
      "pass_react_2_chi_forced_priority": 649,
      "pass_react_2_chi_voluntary": 650,
      "opt_react_2_minkan": 651,
      "take_react_2_minkan": 652,
      "pass_react_2_minkan_forced_priority": 653,
      "pass_react_2_minkan_voluntary": 654,
      "opt_react_2_pon": 655,
      "take_react_2_pon": 656,
      "pass_react_2_pon_forced_priority": 657,
      "pass_react_2_pon_voluntary": 658,
      "opt_react_2_ron": 659,
      "take_react_2_ron": 660,
      "pass_react_2_ron_voluntary": 661,
      "opt_react_3_chi": 662,
      "take_react_3_chi": 663,
      "pass_react_3_chi_forced_priority": 664,
      "pass_react_3_chi_voluntary": 665,
      "opt_react_3_minkan": 666,
      "take_react_3_minkan": 667,
      "pass_react_3_minkan_forced_priority": 668,
      "pass_react_3_minkan_voluntary": 669,
      "opt_react_3_pon": 670,
      "take_react_3_pon": 671,
      "pass_react_3_pon_forced_priority": 672,
      "pass_react_3_pon_voluntary": 673,
      "opt_react_3_ron": 674,
      "take_react_3_ron": 675,
      "pass_react_3_ron_voluntary": 676,
      "chi_pos_low": 677,
      "chi_pos_mid": 678,
      "chi_pos_high": 679,
      "red_used": 680,
      "red_not_used": 681,
      "hule_0": 682,
      "hule_1": 683,
      "hule_2": 684,
      "hule_3": 685,
      "opened_hand_0": 686,
      "opened_hand_1": 687,
      "opened_hand_2": 688,
      "opened_hand_3": 689,
      "score_0": 690,
      "score_delta_0": 691,
      "final_score_0": 692,
      "score_1": 693,
      "score_delta_1": 694,
      "final_score_1": 695,
      "score_2": 696,
      "score_delta_2": 697,
      "final_score_2": 698,
      "score_3": 699,
      "score_delta_3": 700,
      "final_score_3": 701,
      "rank_0_1": 702,
      "rank_0_2": 703,
      "rank_0_3": 704,
      "rank_0_4": 705,
      "rank_1_1": 706,
      "rank_1_2": 707,
      "rank_1_3": 708,
      "rank_1_4": 709,
      "rank_2_1": 710,
      "rank_2_2": 711,
      "rank_2_3": 712,
      "rank_2_4": 713,
      "rank_3_1": 714,
      "rank_3_2": 715,
      "rank_3_3": 716,
      "rank_3_4": 717,
      "final_rank_0_1": 718,
      "final_rank_0_2": 719,
      "final_rank_0_3": 720,
      "final_rank_0_4": 721,
      "final_rank_1_1": 722,
      "final_rank_1_2": 723,
      "final_rank_1_3": 724,
      "final_rank_1_4": 725,
      "final_rank_2_1": 726,
      "final_rank_2_2": 727,
      "final_rank_2_3": 728,
      "final_rank_2_4": 729,
      "final_rank_3_1": 730,
      "final_rank_3_2": 731,
      "final_rank_3_3": 732,
      "final_rank_3_4": 733,
      "yaku_menzen_tsumo": 734,
      "yaku_riichi": 735,
      "yaku_ippatsu": 736,
      "yaku_chankan": 737,
      "yaku_rinshan": 738,
      "yaku_haitei": 739,
      "yaku_houtei": 740,
      "yaku_pinfu": 741,
      "yaku_tanyao": 742,
      "yaku_iipeikou": 743,
      "yaku_jikaze_ton": 744,
      "yaku_jikaze_nan": 745,
      "yaku_jikaze_shaa": 746,
      "yaku_jikaze_pei": 747,
      "yaku_bakaze_ton": 748,
      "yaku_bakaze_nan": 749,
      "yaku_bakaze_shaa": 750,
      "yaku_bakaze_pei": 751,
      "yaku_haku": 752,
      "yaku_hatsu": 753,
      "yaku_chun": 754,
      "yaku_double_riichi": 755,
      "yaku_chiitoitsu": 756,
      "yaku_chanta": 757,
      "yaku_ittsu": 758,
      "yaku_sanshoku_doujun": 759,
      "yaku_sanshoku_doukou": 760,
      "yaku_sankantsu": 761,
      "yaku_toitoi": 762,
      "yaku_sanankou": 763,
      "yaku_shousangen": 764,
      "yaku_honroutou": 765,
      "yaku_ryanpeikou": 766,
      "yaku_junchan": 767,
      "yaku_honitsu": 768,
      "yaku_chinitsu": 769,
      "yaku_tenhou": 770,
      "yaku_chiihou": 771,
      "yaku_daisangen": 772,
      "yaku_suuankou": 773,
      "yaku_suuankou_tanki": 774,
      "yaku_tsuuiisou": 775,
      "yaku_ryuuiisou": 776,
      "yaku_chinroutou": 777,
      "yaku_chuuren_poutou": 778,
      "yaku_junsei_chuuren_poutou": 779,
      "yaku_kokushi_musou": 780,
      "yaku_kokushi_musou_13_wait": 781,
      "yaku_daisuushi": 782,
      "yaku_shousuushi": 783,
      "yaku_suukantsu": 784,
      "yaku_dora": 785,
      "yaku_ura_dora": 786,
      "yaku_aka_dora": 787,
      "han_1": 788,
      "han_2": 789,
      "han_3": 790,
      "han_4": 791,
      "han_5": 792,
      "han_6": 793,
      "han_7": 794,
      "han_8": 795,
      "han_9": 796,
      "han_10": 797,
      "han_11": 798,
      "han_12": 799,
      "han_13": 800,
      "fu_20": 801,
      "fu_25": 802,
      "fu_30": 803,
      "fu_40": 804,
      "fu_50": 805,
      "fu_60": 806,
      "fu_70": 807,
      "fu_80": 808,
      "fu_90": 809,
      "fu_100": 810,
      "fu_110": 811,
      "fu_120": 812,
      "fu_130": 813,
      "fu_140": 814,
      "yakuman_1": 815,
      "yakuman_2": 816,
      "yakuman_3": 817,
      "yakuman_4": 818,
      "yakuman_5": 819,
      "yakuman_6": 820,
      "pingju_ryukyoku": 821,
      "pingju_kyushukyuhai": 822,
      "pingju_nagashimangan": 823,
      "pingju_sufurenda": 824,
      "pingju_sukantsu": 825,
      "pingju_suuchariichi": 826,
      "pingju_sanchahou": 827
    },
    "unk_token": "<unk>"
  }
}