{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "game_start": 4,
      "rule_player_3": 5,
      "rule_player_4": 6,
      "rule_length_tonpu": 7,
      "rule_length_hanchan": 8,
      "game_end": 9,
      "round_start": 10,
      "bakaze_0": 11,
      "bakaze_1": 12,
      "bakaze_2": 13,
      "kyoku_0": 14,
      "kyoku_1": 15,
      "kyoku_2": 16,
      "kyoku_3": 17,
      "honba": 18,
      "riichi_sticks": 19,
      "TENBO_ZERO": 20,
      "TENBO_PLUS": 21,
      "TENBO_MINUS": 22,
      "TENBO_100": 23,
      "TENBO_200": 24,
      "TENBO_300": 25,
      "TENBO_500": 26,
      "TENBO_1000": 27,
      "TENBO_2000": 28,
      "TENBO_3000": 29,
      "TENBO_5000": 30,
      "TENBO_10000": 31,
      "TENBO_20000": 32,
      "TENBO_30000": 33,
      "dora": 34,
      "ura_dora": 35,
      "m1": 36,
      "m2": 37,
      "m3": 38,
      "m4": 39,
      "m0": 40,
      "m5": 41,
      "m6": 42,
      "m7": 43,
      "m8": 44,
      "m9": 45,
      "p1": 46,
      "p2": 47,
      "p3": 48,
      "p4": 49,
      "p0": 50,
      "p5": 51,
      "p6": 52,
      "p7": 53,
      "p8": 54,
      "p9": 55,
      "s1": 56,
      "s2": 57,
      "s3": 58,
      "s4": 59,
      "s0": 60,
      "s5": 61,
      "s6": 62,
      "s7": 63,
      "s8": 64,
      "s9": 65,
      "z1": 66,
      "z2": 67,
      "z3": 68,
      "z4": 69,
      "z5": 70,
      "z6": 71,
      "z7": 72,
      "score_0": 73,
      "score_delta_0": 74,
      "final_score_0": 75,
      "score_1": 76,
      "score_delta_1": 77,
      "final_score_1": 78,
      "score_2": 79,
      "score_delta_2": 80,
      "final_score_2": 81,
      "score_3": 82,
      "score_delta_3": 83,
      "final_score_3": 84,
      "rank_0_1": 85,
      "rank_0_2": 86,
      "rank_0_3": 87,
      "rank_0_4": 88,
      "rank_1_1": 89,
      "rank_1_2": 90,
      "rank_1_3": 91,
      "rank_1_4": 92,
      "rank_2_1": 93,
      "rank_2_2": 94,
      "rank_2_3": 95,
      "rank_2_4": 96,
      "rank_3_1": 97,
      "rank_3_2": 98,
      "rank_3_3": 99,
      "rank_3_4": 100,
      "final_rank_0_1": 101,
      "final_rank_0_2": 102,
      "final_rank_0_3": 103,
      "final_rank_0_4": 104,
      "final_rank_1_1": 105,
      "final_rank_1_2": 106,
      "final_rank_1_3": 107,
      "final_rank_1_4": 108,
      "final_rank_2_1": 109,
      "final_rank_2_2": 110,
      "final_rank_2_3": 111,
      "final_rank_2_4": 112,
      "final_rank_3_1": 113,
      "final_rank_3_2": 114,
      "final_rank_3_3": 115,
      "final_rank_3_4": 116,
      "yaku_menzen_tsumo": 117,
      "yaku_riichi": 118,
      "yaku_ippatsu": 119,
      "yaku_chankan": 120,
      "yaku_rinshan": 121,
      "yaku_haitei": 122,
      "yaku_houtei": 123,
      "yaku_pinfu": 124,
      "yaku_tanyao": 125,
      "yaku_iipeikou": 126,
      "yaku_jikaze_ton": 127,
      "yaku_jikaze_nan": 128,
      "yaku_jikaze_shaa": 129,
      "yaku_jikaze_pei": 130,
      "yaku_bakaze_ton": 131,
      "yaku_bakaze_nan": 132,
      "yaku_bakaze_shaa": 133,
      "yaku_bakaze_pei": 134,
      "yaku_haku": 135,
      "yaku_hatsu": 136,
      "yaku_chun": 137,
      "yaku_double_riichi": 138,
      "yaku_chiitoitsu": 139,
      "yaku_chanta": 140,
      "yaku_ittsu": 141,
      "yaku_sanshoku_doujun": 142,
      "yaku_sanshoku_doukou": 143,
      "yaku_sankantsu": 144,
      "yaku_toitoi": 145,
      "yaku_sanankou": 146,
      "yaku_shousangen": 147,
      "yaku_honroutou": 148,
      "yaku_ryanpeikou": 149,
      "yaku_junchan": 150,
      "yaku_honitsu": 151,
      "yaku_chinitsu": 152,
      "yaku_tenhou": 153,
      "yaku_chiihou": 154,
      "yaku_daisangen": 155,
      "yaku_suuankou": 156,
      "yaku_suuankou_tanki": 157,
      "yaku_tsuuiisou": 158,
      "yaku_ryuuiisou": 159,
      "yaku_chinroutou": 160,
      "yaku_chuuren_poutou": 161,
      "yaku_junsei_chuuren_poutou": 162,
      "yaku_kokushi_musou": 163,
      "yaku_kokushi_musou_13_wait": 164,
      "yaku_daisuushi": 165,
      "yaku_shousuushi": 166,
      "yaku_suukantsu": 167,
      "yaku_dora": 168,
      "yaku_ura_dora": 169,
      "yaku_aka_dora": 170,
      "han_1": 171,
      "han_2": 172,
      "han_3": 173,
      "han_4": 174,
      "han_5": 175,
      "han_6": 176,
      "han_7": 177,
      "han_8": 178,
      "han_9": 179,
      "han_10": 180,
      "han_11": 181,
      "han_12": 182,
      "han_13": 183,
      "fu_20": 184,
      "fu_25": 185,
      "fu_30": 186,
      "fu_40": 187,
      "fu_50": 188,
      "fu_60": 189,
      "fu_70": 190,
      "fu_80": 191,
      "fu_90": 192,
      "fu_100": 193,
      "fu_110": 194,
      "yakuman_1": 195,
      "yakuman_2": 196,
      "yakuman_3": 197,
      "yakuman_4": 198,
      "yakuman_5": 199,
      "yakuman_6": 200,
      "opened_hand_0": 201,
      "opened_hand_1": 202,
      "opened_hand_2": 203,
      "opened_hand_3": 204,
      "haipai_0": 205,
      "haipai_1": 206,
      "haipai_2": 207,
      "haipai_3": 208,
      "draw_0_m1": 209,
      "discard_0_m1": 210,
      "draw_0_m2": 211,
      "discard_0_m2": 212,
      "draw_0_m3": 213,
      "discard_0_m3": 214,
      "draw_0_m4": 215,
      "discard_0_m4": 216,
      "draw_0_m0": 217,
      "discard_0_m0": 218,
      "draw_0_m5": 219,
      "discard_0_m5": 220,
      "draw_0_m6": 221,
      "discard_0_m6": 222,
      "draw_0_m7": 223,
      "discard_0_m7": 224,
      "draw_0_m8": 225,
      "discard_0_m8": 226,
      "draw_0_m9": 227,
      "discard_0_m9": 228,
      "draw_0_p1": 229,
      "discard_0_p1": 230,
      "draw_0_p2": 231,
      "discard_0_p2": 232,
      "draw_0_p3": 233,
      "discard_0_p3": 234,
      "draw_0_p4": 235,
      "discard_0_p4": 236,
      "draw_0_p0": 237,
      "discard_0_p0": 238,
      "draw_0_p5": 239,
      "discard_0_p5": 240,
      "draw_0_p6": 241,
      "discard_0_p6": 242,
      "draw_0_p7": 243,
      "discard_0_p7": 244,
      "draw_0_p8": 245,
      "discard_0_p8": 246,
      "draw_0_p9": 247,
      "discard_0_p9": 248,
      "draw_0_s1": 249,
      "discard_0_s1": 250,
      "draw_0_s2": 251,
      "discard_0_s2": 252,
      "draw_0_s3": 253,
      "discard_0_s3": 254,
      "draw_0_s4": 255,
      "discard_0_s4": 256,
      "draw_0_s0": 257,
      "discard_0_s0": 258,
      "draw_0_s5": 259,
      "discard_0_s5": 260,
      "draw_0_s6": 261,
      "discard_0_s6": 262,
      "draw_0_s7": 263,
      "discard_0_s7": 264,
      "draw_0_s8": 265,
      "discard_0_s8": 266,
      "draw_0_s9": 267,
      "discard_0_s9": 268,
      "draw_0_z1": 269,
      "discard_0_z1": 270,
      "draw_0_z2": 271,
      "discard_0_z2": 272,
      "draw_0_z3": 273,
      "discard_0_z3": 274,
      "draw_0_z4": 275,
      "discard_0_z4": 276,
      "draw_0_z5": 277,
      "discard_0_z5": 278,
      "draw_0_z6": 279,
      "discard_0_z6": 280,
      "draw_0_z7": 281,
      "discard_0_z7": 282,
      "draw_1_m1": 283,
      "discard_1_m1": 284,
      "draw_1_m2": 285,
      "discard_1_m2": 286,
      "draw_1_m3": 287,
      "discard_1_m3": 288,
      "draw_1_m4": 289,
      "discard_1_m4": 290,
      "draw_1_m0": 291,
      "discard_1_m0": 292,
      "draw_1_m5": 293,
      "discard_1_m5": 294,
      "draw_1_m6": 295,
      "discard_1_m6": 296,
      "draw_1_m7": 297,
      "discard_1_m7": 298,
      "draw_1_m8": 299,
      "discard_1_m8": 300,
      "draw_1_m9": 301,
      "discard_1_m9": 302,
      "draw_1_p1": 303,
      "discard_1_p1": 304,
      "draw_1_p2": 305,
      "discard_1_p2": 306,
      "draw_1_p3": 307,
      "discard_1_p3": 308,
      "draw_1_p4": 309,
      "discard_1_p4": 310,
      "draw_1_p0": 311,
      "discard_1_p0": 312,
      "draw_1_p5": 313,
      "discard_1_p5": 314,
      "draw_1_p6": 315,
      "discard_1_p6": 316,
      "draw_1_p7": 317,
      "discard_1_p7": 318,
      "draw_1_p8": 319,
      "discard_1_p8": 320,
      "draw_1_p9": 321,
      "discard_1_p9": 322,
      "draw_1_s1": 323,
      "discard_1_s1": 324,
      "draw_1_s2": 325,
      "discard_1_s2": 326,
      "draw_1_s3": 327,
      "discard_1_s3": 328,
      "draw_1_s4": 329,
      "discard_1_s4": 330,
      "draw_1_s0": 331,
      "discard_1_s0": 332,
      "draw_1_s5": 333,
      "discard_1_s5": 334,
      "draw_1_s6": 335,
      "discard_1_s6": 336,
      "draw_1_s7": 337,
      "discard_1_s7": 338,
      "draw_1_s8": 339,
      "discard_1_s8": 340,
      "draw_1_s9": 341,
      "discard_1_s9": 342,
      "draw_1_z1": 343,
      "discard_1_z1": 344,
      "draw_1_z2": 345,
      "discard_1_z2": 346,
      "draw_1_z3": 347,
      "discard_1_z3": 348,
      "draw_1_z4": 349,
      "discard_1_z4": 350,
      "draw_1_z5": 351,
      "discard_1_z5": 352,
      "draw_1_z6": 353,
      "discard_1_z6": 354,
      "draw_1_z7": 355,
      "discard_1_z7": 356,
      "draw_2_m1": 357,
      "discard_2_m1": 358,
      "draw_2_m2": 359,
      "discard_2_m2": 360,
      "draw_2_m3": 361,
      "discard_2_m3": 362,
      "draw_2_m4": 363,
      "discard_2_m4": 364,
      "draw_2_m0": 365,
      "discard_2_m0": 366,
      "draw_2_m5": 367,
      "discard_2_m5": 368,
      "draw_2_m6": 369,
      "discard_2_m6": 370,
      "draw_2_m7": 371,
      "discard_2_m7": 372,
      "draw_2_m8": 373,
      "discard_2_m8": 374,
      "draw_2_m9": 375,
      "discard_2_m9": 376,
      "draw_2_p1": 377,
      "discard_2_p1": 378,
      "draw_2_p2": 379,
      "discard_2_p2": 380,
      "draw_2_p3": 381,
      "discard_2_p3": 382,
      "draw_2_p4": 383,
      "discard_2_p4": 384,
      "draw_2_p0": 385,
      "discard_2_p0": 386,
      "draw_2_p5": 387,
      "discard_2_p5": 388,
      "draw_2_p6": 389,
      "discard_2_p6": 390,
      "draw_2_p7": 391,
      "discard_2_p7": 392,
      "draw_2_p8": 393,
      "discard_2_p8": 394,
      "draw_2_p9": 395,
      "discard_2_p9": 396,
      "draw_2_s1": 397,
      "discard_2_s1": 398,
      "draw_2_s2": 399,
      "discard_2_s2": 400,
      "draw_2_s3": 401,
      "discard_2_s3": 402,
      "draw_2_s4": 403,
      "discard_2_s4": 404,
      "draw_2_s0": 405,
      "discard_2_s0": 406,
      "draw_2_s5": 407,
      "discard_2_s5": 408,
      "draw_2_s6": 409,
      "discard_2_s6": 410,
      "draw_2_s7": 411,
      "discard_2_s7": 412,
      "draw_2_s8": 413,
      "discard_2_s8": 414,
      "draw_2_s9": 415,
      "discard_2_s9": 416,
      "draw_2_z1": 417,
      "discard_2_z1": 418,
      "draw_2_z2": 419,
      "discard_2_z2": 420,
      "draw_2_z3": 421,
      "discard_2_z3": 422,
      "draw_2_z4": 423,
      "discard_2_z4": 424,
      "draw_2_z5": 425,
      "discard_2_z5": 426,
      "draw_2_z6": 427,
      "discard_2_z6": 428,
      "draw_2_z7": 429,
      "discard_2_z7": 430,
      "draw_3_m1": 431,
      "discard_3_m1": 432,
      "draw_3_m2": 433,
      "discard_3_m2": 434,
      "draw_3_m3": 435,
      "discard_3_m3": 436,
      "draw_3_m4": 437,
      "discard_3_m4": 438,
      "draw_3_m0": 439,
      "discard_3_m0": 440,
      "draw_3_m5": 441,
      "discard_3_m5": 442,
      "draw_3_m6": 443,
      "discard_3_m6": 444,
      "draw_3_m7": 445,
      "discard_3_m7": 446,
      "draw_3_m8": 447,
      "discard_3_m8": 448,
      "draw_3_m9": 449,
      "discard_3_m9": 450,
      "draw_3_p1": 451,
      "discard_3_p1": 452,
      "draw_3_p2": 453,
      "discard_3_p2": 454,
      "draw_3_p3": 455,
      "discard_3_p3": 456,
      "draw_3_p4": 457,
      "discard_3_p4": 458,
      "draw_3_p0": 459,
      "discard_3_p0": 460,
      "draw_3_p5": 461,
      "discard_3_p5": 462,
      "draw_3_p6": 463,
      "discard_3_p6": 464,
      "draw_3_p7": 465,
      "discard_3_p7": 466,
      "draw_3_p8": 467,
      "discard_3_p8": 468,
      "draw_3_p9": 469,
      "discard_3_p9": 470,
      "draw_3_s1": 471,
      "discard_3_s1": 472,
      "draw_3_s2": 473,
      "discard_3_s2": 474,
      "draw_3_s3": 475,
      "discard_3_s3": 476,
      "draw_3_s4": 477,
      "discard_3_s4": 478,
      "draw_3_s0": 479,
      "discard_3_s0": 480,
      "draw_3_s5": 481,
      "discard_3_s5": 482,
      "draw_3_s6": 483,
      "discard_3_s6": 484,
      "draw_3_s7": 485,
      "discard_3_s7": 486,
      "draw_3_s8": 487,
      "discard_3_s8": 488,
      "draw_3_s9": 489,
      "discard_3_s9": 490,
      "draw_3_z1": 491,
      "discard_3_z1": 492,
      "draw_3_z2": 493,
      "discard_3_z2": 494,
      "draw_3_z3": 495,
      "discard_3_z3": 496,
      "draw_3_z4": 497,
      "discard_3_z4": 498,
      "draw_3_z5": 499,
      "discard_3_z5": 500,
      "draw_3_z6": 501,
      "discard_3_z6": 502,
      "draw_3_z7": 503,
      "discard_3_z7": 504,
      "tedashi": 505,
      "tsumogiri": 506,
      "opt_self_0_ankan": 507,
      "take_self_0_ankan": 508,
      "pass_self_0_ankan": 509,
      "opt_self_0_kakan": 510,
      "take_self_0_kakan": 511,
      "pass_self_0_kakan": 512,
      "opt_self_0_penuki": 513,
      "take_self_0_penuki": 514,
      "pass_self_0_penuki": 515,
      "opt_self_0_kyushukyuhai": 516,
      "take_self_0_kyushukyuhai": 517,
      "pass_self_0_kyushukyuhai": 518,
      "opt_self_0_riichi": 519,
      "take_self_0_riichi": 520,
      "pass_self_0_riichi": 521,
      "opt_self_0_tsumo": 522,
      "take_self_0_tsumo": 523,
      "pass_self_0_tsumo": 524,
      "opt_self_1_ankan": 525,
      "take_self_1_ankan": 526,
      "pass_self_1_ankan": 527,
      "opt_self_1_kakan": 528,
      "take_self_1_kakan": 529,
      "pass_self_1_kakan": 530,
      "opt_self_1_penuki": 531,
      "take_self_1_penuki": 532,
      "pass_self_1_penuki": 533,
      "opt_self_1_kyushukyuhai": 534,
      "take_self_1_kyushukyuhai": 535,
      "pass_self_1_kyushukyuhai": 536,
      "opt_self_1_riichi": 537,
      "take_self_1_riichi": 538,
      "pass_self_1_riichi": 539,
      "opt_self_1_tsumo": 540,
      "take_self_1_tsumo": 541,
      "pass_self_1_tsumo": 542,
      "opt_self_2_ankan": 543,
      "take_self_2_ankan": 544,
      "pass_self_2_ankan": 545,
      "opt_self_2_kakan": 546,
      "take_self_2_kakan": 547,
      "pass_self_2_kakan": 548,
      "opt_self_2_penuki": 549,
      "take_self_2_penuki": 550,
      "pass_self_2_penuki": 551,
      "opt_self_2_kyushukyuhai": 552,
      "take_self_2_kyushukyuhai": 553,
      "pass_self_2_kyushukyuhai": 554,
      "opt_self_2_riichi": 555,
      "take_self_2_riichi": 556,
      "pass_self_2_riichi": 557,
      "opt_self_2_tsumo": 558,
      "take_self_2_tsumo": 559,
      "pass_self_2_tsumo": 560,
      "opt_self_3_ankan": 561,
      "take_self_3_ankan": 562,
      "pass_self_3_ankan": 563,
      "opt_self_3_kakan": 564,
      "take_self_3_kakan": 565,
      "pass_self_3_kakan": 566,
      "opt_self_3_penuki": 567,
      "take_self_3_penuki": 568,
      "pass_self_3_penuki": 569,
      "opt_self_3_kyushukyuhai": 570,
      "take_self_3_kyushukyuhai": 571,
      "pass_self_3_kyushukyuhai": 572,
      "opt_self_3_riichi": 573,
      "take_self_3_riichi": 574,
      "pass_self_3_riichi": 575,
      "opt_self_3_tsumo": 576,
      "take_self_3_tsumo": 577,
      "pass_self_3_tsumo": 578,
      "opt_react_0_chi": 579,
      "take_react_0_chi": 580,
      "pass_react_0_chi_forced_priority": 581,
      "pass_react_0_chi_voluntary": 582,
      "opt_react_0_minkan": 583,
      "take_react_0_minkan": 584,
      "pass_react_0_minkan_forced_priority": 585,
      "pass_react_0_minkan_voluntary": 586,
      "opt_react_0_pon": 587,
      "take_react_0_pon": 588,
      "pass_react_0_pon_forced_priority": 589,
      "pass_react_0_pon_voluntary": 590,
      "opt_react_0_ron": 591,
      "take_react_0_ron": 592,
      "pass_react_0_ron_voluntary": 593,
      "opt_react_1_chi": 594,
      "take_react_1_chi": 595,
      "pass_react_1_chi_forced_priority": 596,
      "pass_react_1_chi_voluntary": 597,
      "opt_react_1_minkan": 598,
      "take_react_1_minkan": 599,
      "pass_react_1_minkan_forced_priority": 600,
      "pass_react_1_minkan_voluntary": 601,
      "opt_react_1_pon": 602,
      "take_react_1_pon": 603,
      "pass_react_1_pon_forced_priority": 604,
      "pass_react_1_pon_voluntary": 605,
      "opt_react_1_ron": 606,
      "take_react_1_ron": 607,
      "pass_react_1_ron_voluntary": 608,
      "opt_react_2_chi": 609,
      "take_react_2_chi": 610,
      "pass_react_2_chi_forced_priority": 611,
      "pass_react_2_chi_voluntary": 612,
      "opt_react_2_minkan": 613,
      "take_react_2_minkan": 614,
      "pass_react_2_minkan_forced_priority": 615,
      "pass_react_2_minkan_voluntary": 616,
      "opt_react_2_pon": 617,
      "take_react_2_pon": 618,
      "pass_react_2_pon_forced_priority": 619,
      "pass_react_2_pon_voluntary": 620,
      "opt_react_2_ron": 621,
      "take_react_2_ron": 622,
      "pass_react_2_ron_voluntary": 623,
      "opt_react_3_chi": 624,
      "take_react_3_chi": 625,
      "pass_react_3_chi_forced_priority": 626,
      "pass_react_3_chi_voluntary": 627,
      "opt_react_3_minkan": 628,
      "take_react_3_minkan": 629,
      "pass_react_3_minkan_forced_priority": 630,
      "pass_react_3_minkan_voluntary": 631,
      "opt_react_3_pon": 632,
      "take_react_3_pon": 633,
      "pass_react_3_pon_forced_priority": 634,
      "pass_react_3_pon_voluntary": 635,
      "opt_react_3_ron": 636,
      "take_react_3_ron": 637,
      "pass_react_3_ron_voluntary": 638,
      "chi_pos_low": 639,
      "chi_pos_mid": 640,
      "chi_pos_high": 641,
      "red_chi_used": 642,
      "red_chi_not_used": 643,
      "red_pon_used": 644,
      "red_pon_not_used": 645,
      "pingju_ryukyoku": 646,
      "pingju_kyushukyuhai": 647,
      "pingju_nagashimangan": 648,
      "pingju_sufurenda": 649,
      "pingju_sukantsu": 650,
      "pingju_suuchariichi": 651,
      "pingju_sanchahou": 652,
      "view_complete": 653,
      "view_imperfect": 654,
      "hidden_haipai_0": 655,
      "hidden_haipai_1": 656,
      "hidden_haipai_2": 657,
      "hidden_haipai_3": 658,
      "draw_0_hidden": 659,
      "draw_1_hidden": 660,
      "draw_2_hidden": 661,
      "draw_3_hidden": 662
    },
    "unk_token": "<unk>"
  }
}