{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "game_start": 4,
      "game_end": 5,
      "view_complete": 6,
      "view_imperfect_0": 7,
      "view_imperfect_1": 8,
      "view_imperfect_2": 9,
      "view_imperfect_3": 10,
      "rule_player_3": 11,
      "rule_player_4": 12,
      "rule_length_tonpu": 13,
      "rule_length_hanchan": 14,
      "round_start": 15,
      "round_end": 16,
      "bakaze_0": 17,
      "bakaze_1": 18,
      "bakaze_2": 19,
      "kyoku_0": 20,
      "kyoku_1": 21,
      "kyoku_2": 22,
      "kyoku_3": 23,
      "honba": 24,
      "riichi_sticks": 25,
      "TENBO_ZERO": 26,
      "TENBO_PLUS": 27,
      "TENBO_MINUS": 28,
      "TENBO_100": 29,
      "TENBO_200": 30,
      "TENBO_300": 31,
      "TENBO_400": 32,
      "TENBO_500": 33,
      "TENBO_600": 34,
      "TENBO_700": 35,
      "TENBO_800": 36,
      "TENBO_900": 37,
      "TENBO_1000": 38,
      "TENBO_2000": 39,
      "TENBO_3000": 40,
      "TENBO_4000": 41,
      "TENBO_5000": 42,
      "TENBO_6000": 43,
      "TENBO_7000": 44,
      "TENBO_8000": 45,
      "TENBO_9000": 46,
      "TENBO_10000": 47,
      "dora": 48,
      "ura_dora": 49,
      "hidden_haipai_0": 50,
      "hidden_haipai_1": 51,
      "hidden_haipai_2": 52,
      "hidden_haipai_3": 53,
      "haipai_0": 54,
      "haipai_1": 55,
      "haipai_2": 56,
      "haipai_3": 57,
      "m1": 58,
      "m2": 59,
      "m3": 60,
      "m4": 61,
      "m0": 62,
      "m5": 63,
      "m6": 64,
      "m7": 65,
      "m8": 66,
      "m9": 67,
      "p1": 68,
      "p2": 69,
      "p3": 70,
      "p4": 71,
      "p0": 72,
      "p5": 73,
      "p6": 74,
      "p7": 75,
      "p8": 76,
      "p9": 77,
      "s1": 78,
      "s2": 79,
      "s3": 80,
      "s4": 81,
      "s0": 82,
      "s5": 83,
      "s6": 84,
      "s7": 85,
      "s8": 86,
      "s9": 87,
      "z1": 88,
      "z2": 89,
      "z3": 90,
      "z4": 91,
      "z5": 92,
      "z6": 93,
      "z7": 94,
      "draw_0_hidden": 95,
      "draw_0_m1": 96,
      "discard_0_m1_tedashi": 97,
      "discard_0_m1_tsumogiri": 98,
      "draw_0_m2": 99,
      "discard_0_m2_tedashi": 100,
      "discard_0_m2_tsumogiri": 101,
      "draw_0_m3": 102,
      "discard_0_m3_tedashi": 103,
      "discard_0_m3_tsumogiri": 104,
      "draw_0_m4": 105,
      "discard_0_m4_tedashi": 106,
      "discard_0_m4_tsumogiri": 107,
      "draw_0_m0": 108,
      "discard_0_m0_tedashi": 109,
      "discard_0_m0_tsumogiri": 110,
      "draw_0_m5": 111,
      "discard_0_m5_tedashi": 112,
      "discard_0_m5_tsumogiri": 113,
      "draw_0_m6": 114,
      "discard_0_m6_tedashi": 115,
      "discard_0_m6_tsumogiri": 116,
      "draw_0_m7": 117,
      "discard_0_m7_tedashi": 118,
      "discard_0_m7_tsumogiri": 119,
      "draw_0_m8": 120,
      "discard_0_m8_tedashi": 121,
      "discard_0_m8_tsumogiri": 122,
      "draw_0_m9": 123,
      "discard_0_m9_tedashi": 124,
      "discard_0_m9_tsumogiri": 125,
      "draw_0_p1": 126,
      "discard_0_p1_tedashi": 127,
      "discard_0_p1_tsumogiri": 128,
      "draw_0_p2": 129,
      "discard_0_p2_tedashi": 130,
      "discard_0_p2_tsumogiri": 131,
      "draw_0_p3": 132,
      "discard_0_p3_tedashi": 133,
      "discard_0_p3_tsumogiri": 134,
      "draw_0_p4": 135,
      "discard_0_p4_tedashi": 136,
      "discard_0_p4_tsumogiri": 137,
      "draw_0_p0": 138,
      "discard_0_p0_tedashi": 139,
      "discard_0_p0_tsumogiri": 140,
      "draw_0_p5": 141,
      "discard_0_p5_tedashi": 142,
      "discard_0_p5_tsumogiri": 143,
      "draw_0_p6": 144,
      "discard_0_p6_tedashi": 145,
      "discard_0_p6_tsumogiri": 146,
      "draw_0_p7": 147,
      "discard_0_p7_tedashi": 148,
      "discard_0_p7_tsumogiri": 149,
      "draw_0_p8": 150,
      "discard_0_p8_tedashi": 151,
      "discard_0_p8_tsumogiri": 152,
      "draw_0_p9": 153,
      "discard_0_p9_tedashi": 154,
      "discard_0_p9_tsumogiri": 155,
      "draw_0_s1": 156,
      "discard_0_s1_tedashi": 157,
      "discard_0_s1_tsumogiri": 158,
      "draw_0_s2": 159,
      "discard_0_s2_tedashi": 160,
      "discard_0_s2_tsumogiri": 161,
      "draw_0_s3": 162,
      "discard_0_s3_tedashi": 163,
      "discard_0_s3_tsumogiri": 164,
      "draw_0_s4": 165,
      "discard_0_s4_tedashi": 166,
      "discard_0_s4_tsumogiri": 167,
      "draw_0_s0": 168,
      "discard_0_s0_tedashi": 169,
      "discard_0_s0_tsumogiri": 170,
      "draw_0_s5": 171,
      "discard_0_s5_tedashi": 172,
      "discard_0_s5_tsumogiri": 173,
      "draw_0_s6": 174,
      "discard_0_s6_tedashi": 175,
      "discard_0_s6_tsumogiri": 176,
      "draw_0_s7": 177,
      "discard_0_s7_tedashi": 178,
      "discard_0_s7_tsumogiri": 179,
      "draw_0_s8": 180,
      "discard_0_s8_tedashi": 181,
      "discard_0_s8_tsumogiri": 182,
      "draw_0_s9": 183,
      "discard_0_s9_tedashi": 184,
      "discard_0_s9_tsumogiri": 185,
      "draw_0_z1": 186,
      "discard_0_z1_tedashi": 187,
      "discard_0_z1_tsumogiri": 188,
      "draw_0_z2": 189,
      "discard_0_z2_tedashi": 190,
      "discard_0_z2_tsumogiri": 191,
      "draw_0_z3": 192,
      "discard_0_z3_tedashi": 193,
      "discard_0_z3_tsumogiri": 194,
      "draw_0_z4": 195,
      "discard_0_z4_tedashi": 196,
      "discard_0_z4_tsumogiri": 197,
      "draw_0_z5": 198,
      "discard_0_z5_tedashi": 199,
      "discard_0_z5_tsumogiri": 200,
      "draw_0_z6": 201,
      "discard_0_z6_tedashi": 202,
      "discard_0_z6_tsumogiri": 203,
      "draw_0_z7": 204,
      "discard_0_z7_tedashi": 205,
      "discard_0_z7_tsumogiri": 206,
      "draw_1_hidden": 207,
      "draw_1_m1": 208,
      "discard_1_m1_tedashi": 209,
      "discard_1_m1_tsumogiri": 210,
      "draw_1_m2": 211,
      "discard_1_m2_tedashi": 212,
      "discard_1_m2_tsumogiri": 213,
      "draw_1_m3": 214,
      "discard_1_m3_tedashi": 215,
      "discard_1_m3_tsumogiri": 216,
      "draw_1_m4": 217,
      "discard_1_m4_tedashi": 218,
      "discard_1_m4_tsumogiri": 219,
      "draw_1_m0": 220,
      "discard_1_m0_tedashi": 221,
      "discard_1_m0_tsumogiri": 222,
      "draw_1_m5": 223,
      "discard_1_m5_tedashi": 224,
      "discard_1_m5_tsumogiri": 225,
      "draw_1_m6": 226,
      "discard_1_m6_tedashi": 227,
      "discard_1_m6_tsumogiri": 228,
      "draw_1_m7": 229,
      "discard_1_m7_tedashi": 230,
      "discard_1_m7_tsumogiri": 231,
      "draw_1_m8": 232,
      "discard_1_m8_tedashi": 233,
      "discard_1_m8_tsumogiri": 234,
      "draw_1_m9": 235,
      "discard_1_m9_tedashi": 236,
      "discard_1_m9_tsumogiri": 237,
      "draw_1_p1": 238,
      "discard_1_p1_tedashi": 239,
      "discard_1_p1_tsumogiri": 240,
      "draw_1_p2": 241,
      "discard_1_p2_tedashi": 242,
      "discard_1_p2_tsumogiri": 243,
      "draw_1_p3": 244,
      "discard_1_p3_tedashi": 245,
      "discard_1_p3_tsumogiri": 246,
      "draw_1_p4": 247,
      "discard_1_p4_tedashi": 248,
      "discard_1_p4_tsumogiri": 249,
      "draw_1_p0": 250,
      "discard_1_p0_tedashi": 251,
      "discard_1_p0_tsumogiri": 252,
      "draw_1_p5": 253,
      "discard_1_p5_tedashi": 254,
      "discard_1_p5_tsumogiri": 255,
      "draw_1_p6": 256,
      "discard_1_p6_tedashi": 257,
      "discard_1_p6_tsumogiri": 258,
      "draw_1_p7": 259,
      "discard_1_p7_tedashi": 260,
      "discard_1_p7_tsumogiri": 261,
      "draw_1_p8": 262,
      "discard_1_p8_tedashi": 263,
      "discard_1_p8_tsumogiri": 264,
      "draw_1_p9": 265,
      "discard_1_p9_tedashi": 266,
      "discard_1_p9_tsumogiri": 267,
      "draw_1_s1": 268,
      "discard_1_s1_tedashi": 269,
      "discard_1_s1_tsumogiri": 270,
      "draw_1_s2": 271,
      "discard_1_s2_tedashi": 272,
      "discard_1_s2_tsumogiri": 273,
      "draw_1_s3": 274,
      "discard_1_s3_tedashi": 275,
      "discard_1_s3_tsumogiri": 276,
      "draw_1_s4": 277,
      "discard_1_s4_tedashi": 278,
      "discard_1_s4_tsumogiri": 279,
      "draw_1_s0": 280,
      "discard_1_s0_tedashi": 281,
      "discard_1_s0_tsumogiri": 282,
      "draw_1_s5": 283,
      "discard_1_s5_tedashi": 284,
      "discard_1_s5_tsumogiri": 285,
      "draw_1_s6": 286,
      "discard_1_s6_tedashi": 287,
      "discard_1_s6_tsumogiri": 288,
      "draw_1_s7": 289,
      "discard_1_s7_tedashi": 290,
      "discard_1_s7_tsumogiri": 291,
      "draw_1_s8": 292,
      "discard_1_s8_tedashi": 293,
      "discard_1_s8_tsumogiri": 294,
      "draw_1_s9": 295,
      "discard_1_s9_tedashi": 296,
      "discard_1_s9_tsumogiri": 297,
      "draw_1_z1": 298,
      "discard_1_z1_tedashi": 299,
      "discard_1_z1_tsumogiri": 300,
      "draw_1_z2": 301,
      "discard_1_z2_tedashi": 302,
      "discard_1_z2_tsumogiri": 303,
      "draw_1_z3": 304,
      "discard_1_z3_tedashi": 305,
      "discard_1_z3_tsumogiri": 306,
      "draw_1_z4": 307,
      "discard_1_z4_tedashi": 308,
      "discard_1_z4_tsumogiri": 309,
      "draw_1_z5": 310,
      "discard_1_z5_tedashi": 311,
      "discard_1_z5_tsumogiri": 312,
      "draw_1_z6": 313,
      "discard_1_z6_tedashi": 314,
      "discard_1_z6_tsumogiri": 315,
      "draw_1_z7": 316,
      "discard_1_z7_tedashi": 317,
      "discard_1_z7_tsumogiri": 318,
      "draw_2_hidden": 319,
      "draw_2_m1": 320,
      "discard_2_m1_tedashi": 321,
      "discard_2_m1_tsumogiri": 322,
      "draw_2_m2": 323,
      "discard_2_m2_tedashi": 324,
      "discard_2_m2_tsumogiri": 325,
      "draw_2_m3": 326,
      "discard_2_m3_tedashi": 327,
      "discard_2_m3_tsumogiri": 328,
      "draw_2_m4": 329,
      "discard_2_m4_tedashi": 330,
      "discard_2_m4_tsumogiri": 331,
      "draw_2_m0": 332,
      "discard_2_m0_tedashi": 333,
      "discard_2_m0_tsumogiri": 334,
      "draw_2_m5": 335,
      "discard_2_m5_tedashi": 336,
      "discard_2_m5_tsumogiri": 337,
      "draw_2_m6": 338,
      "discard_2_m6_tedashi": 339,
      "discard_2_m6_tsumogiri": 340,
      "draw_2_m7": 341,
      "discard_2_m7_tedashi": 342,
      "discard_2_m7_tsumogiri": 343,
      "draw_2_m8": 344,
      "discard_2_m8_tedashi": 345,
      "discard_2_m8_tsumogiri": 346,
      "draw_2_m9": 347,
      "discard_2_m9_tedashi": 348,
      "discard_2_m9_tsumogiri": 349,
      "draw_2_p1": 350,
      "discard_2_p1_tedashi": 351,
      "discard_2_p1_tsumogiri": 352,
      "draw_2_p2": 353,
      "discard_2_p2_tedashi": 354,
      "discard_2_p2_tsumogiri": 355,
      "draw_2_p3": 356,
      "discard_2_p3_tedashi": 357,
      "discard_2_p3_tsumogiri": 358,
      "draw_2_p4": 359,
      "discard_2_p4_tedashi": 360,
      "discard_2_p4_tsumogiri": 361,
      "draw_2_p0": 362,
      "discard_2_p0_tedashi": 363,
      "discard_2_p0_tsumogiri": 364,
      "draw_2_p5": 365,
      "discard_2_p5_tedashi": 366,
      "discard_2_p5_tsumogiri": 367,
      "draw_2_p6": 368,
      "discard_2_p6_tedashi": 369,
      "discard_2_p6_tsumogiri": 370,
      "draw_2_p7": 371,
      "discard_2_p7_tedashi": 372,
      "discard_2_p7_tsumogiri": 373,
      "draw_2_p8": 374,
      "discard_2_p8_tedashi": 375,
      "discard_2_p8_tsumogiri": 376,
      "draw_2_p9": 377,
      "discard_2_p9_tedashi": 378,
      "discard_2_p9_tsumogiri": 379,
      "draw_2_s1": 380,
      "discard_2_s1_tedashi": 381,
      "discard_2_s1_tsumogiri": 382,
      "draw_2_s2": 383,
      "discard_2_s2_tedashi": 384,
      "discard_2_s2_tsumogiri": 385,
      "draw_2_s3": 386,
      "discard_2_s3_tedashi": 387,
      "discard_2_s3_tsumogiri": 388,
      "draw_2_s4": 389,
      "discard_2_s4_tedashi": 390,
      "discard_2_s4_tsumogiri": 391,
      "draw_2_s0": 392,
      "discard_2_s0_tedashi": 393,
      "discard_2_s0_tsumogiri": 394,
      "draw_2_s5": 395,
      "discard_2_s5_tedashi": 396,
      "discard_2_s5_tsumogiri": 397,
      "draw_2_s6": 398,
      "discard_2_s6_tedashi": 399,
      "discard_2_s6_tsumogiri": 400,
      "draw_2_s7": 401,
      "discard_2_s7_tedashi": 402,
      "discard_2_s7_tsumogiri": 403,
      "draw_2_s8": 404,
      "discard_2_s8_tedashi": 405,
      "discard_2_s8_tsumogiri": 406,
      "draw_2_s9": 407,
      "discard_2_s9_tedashi": 408,
      "discard_2_s9_tsumogiri": 409,
      "draw_2_z1": 410,
      "discard_2_z1_tedashi": 411,
      "discard_2_z1_tsumogiri": 412,
      "draw_2_z2": 413,
      "discard_2_z2_tedashi": 414,
      "discard_2_z2_tsumogiri": 415,
      "draw_2_z3": 416,
      "discard_2_z3_tedashi": 417,
      "discard_2_z3_tsumogiri": 418,
      "draw_2_z4": 419,
      "discard_2_z4_tedashi": 420,
      "discard_2_z4_tsumogiri": 421,
      "draw_2_z5": 422,
      "discard_2_z5_tedashi": 423,
      "discard_2_z5_tsumogiri": 424,
      "draw_2_z6": 425,
      "discard_2_z6_tedashi": 426,
      "discard_2_z6_tsumogiri": 427,
      "draw_2_z7": 428,
      "discard_2_z7_tedashi": 429,
      "discard_2_z7_tsumogiri": 430,
      "draw_3_hidden": 431,
      "draw_3_m1": 432,
      "discard_3_m1_tedashi": 433,
      "discard_3_m1_tsumogiri": 434,
      "draw_3_m2": 435,
      "discard_3_m2_tedashi": 436,
      "discard_3_m2_tsumogiri": 437,
      "draw_3_m3": 438,
      "discard_3_m3_tedashi": 439,
      "discard_3_m3_tsumogiri": 440,
      "draw_3_m4": 441,
      "discard_3_m4_tedashi": 442,
      "discard_3_m4_tsumogiri": 443,
      "draw_3_m0": 444,
      "discard_3_m0_tedashi": 445,
      "discard_3_m0_tsumogiri": 446,
      "draw_3_m5": 447,
      "discard_3_m5_tedashi": 448,
      "discard_3_m5_tsumogiri": 449,
      "draw_3_m6": 450,
      "discard_3_m6_tedashi": 451,
      "discard_3_m6_tsumogiri": 452,
      "draw_3_m7": 453,
      "discard_3_m7_tedashi": 454,
      "discard_3_m7_tsumogiri": 455,
      "draw_3_m8": 456,
      "discard_3_m8_tedashi": 457,
      "discard_3_m8_tsumogiri": 458,
      "draw_3_m9": 459,
      "discard_3_m9_tedashi": 460,
      "discard_3_m9_tsumogiri": 461,
      "draw_3_p1": 462,
      "discard_3_p1_tedashi": 463,
      "discard_3_p1_tsumogiri": 464,
      "draw_3_p2": 465,
      "discard_3_p2_tedashi": 466,
      "discard_3_p2_tsumogiri": 467,
      "draw_3_p3": 468,
      "discard_3_p3_tedashi": 469,
      "discard_3_p3_tsumogiri": 470,
      "draw_3_p4": 471,
      "discard_3_p4_tedashi": 472,
      "discard_3_p4_tsumogiri": 473,
      "draw_3_p0": 474,
      "discard_3_p0_tedashi": 475,
      "discard_3_p0_tsumogiri": 476,
      "draw_3_p5": 477,
      "discard_3_p5_tedashi": 478,
      "discard_3_p5_tsumogiri": 479,
      "draw_3_p6": 480,
      "discard_3_p6_tedashi": 481,
      "discard_3_p6_tsumogiri": 482,
      "draw_3_p7": 483,
      "discard_3_p7_tedashi": 484,
      "discard_3_p7_tsumogiri": 485,
      "draw_3_p8": 486,
      "discard_3_p8_tedashi": 487,
      "discard_3_p8_tsumogiri": 488,
      "draw_3_p9": 489,
      "discard_3_p9_tedashi": 490,
      "discard_3_p9_tsumogiri": 491,
      "draw_3_s1": 492,
      "discard_3_s1_tedashi": 493,
      "discard_3_s1_tsumogiri": 494,
      "draw_3_s2": 495,
      "discard_3_s2_tedashi": 496,
      "discard_3_s2_tsumogiri": 497,
      "draw_3_s3": 498,
      "discard_3_s3_tedashi": 499,
      "discard_3_s3_tsumogiri": 500,
      "draw_3_s4": 501,
      "discard_3_s4_tedashi": 502,
      "discard_3_s4_tsumogiri": 503,
      "draw_3_s0": 504,
      "discard_3_s0_tedashi": 505,
      "discard_3_s0_tsumogiri": 506,
      "draw_3_s5": 507,
      "discard_3_s5_tedashi": 508,
      "discard_3_s5_tsumogiri": 509,
      "draw_3_s6": 510,
      "discard_3_s6_tedashi": 511,
      "discard_3_s6_tsumogiri": 512,
      "draw_3_s7": 513,
      "discard_3_s7_tedashi": 514,
      "discard_3_s7_tsumogiri": 515,
      "draw_3_s8": 516,
      "discard_3_s8_tedashi": 517,
      "discard_3_s8_tsumogiri": 518,
      "draw_3_s9": 519,
      "discard_3_s9_tedashi": 520,
      "discard_3_s9_tsumogiri": 521,
      "draw_3_z1": 522,
      "discard_3_z1_tedashi": 523,
      "discard_3_z1_tsumogiri": 524,
      "draw_3_z2": 525,
      "discard_3_z2_tedashi": 526,
      "discard_3_z2_tsumogiri": 527,
      "draw_3_z3": 528,
      "discard_3_z3_tedashi": 529,
      "discard_3_z3_tsumogiri": 530,
      "draw_3_z4": 531,
      "discard_3_z4_tedashi": 532,
      "discard_3_z4_tsumogiri": 533,
      "draw_3_z5": 534,
      "discard_3_z5_tedashi": 535,
      "discard_3_z5_tsumogiri": 536,
      "draw_3_z6": 537,
      "discard_3_z6_tedashi": 538,
      "discard_3_z6_tsumogiri": 539,
      "draw_3_z7": 540,
      "discard_3_z7_tedashi": 541,
      "discard_3_z7_tsumogiri": 542,
      "opt_self_0_ankan": 543,
      "take_self_0_ankan": 544,
      "pass_self_0_ankan": 545,
      "opt_self_0_kakan": 546,
      "take_self_0_kakan": 547,
      "pass_self_0_kakan": 548,
      "opt_self_0_penuki": 549,
      "take_self_0_penuki": 550,
      "pass_self_0_penuki": 551,
      "opt_self_0_kyushukyuhai": 552,
      "take_self_0_kyushukyuhai": 553,
      "pass_self_0_kyushukyuhai": 554,
      "opt_self_0_riichi": 555,
      "take_self_0_riichi": 556,
      "pass_self_0_riichi": 557,
      "opt_self_0_tsumo": 558,
      "take_self_0_tsumo": 559,
      "pass_self_0_tsumo": 560,
      "opt_self_1_ankan": 561,
      "take_self_1_ankan": 562,
      "pass_self_1_ankan": 563,
      "opt_self_1_kakan": 564,
      "take_self_1_kakan": 565,
      "pass_self_1_kakan": 566,
      "opt_self_1_penuki": 567,
      "take_self_1_penuki": 568,
      "pass_self_1_penuki": 569,
      "opt_self_1_kyushukyuhai": 570,
      "take_self_1_kyushukyuhai": 571,
      "pass_self_1_kyushukyuhai": 572,
      "opt_self_1_riichi": 573,
      "take_self_1_riichi": 574,
      "pass_self_1_riichi": 575,
      "opt_self_1_tsumo": 576,
      "take_self_1_tsumo": 577,
      "pass_self_1_tsumo": 578,
      "opt_self_2_ankan": 579,
      "take_self_2_ankan": 580,
      "pass_self_2_ankan": 581,
      "opt_self_2_kakan": 582,
      "take_self_2_kakan": 583,
      "pass_self_2_kakan": 584,
      "opt_self_2_penuki": 585,
      "take_self_2_penuki": 586,
      "pass_self_2_penuki": 587,
      "opt_self_2_kyushukyuhai": 588,
      "take_self_2_kyushukyuhai": 589,
      "pass_self_2_kyushukyuhai": 590,
      "opt_self_2_riichi": 591,
      "take_self_2_riichi": 592,
      "pass_self_2_riichi": 593,
      "opt_self_2_tsumo": 594,
      "take_self_2_tsumo": 595,
      "pass_self_2_tsumo": 596,
      "opt_self_3_ankan": 597,
      "take_self_3_ankan": 598,
      "pass_self_3_ankan": 599,
      "opt_self_3_kakan": 600,
      "take_self_3_kakan": 601,
      "pass_self_3_kakan": 602,
      "opt_self_3_penuki": 603,
      "take_self_3_penuki": 604,
      "pass_self_3_penuki": 605,
      "opt_self_3_kyushukyuhai": 606,
      "take_self_3_kyushukyuhai": 607,
      "pass_self_3_kyushukyuhai": 608,
      "opt_self_3_riichi": 609,
      "take_self_3_riichi": 610,
      "pass_self_3_riichi": 611,
      "opt_self_3_tsumo": 612,
      "take_self_3_tsumo": 613,
      "pass_self_3_tsumo": 614,
      "opt_react_0_chi": 615,
      "take_react_0_chi": 616,
      "pass_react_0_chi_forced_priority": 617,
      "pass_react_0_chi_voluntary": 618,
      "opt_react_0_minkan": 619,
      "take_react_0_minkan": 620,
      "pass_react_0_minkan_forced_priority": 621,
      "pass_react_0_minkan_voluntary": 622,
      "opt_react_0_pon": 623,
      "take_react_0_pon": 624,
      "pass_react_0_pon_forced_priority": 625,
      "pass_react_0_pon_voluntary": 626,
      "opt_react_0_ron": 627,
      "take_react_0_ron": 628,
      "pass_react_0_ron_voluntary": 629,
      "opt_react_1_chi": 630,
      "take_react_1_chi": 631,
      "pass_react_1_chi_forced_priority": 632,
      "pass_react_1_chi_voluntary": 633,
      "opt_react_1_minkan": 634,
      "take_react_1_minkan": 635,
      "pass_react_1_minkan_forced_priority": 636,
      "pass_react_1_minkan_voluntary": 637,
      "opt_react_1_pon": 638,
      "take_react_1_pon": 639,
      "pass_react_1_pon_forced_priority": 640,
      "pass_react_1_pon_voluntary": 641,
      "opt_react_1_ron": 642,
      "take_react_1_ron": 643,
      "pass_react_1_ron_voluntary": 644,
      "opt_react_2_chi": 645,
      "take_react_2_chi": 646,
      "pass_react_2_chi_forced_priority": 647,
      "pass_react_2_chi_voluntary": 648,
      "opt_react_2_minkan": 649,
      "take_react_2_minkan": 650,
      "pass_react_2_minkan_forced_priority": 651,
      "pass_react_2_minkan_voluntary": 652,
      "opt_react_2_pon": 653,
      "take_react_2_pon": 654,
      "pass_react_2_pon_forced_priority": 655,
      "pass_react_2_pon_voluntary": 656,
      "opt_react_2_ron": 657,
      "take_react_2_ron": 658,
      "pass_react_2_ron_voluntary": 659,
      "opt_react_3_chi": 660,
      "take_react_3_chi": 661,
      "pass_react_3_chi_forced_priority": 662,
      "pass_react_3_chi_voluntary": 663,
      "opt_react_3_minkan": 664,
      "take_react_3_minkan": 665,
      "pass_react_3_minkan_forced_priority": 666,
      "pass_react_3_minkan_voluntary": 667,
      "opt_react_3_pon": 668,
      "take_react_3_pon": 669,
      "pass_react_3_pon_forced_priority": 670,
      "pass_react_3_pon_voluntary": 671,
      "opt_react_3_ron": 672,
      "take_react_3_ron": 673,
      "pass_react_3_ron_voluntary": 674,
      "chi_pos_low": 675,
      "chi_pos_mid": 676,
      "chi_pos_high": 677,
      "red_used": 678,
      "red_not_used": 679,
      "hule_0": 680,
      "hule_1": 681,
      "hule_2": 682,
      "hule_3": 683,
      "opened_hand_0": 684,
      "opened_hand_1": 685,
      "opened_hand_2": 686,
      "opened_hand_3": 687,
      "score_0": 688,
      "score_delta_0": 689,
      "final_score_0": 690,
      "score_1": 691,
      "score_delta_1": 692,
      "final_score_1": 693,
      "score_2": 694,
      "score_delta_2": 695,
      "final_score_2": 696,
      "score_3": 697,
      "score_delta_3": 698,
      "final_score_3": 699,
      "rank_0_1": 700,
      "rank_0_2": 701,
      "rank_0_3": 702,
      "rank_0_4": 703,
      "rank_1_1": 704,
      "rank_1_2": 705,
      "rank_1_3": 706,
      "rank_1_4": 707,
      "rank_2_1": 708,
      "rank_2_2": 709,
      "rank_2_3": 710,
      "rank_2_4": 711,
      "rank_3_1": 712,
      "rank_3_2": 713,
      "rank_3_3": 714,
      "rank_3_4": 715,
      "final_rank_0_1": 716,
      "final_rank_0_2": 717,
      "final_rank_0_3": 718,
      "final_rank_0_4": 719,
      "final_rank_1_1": 720,
      "final_rank_1_2": 721,
      "final_rank_1_3": 722,
      "final_rank_1_4": 723,
      "final_rank_2_1": 724,
      "final_rank_2_2": 725,
      "final_rank_2_3": 726,
      "final_rank_2_4": 727,
      "final_rank_3_1": 728,
      "final_rank_3_2": 729,
      "final_rank_3_3": 730,
      "final_rank_3_4": 731,
      "yaku_menzen_tsumo": 732,
      "yaku_riichi": 733,
      "yaku_ippatsu": 734,
      "yaku_chankan": 735,
      "yaku_rinshan": 736,
      "yaku_haitei": 737,
      "yaku_houtei": 738,
      "yaku_pinfu": 739,
      "yaku_tanyao": 740,
      "yaku_iipeikou": 741,
      "yaku_jikaze_ton": 742,
      "yaku_jikaze_nan": 743,
      "yaku_jikaze_shaa": 744,
      "yaku_jikaze_pei": 745,
      "yaku_bakaze_ton": 746,
      "yaku_bakaze_nan": 747,
      "yaku_bakaze_shaa": 748,
      "yaku_bakaze_pei": 749,
      "yaku_haku": 750,
      "yaku_hatsu": 751,
      "yaku_chun": 752,
      "yaku_double_riichi": 753,
      "yaku_chiitoitsu": 754,
      "yaku_chanta": 755,
      "yaku_ittsu": 756,
      "yaku_sanshoku_doujun": 757,
      "yaku_sanshoku_doukou": 758,
      "yaku_sankantsu": 759,
      "yaku_toitoi": 760,
      "yaku_sanankou": 761,
      "yaku_shousangen": 762,
      "yaku_honroutou": 763,
      "yaku_ryanpeikou": 764,
      "yaku_junchan": 765,
      "yaku_honitsu": 766,
      "yaku_chinitsu": 767,
      "yaku_tenhou": 768,
      "yaku_chiihou": 769,
      "yaku_daisangen": 770,
      "yaku_suuankou": 771,
      "yaku_suuankou_tanki": 772,
      "yaku_tsuuiisou": 773,
      "yaku_ryuuiisou": 774,
      "yaku_chinroutou": 775,
      "yaku_chuuren_poutou": 776,
      "yaku_junsei_chuuren_poutou": 777,
      "yaku_kokushi_musou": 778,
      "yaku_kokushi_musou_13_wait": 779,
      "yaku_daisuushi": 780,
      "yaku_shousuushi": 781,
      "yaku_suukantsu": 782,
      "yaku_dora": 783,
      "yaku_ura_dora": 784,
      "yaku_aka_dora": 785,
      "han_1": 786,
      "han_2": 787,
      "han_3": 788,
      "han_4": 789,
      "han_5": 790,
      "han_6": 791,
      "han_7": 792,
      "han_8": 793,
      "han_9": 794,
      "han_10": 795,
      "han_11": 796,
      "han_12": 797,
      "han_13": 798,
      "fu_20": 799,
      "fu_25": 800,
      "fu_30": 801,
      "fu_40": 802,
      "fu_50": 803,
      "fu_60": 804,
      "fu_70": 805,
      "fu_80": 806,
      "fu_90": 807,
      "fu_100": 808,
      "fu_110": 809,
      "fu_120": 810,
      "fu_130": 811,
      "fu_140": 812,
      "yakuman_1": 813,
      "yakuman_2": 814,
      "yakuman_3": 815,
      "yakuman_4": 816,
      "yakuman_5": 817,
      "yakuman_6": 818,
      "pingju_ryukyoku": 819,
      "pingju_kyushukyuhai": 820,
      "pingju_nagashimangan": 821,
      "pingju_sufurenda": 822,
      "pingju_sukantsu": 823,
      "pingju_suuchariichi": 824,
      "pingju_sanchahou": 825,
      "view_omniscient": 826,
      "wall": 827
    },
    "unk_token": "<unk>"
  }
}