{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "game_start": 4,
      "view_complete": 5,
      "view_imperfect_0": 6,
      "view_imperfect_1": 7,
      "view_imperfect_2": 8,
      "view_imperfect_3": 9,
      "rule_player_3": 10,
      "rule_player_4": 11,
      "rule_length_tonpu": 12,
      "rule_length_hanchan": 13,
      "game_end": 14,
      "round_start": 15,
      "bakaze_0": 16,
      "bakaze_1": 17,
      "bakaze_2": 18,
      "kyoku_0": 19,
      "kyoku_1": 20,
      "kyoku_2": 21,
      "kyoku_3": 22,
      "honba": 23,
      "riichi_sticks": 24,
      "TENBO_ZERO": 25,
      "TENBO_PLUS": 26,
      "TENBO_MINUS": 27,
      "TENBO_100": 28,
      "TENBO_200": 29,
      "TENBO_300": 30,
      "TENBO_500": 31,
      "TENBO_1000": 32,
      "TENBO_2000": 33,
      "TENBO_3000": 34,
      "TENBO_5000": 35,
      "TENBO_10000": 36,
      "TENBO_20000": 37,
      "TENBO_30000": 38,
      "dora": 39,
      "ura_dora": 40,
      "hidden_haipai_0": 41,
      "hidden_haipai_1": 42,
      "hidden_haipai_2": 43,
      "hidden_haipai_3": 44,
      "haipai_0": 45,
      "haipai_1": 46,
      "haipai_2": 47,
      "haipai_3": 48,
      "m1": 49,
      "m2": 50,
      "m3": 51,
      "m4": 52,
      "m0": 53,
      "m5": 54,
      "m6": 55,
      "m7": 56,
      "m8": 57,
      "m9": 58,
      "p1": 59,
      "p2": 60,
      "p3": 61,
      "p4": 62,
      "p0": 63,
      "p5": 64,
      "p6": 65,
      "p7": 66,
      "p8": 67,
      "p9": 68,
      "s1": 69,
      "s2": 70,
      "s3": 71,
      "s4": 72,
      "s0": 73,
      "s5": 74,
      "s6": 75,
      "s7": 76,
      "s8": 77,
      "s9": 78,
      "z1": 79,
      "z2": 80,
      "z3": 81,
      "z4": 82,
      "z5": 83,
      "z6": 84,
      "z7": 85,
      "draw_0_hidden": 86,
      "draw_0_m1": 87,
      "discard_0_m1_tedashi": 88,
      "discard_0_m1_tsumogiri": 89,
      "draw_0_m2": 90,
      "discard_0_m2_tedashi": 91,
      "discard_0_m2_tsumogiri": 92,
      "draw_0_m3": 93,
      "discard_0_m3_tedashi": 94,
      "discard_0_m3_tsumogiri": 95,
      "draw_0_m4": 96,
      "discard_0_m4_tedashi": 97,
      "discard_0_m4_tsumogiri": 98,
      "draw_0_m0": 99,
      "discard_0_m0_tedashi": 100,
      "discard_0_m0_tsumogiri": 101,
      "draw_0_m5": 102,
      "discard_0_m5_tedashi": 103,
      "discard_0_m5_tsumogiri": 104,
      "draw_0_m6": 105,
      "discard_0_m6_tedashi": 106,
      "discard_0_m6_tsumogiri": 107,
      "draw_0_m7": 108,
      "discard_0_m7_tedashi": 109,
      "discard_0_m7_tsumogiri": 110,
      "draw_0_m8": 111,
      "discard_0_m8_tedashi": 112,
      "discard_0_m8_tsumogiri": 113,
      "draw_0_m9": 114,
      "discard_0_m9_tedashi": 115,
      "discard_0_m9_tsumogiri": 116,
      "draw_0_p1": 117,
      "discard_0_p1_tedashi": 118,
      "discard_0_p1_tsumogiri": 119,
      "draw_0_p2": 120,
      "discard_0_p2_tedashi": 121,
      "discard_0_p2_tsumogiri": 122,
      "draw_0_p3": 123,
      "discard_0_p3_tedashi": 124,
      "discard_0_p3_tsumogiri": 125,
      "draw_0_p4": 126,
      "discard_0_p4_tedashi": 127,
      "discard_0_p4_tsumogiri": 128,
      "draw_0_p0": 129,
      "discard_0_p0_tedashi": 130,
      "discard_0_p0_tsumogiri": 131,
      "draw_0_p5": 132,
      "discard_0_p5_tedashi": 133,
      "discard_0_p5_tsumogiri": 134,
      "draw_0_p6": 135,
      "discard_0_p6_tedashi": 136,
      "discard_0_p6_tsumogiri": 137,
      "draw_0_p7": 138,
      "discard_0_p7_tedashi": 139,
      "discard_0_p7_tsumogiri": 140,
      "draw_0_p8": 141,
      "discard_0_p8_tedashi": 142,
      "discard_0_p8_tsumogiri": 143,
      "draw_0_p9": 144,
      "discard_0_p9_tedashi": 145,
      "discard_0_p9_tsumogiri": 146,
      "draw_0_s1": 147,
      "discard_0_s1_tedashi": 148,
      "discard_0_s1_tsumogiri": 149,
      "draw_0_s2": 150,
      "discard_0_s2_tedashi": 151,
      "discard_0_s2_tsumogiri": 152,
      "draw_0_s3": 153,
      "discard_0_s3_tedashi": 154,
      "discard_0_s3_tsumogiri": 155,
      "draw_0_s4": 156,
      "discard_0_s4_tedashi": 157,
      "discard_0_s4_tsumogiri": 158,
      "draw_0_s0": 159,
      "discard_0_s0_tedashi": 160,
      "discard_0_s0_tsumogiri": 161,
      "draw_0_s5": 162,
      "discard_0_s5_tedashi": 163,
      "discard_0_s5_tsumogiri": 164,
      "draw_0_s6": 165,
      "discard_0_s6_tedashi": 166,
      "discard_0_s6_tsumogiri": 167,
      "draw_0_s7": 168,
      "discard_0_s7_tedashi": 169,
      "discard_0_s7_tsumogiri": 170,
      "draw_0_s8": 171,
      "discard_0_s8_tedashi": 172,
      "discard_0_s8_tsumogiri": 173,
      "draw_0_s9": 174,
      "discard_0_s9_tedashi": 175,
      "discard_0_s9_tsumogiri": 176,
      "draw_0_z1": 177,
      "discard_0_z1_tedashi": 178,
      "discard_0_z1_tsumogiri": 179,
      "draw_0_z2": 180,
      "discard_0_z2_tedashi": 181,
      "discard_0_z2_tsumogiri": 182,
      "draw_0_z3": 183,
      "discard_0_z3_tedashi": 184,
      "discard_0_z3_tsumogiri": 185,
      "draw_0_z4": 186,
      "discard_0_z4_tedashi": 187,
      "discard_0_z4_tsumogiri": 188,
      "draw_0_z5": 189,
      "discard_0_z5_tedashi": 190,
      "discard_0_z5_tsumogiri": 191,
      "draw_0_z6": 192,
      "discard_0_z6_tedashi": 193,
      "discard_0_z6_tsumogiri": 194,
      "draw_0_z7": 195,
      "discard_0_z7_tedashi": 196,
      "discard_0_z7_tsumogiri": 197,
      "draw_1_hidden": 198,
      "draw_1_m1": 199,
      "discard_1_m1_tedashi": 200,
      "discard_1_m1_tsumogiri": 201,
      "draw_1_m2": 202,
      "discard_1_m2_tedashi": 203,
      "discard_1_m2_tsumogiri": 204,
      "draw_1_m3": 205,
      "discard_1_m3_tedashi": 206,
      "discard_1_m3_tsumogiri": 207,
      "draw_1_m4": 208,
      "discard_1_m4_tedashi": 209,
      "discard_1_m4_tsumogiri": 210,
      "draw_1_m0": 211,
      "discard_1_m0_tedashi": 212,
      "discard_1_m0_tsumogiri": 213,
      "draw_1_m5": 214,
      "discard_1_m5_tedashi": 215,
      "discard_1_m5_tsumogiri": 216,
      "draw_1_m6": 217,
      "discard_1_m6_tedashi": 218,
      "discard_1_m6_tsumogiri": 219,
      "draw_1_m7": 220,
      "discard_1_m7_tedashi": 221,
      "discard_1_m7_tsumogiri": 222,
      "draw_1_m8": 223,
      "discard_1_m8_tedashi": 224,
      "discard_1_m8_tsumogiri": 225,
      "draw_1_m9": 226,
      "discard_1_m9_tedashi": 227,
      "discard_1_m9_tsumogiri": 228,
      "draw_1_p1": 229,
      "discard_1_p1_tedashi": 230,
      "discard_1_p1_tsumogiri": 231,
      "draw_1_p2": 232,
      "discard_1_p2_tedashi": 233,
      "discard_1_p2_tsumogiri": 234,
      "draw_1_p3": 235,
      "discard_1_p3_tedashi": 236,
      "discard_1_p3_tsumogiri": 237,
      "draw_1_p4": 238,
      "discard_1_p4_tedashi": 239,
      "discard_1_p4_tsumogiri": 240,
      "draw_1_p0": 241,
      "discard_1_p0_tedashi": 242,
      "discard_1_p0_tsumogiri": 243,
      "draw_1_p5": 244,
      "discard_1_p5_tedashi": 245,
      "discard_1_p5_tsumogiri": 246,
      "draw_1_p6": 247,
      "discard_1_p6_tedashi": 248,
      "discard_1_p6_tsumogiri": 249,
      "draw_1_p7": 250,
      "discard_1_p7_tedashi": 251,
      "discard_1_p7_tsumogiri": 252,
      "draw_1_p8": 253,
      "discard_1_p8_tedashi": 254,
      "discard_1_p8_tsumogiri": 255,
      "draw_1_p9": 256,
      "discard_1_p9_tedashi": 257,
      "discard_1_p9_tsumogiri": 258,
      "draw_1_s1": 259,
      "discard_1_s1_tedashi": 260,
      "discard_1_s1_tsumogiri": 261,
      "draw_1_s2": 262,
      "discard_1_s2_tedashi": 263,
      "discard_1_s2_tsumogiri": 264,
      "draw_1_s3": 265,
      "discard_1_s3_tedashi": 266,
      "discard_1_s3_tsumogiri": 267,
      "draw_1_s4": 268,
      "discard_1_s4_tedashi": 269,
      "discard_1_s4_tsumogiri": 270,
      "draw_1_s0": 271,
      "discard_1_s0_tedashi": 272,
      "discard_1_s0_tsumogiri": 273,
      "draw_1_s5": 274,
      "discard_1_s5_tedashi": 275,
      "discard_1_s5_tsumogiri": 276,
      "draw_1_s6": 277,
      "discard_1_s6_tedashi": 278,
      "discard_1_s6_tsumogiri": 279,
      "draw_1_s7": 280,
      "discard_1_s7_tedashi": 281,
      "discard_1_s7_tsumogiri": 282,
      "draw_1_s8": 283,
      "discard_1_s8_tedashi": 284,
      "discard_1_s8_tsumogiri": 285,
      "draw_1_s9": 286,
      "discard_1_s9_tedashi": 287,
      "discard_1_s9_tsumogiri": 288,
      "draw_1_z1": 289,
      "discard_1_z1_tedashi": 290,
      "discard_1_z1_tsumogiri": 291,
      "draw_1_z2": 292,
      "discard_1_z2_tedashi": 293,
      "discard_1_z2_tsumogiri": 294,
      "draw_1_z3": 295,
      "discard_1_z3_tedashi": 296,
      "discard_1_z3_tsumogiri": 297,
      "draw_1_z4": 298,
      "discard_1_z4_tedashi": 299,
      "discard_1_z4_tsumogiri": 300,
      "draw_1_z5": 301,
      "discard_1_z5_tedashi": 302,
      "discard_1_z5_tsumogiri": 303,
      "draw_1_z6": 304,
      "discard_1_z6_tedashi": 305,
      "discard_1_z6_tsumogiri": 306,
      "draw_1_z7": 307,
      "discard_1_z7_tedashi": 308,
      "discard_1_z7_tsumogiri": 309,
      "draw_2_hidden": 310,
      "draw_2_m1": 311,
      "discard_2_m1_tedashi": 312,
      "discard_2_m1_tsumogiri": 313,
      "draw_2_m2": 314,
      "discard_2_m2_tedashi": 315,
      "discard_2_m2_tsumogiri": 316,
      "draw_2_m3": 317,
      "discard_2_m3_tedashi": 318,
      "discard_2_m3_tsumogiri": 319,
      "draw_2_m4": 320,
      "discard_2_m4_tedashi": 321,
      "discard_2_m4_tsumogiri": 322,
      "draw_2_m0": 323,
      "discard_2_m0_tedashi": 324,
      "discard_2_m0_tsumogiri": 325,
      "draw_2_m5": 326,
      "discard_2_m5_tedashi": 327,
      "discard_2_m5_tsumogiri": 328,
      "draw_2_m6": 329,
      "discard_2_m6_tedashi": 330,
      "discard_2_m6_tsumogiri": 331,
      "draw_2_m7": 332,
      "discard_2_m7_tedashi": 333,
      "discard_2_m7_tsumogiri": 334,
      "draw_2_m8": 335,
      "discard_2_m8_tedashi": 336,
      "discard_2_m8_tsumogiri": 337,
      "draw_2_m9": 338,
      "discard_2_m9_tedashi": 339,
      "discard_2_m9_tsumogiri": 340,
      "draw_2_p1": 341,
      "discard_2_p1_tedashi": 342,
      "discard_2_p1_tsumogiri": 343,
      "draw_2_p2": 344,
      "discard_2_p2_tedashi": 345,
      "discard_2_p2_tsumogiri": 346,
      "draw_2_p3": 347,
      "discard_2_p3_tedashi": 348,
      "discard_2_p3_tsumogiri": 349,
      "draw_2_p4": 350,
      "discard_2_p4_tedashi": 351,
      "discard_2_p4_tsumogiri": 352,
      "draw_2_p0": 353,
      "discard_2_p0_tedashi": 354,
      "discard_2_p0_tsumogiri": 355,
      "draw_2_p5": 356,
      "discard_2_p5_tedashi": 357,
      "discard_2_p5_tsumogiri": 358,
      "draw_2_p6": 359,
      "discard_2_p6_tedashi": 360,
      "discard_2_p6_tsumogiri": 361,
      "draw_2_p7": 362,
      "discard_2_p7_tedashi": 363,
      "discard_2_p7_tsumogiri": 364,
      "draw_2_p8": 365,
      "discard_2_p8_tedashi": 366,
      "discard_2_p8_tsumogiri": 367,
      "draw_2_p9": 368,
      "discard_2_p9_tedashi": 369,
      "discard_2_p9_tsumogiri": 370,
      "draw_2_s1": 371,
      "discard_2_s1_tedashi": 372,
      "discard_2_s1_tsumogiri": 373,
      "draw_2_s2": 374,
      "discard_2_s2_tedashi": 375,
      "discard_2_s2_tsumogiri": 376,
      "draw_2_s3": 377,
      "discard_2_s3_tedashi": 378,
      "discard_2_s3_tsumogiri": 379,
      "draw_2_s4": 380,
      "discard_2_s4_tedashi": 381,
      "discard_2_s4_tsumogiri": 382,
      "draw_2_s0": 383,
      "discard_2_s0_tedashi": 384,
      "discard_2_s0_tsumogiri": 385,
      "draw_2_s5": 386,
      "discard_2_s5_tedashi": 387,
      "discard_2_s5_tsumogiri": 388,
      "draw_2_s6": 389,
      "discard_2_s6_tedashi": 390,
      "discard_2_s6_tsumogiri": 391,
      "draw_2_s7": 392,
      "discard_2_s7_tedashi": 393,
      "discard_2_s7_tsumogiri": 394,
      "draw_2_s8": 395,
      "discard_2_s8_tedashi": 396,
      "discard_2_s8_tsumogiri": 397,
      "draw_2_s9": 398,
      "discard_2_s9_tedashi": 399,
      "discard_2_s9_tsumogiri": 400,
      "draw_2_z1": 401,
      "discard_2_z1_tedashi": 402,
      "discard_2_z1_tsumogiri": 403,
      "draw_2_z2": 404,
      "discard_2_z2_tedashi": 405,
      "discard_2_z2_tsumogiri": 406,
      "draw_2_z3": 407,
      "discard_2_z3_tedashi": 408,
      "discard_2_z3_tsumogiri": 409,
      "draw_2_z4": 410,
      "discard_2_z4_tedashi": 411,
      "discard_2_z4_tsumogiri": 412,
      "draw_2_z5": 413,
      "discard_2_z5_tedashi": 414,
      "discard_2_z5_tsumogiri": 415,
      "draw_2_z6": 416,
      "discard_2_z6_tedashi": 417,
      "discard_2_z6_tsumogiri": 418,
      "draw_2_z7": 419,
      "discard_2_z7_tedashi": 420,
      "discard_2_z7_tsumogiri": 421,
      "draw_3_hidden": 422,
      "draw_3_m1": 423,
      "discard_3_m1_tedashi": 424,
      "discard_3_m1_tsumogiri": 425,
      "draw_3_m2": 426,
      "discard_3_m2_tedashi": 427,
      "discard_3_m2_tsumogiri": 428,
      "draw_3_m3": 429,
      "discard_3_m3_tedashi": 430,
      "discard_3_m3_tsumogiri": 431,
      "draw_3_m4": 432,
      "discard_3_m4_tedashi": 433,
      "discard_3_m4_tsumogiri": 434,
      "draw_3_m0": 435,
      "discard_3_m0_tedashi": 436,
      "discard_3_m0_tsumogiri": 437,
      "draw_3_m5": 438,
      "discard_3_m5_tedashi": 439,
      "discard_3_m5_tsumogiri": 440,
      "draw_3_m6": 441,
      "discard_3_m6_tedashi": 442,
      "discard_3_m6_tsumogiri": 443,
      "draw_3_m7": 444,
      "discard_3_m7_tedashi": 445,
      "discard_3_m7_tsumogiri": 446,
      "draw_3_m8": 447,
      "discard_3_m8_tedashi": 448,
      "discard_3_m8_tsumogiri": 449,
      "draw_3_m9": 450,
      "discard_3_m9_tedashi": 451,
      "discard_3_m9_tsumogiri": 452,
      "draw_3_p1": 453,
      "discard_3_p1_tedashi": 454,
      "discard_3_p1_tsumogiri": 455,
      "draw_3_p2": 456,
      "discard_3_p2_tedashi": 457,
      "discard_3_p2_tsumogiri": 458,
      "draw_3_p3": 459,
      "discard_3_p3_tedashi": 460,
      "discard_3_p3_tsumogiri": 461,
      "draw_3_p4": 462,
      "discard_3_p4_tedashi": 463,
      "discard_3_p4_tsumogiri": 464,
      "draw_3_p0": 465,
      "discard_3_p0_tedashi": 466,
      "discard_3_p0_tsumogiri": 467,
      "draw_3_p5": 468,
      "discard_3_p5_tedashi": 469,
      "discard_3_p5_tsumogiri": 470,
      "draw_3_p6": 471,
      "discard_3_p6_tedashi": 472,
      "discard_3_p6_tsumogiri": 473,
      "draw_3_p7": 474,
      "discard_3_p7_tedashi": 475,
      "discard_3_p7_tsumogiri": 476,
      "draw_3_p8": 477,
      "discard_3_p8_tedashi": 478,
      "discard_3_p8_tsumogiri": 479,
      "draw_3_p9": 480,
      "discard_3_p9_tedashi": 481,
      "discard_3_p9_tsumogiri": 482,
      "draw_3_s1": 483,
      "discard_3_s1_tedashi": 484,
      "discard_3_s1_tsumogiri": 485,
      "draw_3_s2": 486,
      "discard_3_s2_tedashi": 487,
      "discard_3_s2_tsumogiri": 488,
      "draw_3_s3": 489,
      "discard_3_s3_tedashi": 490,
      "discard_3_s3_tsumogiri": 491,
      "draw_3_s4": 492,
      "discard_3_s4_tedashi": 493,
      "discard_3_s4_tsumogiri": 494,
      "draw_3_s0": 495,
      "discard_3_s0_tedashi": 496,
      "discard_3_s0_tsumogiri": 497,
      "draw_3_s5": 498,
      "discard_3_s5_tedashi": 499,
      "discard_3_s5_tsumogiri": 500,
      "draw_3_s6": 501,
      "discard_3_s6_tedashi": 502,
      "discard_3_s6_tsumogiri": 503,
      "draw_3_s7": 504,
      "discard_3_s7_tedashi": 505,
      "discard_3_s7_tsumogiri": 506,
      "draw_3_s8": 507,
      "discard_3_s8_tedashi": 508,
      "discard_3_s8_tsumogiri": 509,
      "draw_3_s9": 510,
      "discard_3_s9_tedashi": 511,
      "discard_3_s9_tsumogiri": 512,
      "draw_3_z1": 513,
      "discard_3_z1_tedashi": 514,
      "discard_3_z1_tsumogiri": 515,
      "draw_3_z2": 516,
      "discard_3_z2_tedashi": 517,
      "discard_3_z2_tsumogiri": 518,
      "draw_3_z3": 519,
      "discard_3_z3_tedashi": 520,
      "discard_3_z3_tsumogiri": 521,
      "draw_3_z4": 522,
      "discard_3_z4_tedashi": 523,
      "discard_3_z4_tsumogiri": 524,
      "draw_3_z5": 525,
      "discard_3_z5_tedashi": 526,
      "discard_3_z5_tsumogiri": 527,
      "draw_3_z6": 528,
      "discard_3_z6_tedashi": 529,
      "discard_3_z6_tsumogiri": 530,
      "draw_3_z7": 531,
      "discard_3_z7_tedashi": 532,
      "discard_3_z7_tsumogiri": 533,
      "opt_self_0_ankan": 534,
      "take_self_0_ankan": 535,
      "pass_self_0_ankan": 536,
      "opt_self_0_kakan": 537,
      "take_self_0_kakan": 538,
      "pass_self_0_kakan": 539,
      "opt_self_0_penuki": 540,
      "take_self_0_penuki": 541,
      "pass_self_0_penuki": 542,
      "opt_self_0_kyushukyuhai": 543,
      "take_self_0_kyushukyuhai": 544,
      "pass_self_0_kyushukyuhai": 545,
      "opt_self_0_riichi": 546,
      "take_self_0_riichi": 547,
      "pass_self_0_riichi": 548,
      "opt_self_0_tsumo": 549,
      "take_self_0_tsumo": 550,
      "pass_self_0_tsumo": 551,
      "opt_self_1_ankan": 552,
      "take_self_1_ankan": 553,
      "pass_self_1_ankan": 554,
      "opt_self_1_kakan": 555,
      "take_self_1_kakan": 556,
      "pass_self_1_kakan": 557,
      "opt_self_1_penuki": 558,
      "take_self_1_penuki": 559,
      "pass_self_1_penuki": 560,
      "opt_self_1_kyushukyuhai": 561,
      "take_self_1_kyushukyuhai": 562,
      "pass_self_1_kyushukyuhai": 563,
      "opt_self_1_riichi": 564,
      "take_self_1_riichi": 565,
      "pass_self_1_riichi": 566,
      "opt_self_1_tsumo": 567,
      "take_self_1_tsumo": 568,
      "pass_self_1_tsumo": 569,
      "opt_self_2_ankan": 570,
      "take_self_2_ankan": 571,
      "pass_self_2_ankan": 572,
      "opt_self_2_kakan": 573,
      "take_self_2_kakan": 574,
      "pass_self_2_kakan": 575,
      "opt_self_2_penuki": 576,
      "take_self_2_penuki": 577,
      "pass_self_2_penuki": 578,
      "opt_self_2_kyushukyuhai": 579,
      "take_self_2_kyushukyuhai": 580,
      "pass_self_2_kyushukyuhai": 581,
      "opt_self_2_riichi": 582,
      "take_self_2_riichi": 583,
      "pass_self_2_riichi": 584,
      "opt_self_2_tsumo": 585,
      "take_self_2_tsumo": 586,
      "pass_self_2_tsumo": 587,
      "opt_self_3_ankan": 588,
      "take_self_3_ankan": 589,
      "pass_self_3_ankan": 590,
      "opt_self_3_kakan": 591,
      "take_self_3_kakan": 592,
      "pass_self_3_kakan": 593,
      "opt_self_3_penuki": 594,
      "take_self_3_penuki": 595,
      "pass_self_3_penuki": 596,
      "opt_self_3_kyushukyuhai": 597,
      "take_self_3_kyushukyuhai": 598,
      "pass_self_3_kyushukyuhai": 599,
      "opt_self_3_riichi": 600,
      "take_self_3_riichi": 601,
      "pass_self_3_riichi": 602,
      "opt_self_3_tsumo": 603,
      "take_self_3_tsumo": 604,
      "pass_self_3_tsumo": 605,
      "opt_react_0_chi": 606,
      "take_react_0_chi": 607,
      "pass_react_0_chi_forced_priority": 608,
      "pass_react_0_chi_voluntary": 609,
      "opt_react_0_minkan": 610,
      "take_react_0_minkan": 611,
      "pass_react_0_minkan_forced_priority": 612,
      "pass_react_0_minkan_voluntary": 613,
      "opt_react_0_pon": 614,
      "take_react_0_pon": 615,
      "pass_react_0_pon_forced_priority": 616,
      "pass_react_0_pon_voluntary": 617,
      "opt_react_0_ron": 618,
      "take_react_0_ron": 619,
      "pass_react_0_ron_voluntary": 620,
      "opt_react_1_chi": 621,
      "take_react_1_chi": 622,
      "pass_react_1_chi_forced_priority": 623,
      "pass_react_1_chi_voluntary": 624,
      "opt_react_1_minkan": 625,
      "take_react_1_minkan": 626,
      "pass_react_1_minkan_forced_priority": 627,
      "pass_react_1_minkan_voluntary": 628,
      "opt_react_1_pon": 629,
      "take_react_1_pon": 630,
      "pass_react_1_pon_forced_priority": 631,
      "pass_react_1_pon_voluntary": 632,
      "opt_react_1_ron": 633,
      "take_react_1_ron": 634,
      "pass_react_1_ron_voluntary": 635,
      "opt_react_2_chi": 636,
      "take_react_2_chi": 637,
      "pass_react_2_chi_forced_priority": 638,
      "pass_react_2_chi_voluntary": 639,
      "opt_react_2_minkan": 640,
      "take_react_2_minkan": 641,
      "pass_react_2_minkan_forced_priority": 642,
      "pass_react_2_minkan_voluntary": 643,
      "opt_react_2_pon": 644,
      "take_react_2_pon": 645,
      "pass_react_2_pon_forced_priority": 646,
      "pass_react_2_pon_voluntary": 647,
      "opt_react_2_ron": 648,
      "take_react_2_ron": 649,
      "pass_react_2_ron_voluntary": 650,
      "opt_react_3_chi": 651,
      "take_react_3_chi": 652,
      "pass_react_3_chi_forced_priority": 653,
      "pass_react_3_chi_voluntary": 654,
      "opt_react_3_minkan": 655,
      "take_react_3_minkan": 656,
      "pass_react_3_minkan_forced_priority": 657,
      "pass_react_3_minkan_voluntary": 658,
      "opt_react_3_pon": 659,
      "take_react_3_pon": 660,
      "pass_react_3_pon_forced_priority": 661,
      "pass_react_3_pon_voluntary": 662,
      "opt_react_3_ron": 663,
      "take_react_3_ron": 664,
      "pass_react_3_ron_voluntary": 665,
      "chi_pos_low": 666,
      "chi_pos_mid": 667,
      "chi_pos_high": 668,
      "red_chi_used": 669,
      "red_chi_not_used": 670,
      "red_pon_used": 671,
      "red_pon_not_used": 672,
      "opened_hand_0": 673,
      "opened_hand_1": 674,
      "opened_hand_2": 675,
      "opened_hand_3": 676,
      "score_0": 677,
      "score_delta_0": 678,
      "final_score_0": 679,
      "score_1": 680,
      "score_delta_1": 681,
      "final_score_1": 682,
      "score_2": 683,
      "score_delta_2": 684,
      "final_score_2": 685,
      "score_3": 686,
      "score_delta_3": 687,
      "final_score_3": 688,
      "rank_0_1": 689,
      "rank_0_2": 690,
      "rank_0_3": 691,
      "rank_0_4": 692,
      "rank_1_1": 693,
      "rank_1_2": 694,
      "rank_1_3": 695,
      "rank_1_4": 696,
      "rank_2_1": 697,
      "rank_2_2": 698,
      "rank_2_3": 699,
      "rank_2_4": 700,
      "rank_3_1": 701,
      "rank_3_2": 702,
      "rank_3_3": 703,
      "rank_3_4": 704,
      "final_rank_0_1": 705,
      "final_rank_0_2": 706,
      "final_rank_0_3": 707,
      "final_rank_0_4": 708,
      "final_rank_1_1": 709,
      "final_rank_1_2": 710,
      "final_rank_1_3": 711,
      "final_rank_1_4": 712,
      "final_rank_2_1": 713,
      "final_rank_2_2": 714,
      "final_rank_2_3": 715,
      "final_rank_2_4": 716,
      "final_rank_3_1": 717,
      "final_rank_3_2": 718,
      "final_rank_3_3": 719,
      "final_rank_3_4": 720,
      "yaku_menzen_tsumo": 721,
      "yaku_riichi": 722,
      "yaku_ippatsu": 723,
      "yaku_chankan": 724,
      "yaku_rinshan": 725,
      "yaku_haitei": 726,
      "yaku_houtei": 727,
      "yaku_pinfu": 728,
      "yaku_tanyao": 729,
      "yaku_iipeikou": 730,
      "yaku_jikaze_ton": 731,
      "yaku_jikaze_nan": 732,
      "yaku_jikaze_shaa": 733,
      "yaku_jikaze_pei": 734,
      "yaku_bakaze_ton": 735,
      "yaku_bakaze_nan": 736,
      "yaku_bakaze_shaa": 737,
      "yaku_bakaze_pei": 738,
      "yaku_haku": 739,
      "yaku_hatsu": 740,
      "yaku_chun": 741,
      "yaku_double_riichi": 742,
      "yaku_chiitoitsu": 743,
      "yaku_chanta": 744,
      "yaku_ittsu": 745,
      "yaku_sanshoku_doujun": 746,
      "yaku_sanshoku_doukou": 747,
      "yaku_sankantsu": 748,
      "yaku_toitoi": 749,
      "yaku_sanankou": 750,
      "yaku_shousangen": 751,
      "yaku_honroutou": 752,
      "yaku_ryanpeikou": 753,
      "yaku_junchan": 754,
      "yaku_honitsu": 755,
      "yaku_chinitsu": 756,
      "yaku_tenhou": 757,
      "yaku_chiihou": 758,
      "yaku_daisangen": 759,
      "yaku_suuankou": 760,
      "yaku_suuankou_tanki": 761,
      "yaku_tsuuiisou": 762,
      "yaku_ryuuiisou": 763,
      "yaku_chinroutou": 764,
      "yaku_chuuren_poutou": 765,
      "yaku_junsei_chuuren_poutou": 766,
      "yaku_kokushi_musou": 767,
      "yaku_kokushi_musou_13_wait": 768,
      "yaku_daisuushi": 769,
      "yaku_shousuushi": 770,
      "yaku_suukantsu": 771,
      "yaku_dora": 772,
      "yaku_ura_dora": 773,
      "yaku_aka_dora": 774,
      "han_1": 775,
      "han_2": 776,
      "han_3": 777,
      "han_4": 778,
      "han_5": 779,
      "han_6": 780,
      "han_7": 781,
      "han_8": 782,
      "han_9": 783,
      "han_10": 784,
      "han_11": 785,
      "han_12": 786,
      "han_13": 787,
      "fu_20": 788,
      "fu_25": 789,
      "fu_30": 790,
      "fu_40": 791,
      "fu_50": 792,
      "fu_60": 793,
      "fu_70": 794,
      "fu_80": 795,
      "fu_90": 796,
      "fu_100": 797,
      "fu_110": 798,
      "fu_120": 799,
      "fu_130": 800,
      "fu_140": 801,
      "yakuman_1": 802,
      "yakuman_2": 803,
      "yakuman_3": 804,
      "yakuman_4": 805,
      "yakuman_5": 806,
      "yakuman_6": 807,
      "pingju_ryukyoku": 808,
      "pingju_kyushukyuhai": 809,
      "pingju_nagashimangan": 810,
      "pingju_sufurenda": 811,
      "pingju_sukantsu": 812,
      "pingju_suuchariichi": 813,
      "pingju_sanchahou": 814
    },
    "unk_token": "<unk>"
  }
}