{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "game_start": 4,
      "rule_player_3": 5,
      "rule_player_4": 6,
      "rule_length_tonpu": 7,
      "rule_length_hanchan": 8,
      "game_end": 9,
      "round_start": 10,
      "bakaze_0": 11,
      "bakaze_1": 12,
      "bakaze_2": 13,
      "kyoku_0": 14,
      "kyoku_1": 15,
      "kyoku_2": 16,
      "kyoku_3": 17,
      "honba": 18,
      "riichi_sticks": 19,
      "TENBO_ZERO": 20,
      "TENBO_PLUS": 21,
      "TENBO_MINUS": 22,
      "TENBO_100": 23,
      "TENBO_200": 24,
      "TENBO_300": 25,
      "TENBO_500": 26,
      "TENBO_1000": 27,
      "TENBO_2000": 28,
      "TENBO_3000": 29,
      "TENBO_5000": 30,
      "TENBO_10000": 31,
      "TENBO_20000": 32,
      "TENBO_30000": 33,
      "dora": 34,
      "m1": 35,
      "m2": 36,
      "m3": 37,
      "m4": 38,
      "m0": 39,
      "m5": 40,
      "m6": 41,
      "m7": 42,
      "m8": 43,
      "m9": 44,
      "p1": 45,
      "p2": 46,
      "p3": 47,
      "p4": 48,
      "p0": 49,
      "p5": 50,
      "p6": 51,
      "p7": 52,
      "p8": 53,
      "p9": 54,
      "s1": 55,
      "s2": 56,
      "s3": 57,
      "s4": 58,
      "s0": 59,
      "s5": 60,
      "s6": 61,
      "s7": 62,
      "s8": 63,
      "s9": 64,
      "z1": 65,
      "z2": 66,
      "z3": 67,
      "z4": 68,
      "z5": 69,
      "z6": 70,
      "z7": 71,
      "score_0": 72,
      "score_delta_0": 73,
      "final_score_0": 74,
      "score_1": 75,
      "score_delta_1": 76,
      "final_score_1": 77,
      "score_2": 78,
      "score_delta_2": 79,
      "final_score_2": 80,
      "score_3": 81,
      "score_delta_3": 82,
      "final_score_3": 83,
      "rank_0_1": 84,
      "rank_0_2": 85,
      "rank_0_3": 86,
      "rank_0_4": 87,
      "rank_1_1": 88,
      "rank_1_2": 89,
      "rank_1_3": 90,
      "rank_1_4": 91,
      "rank_2_1": 92,
      "rank_2_2": 93,
      "rank_2_3": 94,
      "rank_2_4": 95,
      "rank_3_1": 96,
      "rank_3_2": 97,
      "rank_3_3": 98,
      "rank_3_4": 99,
      "final_rank_0_1": 100,
      "final_rank_0_2": 101,
      "final_rank_0_3": 102,
      "final_rank_0_4": 103,
      "final_rank_1_1": 104,
      "final_rank_1_2": 105,
      "final_rank_1_3": 106,
      "final_rank_1_4": 107,
      "final_rank_2_1": 108,
      "final_rank_2_2": 109,
      "final_rank_2_3": 110,
      "final_rank_2_4": 111,
      "final_rank_3_1": 112,
      "final_rank_3_2": 113,
      "final_rank_3_3": 114,
      "final_rank_3_4": 115,
      "yaku_menzen_tsumo": 116,
      "yaku_riichi": 117,
      "yaku_ippatsu": 118,
      "yaku_chankan": 119,
      "yaku_rinshan": 120,
      "yaku_haitei": 121,
      "yaku_houtei": 122,
      "yaku_pinfu": 123,
      "yaku_tanyao": 124,
      "yaku_iipeikou": 125,
      "yaku_jikaze_ton": 126,
      "yaku_jikaze_nan": 127,
      "yaku_jikaze_shaa": 128,
      "yaku_jikaze_pei": 129,
      "yaku_bakaze_ton": 130,
      "yaku_bakaze_nan": 131,
      "yaku_bakaze_shaa": 132,
      "yaku_bakaze_pei": 133,
      "yaku_haku": 134,
      "yaku_hatsu": 135,
      "yaku_chun": 136,
      "yaku_double_riichi": 137,
      "yaku_chiitoitsu": 138,
      "yaku_chanta": 139,
      "yaku_ittsu": 140,
      "yaku_sanshoku_doujun": 141,
      "yaku_sanshoku_doukou": 142,
      "yaku_sankantsu": 143,
      "yaku_toitoi": 144,
      "yaku_sanankou": 145,
      "yaku_shousangen": 146,
      "yaku_honroutou": 147,
      "yaku_ryanpeikou": 148,
      "yaku_junchan": 149,
      "yaku_honitsu": 150,
      "yaku_chinitsu": 151,
      "yaku_tenhou": 152,
      "yaku_chiihou": 153,
      "yaku_daisangen": 154,
      "yaku_suuankou": 155,
      "yaku_suuankou_tanki": 156,
      "yaku_tsuuiisou": 157,
      "yaku_ryuuiisou": 158,
      "yaku_chinroutou": 159,
      "yaku_chuuren_poutou": 160,
      "yaku_junsei_chuuren_poutou": 161,
      "yaku_kokushi_musou": 162,
      "yaku_kokushi_musou_13_wait": 163,
      "yaku_daisuushi": 164,
      "yaku_shousuushi": 165,
      "yaku_suukantsu": 166,
      "yaku_dora": 167,
      "yaku_ura_dora": 168,
      "yaku_aka_dora": 169,
      "han_1": 170,
      "han_2": 171,
      "han_3": 172,
      "han_4": 173,
      "han_5": 174,
      "han_6": 175,
      "han_7": 176,
      "han_8": 177,
      "han_9": 178,
      "han_10": 179,
      "han_11": 180,
      "han_12": 181,
      "han_13": 182,
      "fu_20": 183,
      "fu_25": 184,
      "fu_30": 185,
      "fu_40": 186,
      "fu_50": 187,
      "fu_60": 188,
      "fu_70": 189,
      "fu_80": 190,
      "fu_90": 191,
      "fu_100": 192,
      "fu_110": 193,
      "yakuman_1": 194,
      "yakuman_2": 195,
      "yakuman_3": 196,
      "yakuman_4": 197,
      "yakuman_5": 198,
      "yakuman_6": 199,
      "haipai_0": 200,
      "haipai_1": 201,
      "haipai_2": 202,
      "haipai_3": 203,
      "draw_0_m1": 204,
      "discard_0_m1": 205,
      "draw_0_m2": 206,
      "discard_0_m2": 207,
      "draw_0_m3": 208,
      "discard_0_m3": 209,
      "draw_0_m4": 210,
      "discard_0_m4": 211,
      "draw_0_m0": 212,
      "discard_0_m0": 213,
      "draw_0_m5": 214,
      "discard_0_m5": 215,
      "draw_0_m6": 216,
      "discard_0_m6": 217,
      "draw_0_m7": 218,
      "discard_0_m7": 219,
      "draw_0_m8": 220,
      "discard_0_m8": 221,
      "draw_0_m9": 222,
      "discard_0_m9": 223,
      "draw_0_p1": 224,
      "discard_0_p1": 225,
      "draw_0_p2": 226,
      "discard_0_p2": 227,
      "draw_0_p3": 228,
      "discard_0_p3": 229,
      "draw_0_p4": 230,
      "discard_0_p4": 231,
      "draw_0_p0": 232,
      "discard_0_p0": 233,
      "draw_0_p5": 234,
      "discard_0_p5": 235,
      "draw_0_p6": 236,
      "discard_0_p6": 237,
      "draw_0_p7": 238,
      "discard_0_p7": 239,
      "draw_0_p8": 240,
      "discard_0_p8": 241,
      "draw_0_p9": 242,
      "discard_0_p9": 243,
      "draw_0_s1": 244,
      "discard_0_s1": 245,
      "draw_0_s2": 246,
      "discard_0_s2": 247,
      "draw_0_s3": 248,
      "discard_0_s3": 249,
      "draw_0_s4": 250,
      "discard_0_s4": 251,
      "draw_0_s0": 252,
      "discard_0_s0": 253,
      "draw_0_s5": 254,
      "discard_0_s5": 255,
      "draw_0_s6": 256,
      "discard_0_s6": 257,
      "draw_0_s7": 258,
      "discard_0_s7": 259,
      "draw_0_s8": 260,
      "discard_0_s8": 261,
      "draw_0_s9": 262,
      "discard_0_s9": 263,
      "draw_0_z1": 264,
      "discard_0_z1": 265,
      "draw_0_z2": 266,
      "discard_0_z2": 267,
      "draw_0_z3": 268,
      "discard_0_z3": 269,
      "draw_0_z4": 270,
      "discard_0_z4": 271,
      "draw_0_z5": 272,
      "discard_0_z5": 273,
      "draw_0_z6": 274,
      "discard_0_z6": 275,
      "draw_0_z7": 276,
      "discard_0_z7": 277,
      "draw_1_m1": 278,
      "discard_1_m1": 279,
      "draw_1_m2": 280,
      "discard_1_m2": 281,
      "draw_1_m3": 282,
      "discard_1_m3": 283,
      "draw_1_m4": 284,
      "discard_1_m4": 285,
      "draw_1_m0": 286,
      "discard_1_m0": 287,
      "draw_1_m5": 288,
      "discard_1_m5": 289,
      "draw_1_m6": 290,
      "discard_1_m6": 291,
      "draw_1_m7": 292,
      "discard_1_m7": 293,
      "draw_1_m8": 294,
      "discard_1_m8": 295,
      "draw_1_m9": 296,
      "discard_1_m9": 297,
      "draw_1_p1": 298,
      "discard_1_p1": 299,
      "draw_1_p2": 300,
      "discard_1_p2": 301,
      "draw_1_p3": 302,
      "discard_1_p3": 303,
      "draw_1_p4": 304,
      "discard_1_p4": 305,
      "draw_1_p0": 306,
      "discard_1_p0": 307,
      "draw_1_p5": 308,
      "discard_1_p5": 309,
      "draw_1_p6": 310,
      "discard_1_p6": 311,
      "draw_1_p7": 312,
      "discard_1_p7": 313,
      "draw_1_p8": 314,
      "discard_1_p8": 315,
      "draw_1_p9": 316,
      "discard_1_p9": 317,
      "draw_1_s1": 318,
      "discard_1_s1": 319,
      "draw_1_s2": 320,
      "discard_1_s2": 321,
      "draw_1_s3": 322,
      "discard_1_s3": 323,
      "draw_1_s4": 324,
      "discard_1_s4": 325,
      "draw_1_s0": 326,
      "discard_1_s0": 327,
      "draw_1_s5": 328,
      "discard_1_s5": 329,
      "draw_1_s6": 330,
      "discard_1_s6": 331,
      "draw_1_s7": 332,
      "discard_1_s7": 333,
      "draw_1_s8": 334,
      "discard_1_s8": 335,
      "draw_1_s9": 336,
      "discard_1_s9": 337,
      "draw_1_z1": 338,
      "discard_1_z1": 339,
      "draw_1_z2": 340,
      "discard_1_z2": 341,
      "draw_1_z3": 342,
      "discard_1_z3": 343,
      "draw_1_z4": 344,
      "discard_1_z4": 345,
      "draw_1_z5": 346,
      "discard_1_z5": 347,
      "draw_1_z6": 348,
      "discard_1_z6": 349,
      "draw_1_z7": 350,
      "discard_1_z7": 351,
      "draw_2_m1": 352,
      "discard_2_m1": 353,
      "draw_2_m2": 354,
      "discard_2_m2": 355,
      "draw_2_m3": 356,
      "discard_2_m3": 357,
      "draw_2_m4": 358,
      "discard_2_m4": 359,
      "draw_2_m0": 360,
      "discard_2_m0": 361,
      "draw_2_m5": 362,
      "discard_2_m5": 363,
      "draw_2_m6": 364,
      "discard_2_m6": 365,
      "draw_2_m7": 366,
      "discard_2_m7": 367,
      "draw_2_m8": 368,
      "discard_2_m8": 369,
      "draw_2_m9": 370,
      "discard_2_m9": 371,
      "draw_2_p1": 372,
      "discard_2_p1": 373,
      "draw_2_p2": 374,
      "discard_2_p2": 375,
      "draw_2_p3": 376,
      "discard_2_p3": 377,
      "draw_2_p4": 378,
      "discard_2_p4": 379,
      "draw_2_p0": 380,
      "discard_2_p0": 381,
      "draw_2_p5": 382,
      "discard_2_p5": 383,
      "draw_2_p6": 384,
      "discard_2_p6": 385,
      "draw_2_p7": 386,
      "discard_2_p7": 387,
      "draw_2_p8": 388,
      "discard_2_p8": 389,
      "draw_2_p9": 390,
      "discard_2_p9": 391,
      "draw_2_s1": 392,
      "discard_2_s1": 393,
      "draw_2_s2": 394,
      "discard_2_s2": 395,
      "draw_2_s3": 396,
      "discard_2_s3": 397,
      "draw_2_s4": 398,
      "discard_2_s4": 399,
      "draw_2_s0": 400,
      "discard_2_s0": 401,
      "draw_2_s5": 402,
      "discard_2_s5": 403,
      "draw_2_s6": 404,
      "discard_2_s6": 405,
      "draw_2_s7": 406,
      "discard_2_s7": 407,
      "draw_2_s8": 408,
      "discard_2_s8": 409,
      "draw_2_s9": 410,
      "discard_2_s9": 411,
      "draw_2_z1": 412,
      "discard_2_z1": 413,
      "draw_2_z2": 414,
      "discard_2_z2": 415,
      "draw_2_z3": 416,
      "discard_2_z3": 417,
      "draw_2_z4": 418,
      "discard_2_z4": 419,
      "draw_2_z5": 420,
      "discard_2_z5": 421,
      "draw_2_z6": 422,
      "discard_2_z6": 423,
      "draw_2_z7": 424,
      "discard_2_z7": 425,
      "draw_3_m1": 426,
      "discard_3_m1": 427,
      "draw_3_m2": 428,
      "discard_3_m2": 429,
      "draw_3_m3": 430,
      "discard_3_m3": 431,
      "draw_3_m4": 432,
      "discard_3_m4": 433,
      "draw_3_m0": 434,
      "discard_3_m0": 435,
      "draw_3_m5": 436,
      "discard_3_m5": 437,
      "draw_3_m6": 438,
      "discard_3_m6": 439,
      "draw_3_m7": 440,
      "discard_3_m7": 441,
      "draw_3_m8": 442,
      "discard_3_m8": 443,
      "draw_3_m9": 444,
      "discard_3_m9": 445,
      "draw_3_p1": 446,
      "discard_3_p1": 447,
      "draw_3_p2": 448,
      "discard_3_p2": 449,
      "draw_3_p3": 450,
      "discard_3_p3": 451,
      "draw_3_p4": 452,
      "discard_3_p4": 453,
      "draw_3_p0": 454,
      "discard_3_p0": 455,
      "draw_3_p5": 456,
      "discard_3_p5": 457,
      "draw_3_p6": 458,
      "discard_3_p6": 459,
      "draw_3_p7": 460,
      "discard_3_p7": 461,
      "draw_3_p8": 462,
      "discard_3_p8": 463,
      "draw_3_p9": 464,
      "discard_3_p9": 465,
      "draw_3_s1": 466,
      "discard_3_s1": 467,
      "draw_3_s2": 468,
      "discard_3_s2": 469,
      "draw_3_s3": 470,
      "discard_3_s3": 471,
      "draw_3_s4": 472,
      "discard_3_s4": 473,
      "draw_3_s0": 474,
      "discard_3_s0": 475,
      "draw_3_s5": 476,
      "discard_3_s5": 477,
      "draw_3_s6": 478,
      "discard_3_s6": 479,
      "draw_3_s7": 480,
      "discard_3_s7": 481,
      "draw_3_s8": 482,
      "discard_3_s8": 483,
      "draw_3_s9": 484,
      "discard_3_s9": 485,
      "draw_3_z1": 486,
      "discard_3_z1": 487,
      "draw_3_z2": 488,
      "discard_3_z2": 489,
      "draw_3_z3": 490,
      "discard_3_z3": 491,
      "draw_3_z4": 492,
      "discard_3_z4": 493,
      "draw_3_z5": 494,
      "discard_3_z5": 495,
      "draw_3_z6": 496,
      "discard_3_z6": 497,
      "draw_3_z7": 498,
      "discard_3_z7": 499,
      "tedashi": 500,
      "tsumogiri": 501,
      "opt_self_0_ankan": 502,
      "take_self_0_ankan": 503,
      "pass_self_0_ankan": 504,
      "opt_self_0_kakan": 505,
      "take_self_0_kakan": 506,
      "pass_self_0_kakan": 507,
      "opt_self_0_penuki": 508,
      "take_self_0_penuki": 509,
      "pass_self_0_penuki": 510,
      "opt_self_0_kyushukyuhai": 511,
      "take_self_0_kyushukyuhai": 512,
      "pass_self_0_kyushukyuhai": 513,
      "opt_self_0_riichi": 514,
      "take_self_0_riichi": 515,
      "pass_self_0_riichi": 516,
      "opt_self_0_tsumo": 517,
      "take_self_0_tsumo": 518,
      "pass_self_0_tsumo": 519,
      "opt_self_1_ankan": 520,
      "take_self_1_ankan": 521,
      "pass_self_1_ankan": 522,
      "opt_self_1_kakan": 523,
      "take_self_1_kakan": 524,
      "pass_self_1_kakan": 525,
      "opt_self_1_penuki": 526,
      "take_self_1_penuki": 527,
      "pass_self_1_penuki": 528,
      "opt_self_1_kyushukyuhai": 529,
      "take_self_1_kyushukyuhai": 530,
      "pass_self_1_kyushukyuhai": 531,
      "opt_self_1_riichi": 532,
      "take_self_1_riichi": 533,
      "pass_self_1_riichi": 534,
      "opt_self_1_tsumo": 535,
      "take_self_1_tsumo": 536,
      "pass_self_1_tsumo": 537,
      "opt_self_2_ankan": 538,
      "take_self_2_ankan": 539,
      "pass_self_2_ankan": 540,
      "opt_self_2_kakan": 541,
      "take_self_2_kakan": 542,
      "pass_self_2_kakan": 543,
      "opt_self_2_penuki": 544,
      "take_self_2_penuki": 545,
      "pass_self_2_penuki": 546,
      "opt_self_2_kyushukyuhai": 547,
      "take_self_2_kyushukyuhai": 548,
      "pass_self_2_kyushukyuhai": 549,
      "opt_self_2_riichi": 550,
      "take_self_2_riichi": 551,
      "pass_self_2_riichi": 552,
      "opt_self_2_tsumo": 553,
      "take_self_2_tsumo": 554,
      "pass_self_2_tsumo": 555,
      "opt_self_3_ankan": 556,
      "take_self_3_ankan": 557,
      "pass_self_3_ankan": 558,
      "opt_self_3_kakan": 559,
      "take_self_3_kakan": 560,
      "pass_self_3_kakan": 561,
      "opt_self_3_penuki": 562,
      "take_self_3_penuki": 563,
      "pass_self_3_penuki": 564,
      "opt_self_3_kyushukyuhai": 565,
      "take_self_3_kyushukyuhai": 566,
      "pass_self_3_kyushukyuhai": 567,
      "opt_self_3_riichi": 568,
      "take_self_3_riichi": 569,
      "pass_self_3_riichi": 570,
      "opt_self_3_tsumo": 571,
      "take_self_3_tsumo": 572,
      "pass_self_3_tsumo": 573,
      "opt_react_0_chi": 574,
      "take_react_0_chi": 575,
      "pass_react_0_chi_forced_priority": 576,
      "pass_react_0_chi_voluntary": 577,
      "opt_react_0_minkan": 578,
      "take_react_0_minkan": 579,
      "pass_react_0_minkan_forced_priority": 580,
      "pass_react_0_minkan_voluntary": 581,
      "opt_react_0_pon": 582,
      "take_react_0_pon": 583,
      "pass_react_0_pon_forced_priority": 584,
      "pass_react_0_pon_voluntary": 585,
      "opt_react_0_ron": 586,
      "take_react_0_ron": 587,
      "pass_react_0_ron_voluntary": 588,
      "opt_react_1_chi": 589,
      "take_react_1_chi": 590,
      "pass_react_1_chi_forced_priority": 591,
      "pass_react_1_chi_voluntary": 592,
      "opt_react_1_minkan": 593,
      "take_react_1_minkan": 594,
      "pass_react_1_minkan_forced_priority": 595,
      "pass_react_1_minkan_voluntary": 596,
      "opt_react_1_pon": 597,
      "take_react_1_pon": 598,
      "pass_react_1_pon_forced_priority": 599,
      "pass_react_1_pon_voluntary": 600,
      "opt_react_1_ron": 601,
      "take_react_1_ron": 602,
      "pass_react_1_ron_voluntary": 603,
      "opt_react_2_chi": 604,
      "take_react_2_chi": 605,
      "pass_react_2_chi_forced_priority": 606,
      "pass_react_2_chi_voluntary": 607,
      "opt_react_2_minkan": 608,
      "take_react_2_minkan": 609,
      "pass_react_2_minkan_forced_priority": 610,
      "pass_react_2_minkan_voluntary": 611,
      "opt_react_2_pon": 612,
      "take_react_2_pon": 613,
      "pass_react_2_pon_forced_priority": 614,
      "pass_react_2_pon_voluntary": 615,
      "opt_react_2_ron": 616,
      "take_react_2_ron": 617,
      "pass_react_2_ron_voluntary": 618,
      "opt_react_3_chi": 619,
      "take_react_3_chi": 620,
      "pass_react_3_chi_forced_priority": 621,
      "pass_react_3_chi_voluntary": 622,
      "opt_react_3_minkan": 623,
      "take_react_3_minkan": 624,
      "pass_react_3_minkan_forced_priority": 625,
      "pass_react_3_minkan_voluntary": 626,
      "opt_react_3_pon": 627,
      "take_react_3_pon": 628,
      "pass_react_3_pon_forced_priority": 629,
      "pass_react_3_pon_voluntary": 630,
      "opt_react_3_ron": 631,
      "take_react_3_ron": 632,
      "pass_react_3_ron_voluntary": 633,
      "chi_pos_low": 634,
      "chi_pos_mid": 635,
      "chi_pos_high": 636,
      "red_chi_used": 637,
      "red_chi_not_used": 638,
      "red_pon_used": 639,
      "red_pon_not_used": 640,
      "pingju_ryukyoku": 641,
      "pingju_kyushukyuhai": 642,
      "pingju_nagashimangan": 643,
      "pingju_sufonrenda": 644,
      "pingju_sukantsu": 645,
      "pingju_suuchariichi": 646,
      "pingju_sanchahou": 647,
      "view_complete": 648,
      "view_imperfect": 649,
      "hidden_hand_0": 650,
      "hidden_hand_1": 651,
      "hidden_hand_2": 652,
      "hidden_hand_3": 653,
      "draw_0_hidden": 654,
      "draw_1_hidden": 655,
      "draw_2_hidden": 656,
      "draw_3_hidden": 657
    },
    "unk_token": "<unk>"
  }
}