{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "game_start": 4,
      "view_complete": 5,
      "view_imperfect_0": 6,
      "view_imperfect_1": 7,
      "view_imperfect_2": 8,
      "view_imperfect_3": 9,
      "rule_player_3": 10,
      "rule_player_4": 11,
      "rule_length_tonpu": 12,
      "rule_length_hanchan": 13,
      "game_end": 14,
      "round_start": 15,
      "bakaze_0": 16,
      "bakaze_1": 17,
      "bakaze_2": 18,
      "kyoku_0": 19,
      "kyoku_1": 20,
      "kyoku_2": 21,
      "kyoku_3": 22,
      "honba": 23,
      "riichi_sticks": 24,
      "TENBO_ZERO": 25,
      "TENBO_PLUS": 26,
      "TENBO_MINUS": 27,
      "TENBO_100": 28,
      "TENBO_200": 29,
      "TENBO_300": 30,
      "TENBO_500": 31,
      "TENBO_1000": 32,
      "TENBO_2000": 33,
      "TENBO_3000": 34,
      "TENBO_5000": 35,
      "TENBO_10000": 36,
      "TENBO_20000": 37,
      "TENBO_30000": 38,
      "dora": 39,
      "ura_dora": 40,
      "hidden_haipai_0": 41,
      "hidden_haipai_1": 42,
      "hidden_haipai_2": 43,
      "hidden_haipai_3": 44,
      "haipai_0": 45,
      "haipai_1": 46,
      "haipai_2": 47,
      "haipai_3": 48,
      "m1": 49,
      "m2": 50,
      "m3": 51,
      "m4": 52,
      "m0": 53,
      "m5": 54,
      "m6": 55,
      "m7": 56,
      "m8": 57,
      "m9": 58,
      "p1": 59,
      "p2": 60,
      "p3": 61,
      "p4": 62,
      "p0": 63,
      "p5": 64,
      "p6": 65,
      "p7": 66,
      "p8": 67,
      "p9": 68,
      "s1": 69,
      "s2": 70,
      "s3": 71,
      "s4": 72,
      "s0": 73,
      "s5": 74,
      "s6": 75,
      "s7": 76,
      "s8": 77,
      "s9": 78,
      "z1": 79,
      "z2": 80,
      "z3": 81,
      "z4": 82,
      "z5": 83,
      "z6": 84,
      "z7": 85,
      "draw_0_hidden": 86,
      "draw_0_m1": 87,
      "discard_0_m1": 88,
      "draw_0_m2": 89,
      "discard_0_m2": 90,
      "draw_0_m3": 91,
      "discard_0_m3": 92,
      "draw_0_m4": 93,
      "discard_0_m4": 94,
      "draw_0_m0": 95,
      "discard_0_m0": 96,
      "draw_0_m5": 97,
      "discard_0_m5": 98,
      "draw_0_m6": 99,
      "discard_0_m6": 100,
      "draw_0_m7": 101,
      "discard_0_m7": 102,
      "draw_0_m8": 103,
      "discard_0_m8": 104,
      "draw_0_m9": 105,
      "discard_0_m9": 106,
      "draw_0_p1": 107,
      "discard_0_p1": 108,
      "draw_0_p2": 109,
      "discard_0_p2": 110,
      "draw_0_p3": 111,
      "discard_0_p3": 112,
      "draw_0_p4": 113,
      "discard_0_p4": 114,
      "draw_0_p0": 115,
      "discard_0_p0": 116,
      "draw_0_p5": 117,
      "discard_0_p5": 118,
      "draw_0_p6": 119,
      "discard_0_p6": 120,
      "draw_0_p7": 121,
      "discard_0_p7": 122,
      "draw_0_p8": 123,
      "discard_0_p8": 124,
      "draw_0_p9": 125,
      "discard_0_p9": 126,
      "draw_0_s1": 127,
      "discard_0_s1": 128,
      "draw_0_s2": 129,
      "discard_0_s2": 130,
      "draw_0_s3": 131,
      "discard_0_s3": 132,
      "draw_0_s4": 133,
      "discard_0_s4": 134,
      "draw_0_s0": 135,
      "discard_0_s0": 136,
      "draw_0_s5": 137,
      "discard_0_s5": 138,
      "draw_0_s6": 139,
      "discard_0_s6": 140,
      "draw_0_s7": 141,
      "discard_0_s7": 142,
      "draw_0_s8": 143,
      "discard_0_s8": 144,
      "draw_0_s9": 145,
      "discard_0_s9": 146,
      "draw_0_z1": 147,
      "discard_0_z1": 148,
      "draw_0_z2": 149,
      "discard_0_z2": 150,
      "draw_0_z3": 151,
      "discard_0_z3": 152,
      "draw_0_z4": 153,
      "discard_0_z4": 154,
      "draw_0_z5": 155,
      "discard_0_z5": 156,
      "draw_0_z6": 157,
      "discard_0_z6": 158,
      "draw_0_z7": 159,
      "discard_0_z7": 160,
      "draw_1_hidden": 161,
      "draw_1_m1": 162,
      "discard_1_m1": 163,
      "draw_1_m2": 164,
      "discard_1_m2": 165,
      "draw_1_m3": 166,
      "discard_1_m3": 167,
      "draw_1_m4": 168,
      "discard_1_m4": 169,
      "draw_1_m0": 170,
      "discard_1_m0": 171,
      "draw_1_m5": 172,
      "discard_1_m5": 173,
      "draw_1_m6": 174,
      "discard_1_m6": 175,
      "draw_1_m7": 176,
      "discard_1_m7": 177,
      "draw_1_m8": 178,
      "discard_1_m8": 179,
      "draw_1_m9": 180,
      "discard_1_m9": 181,
      "draw_1_p1": 182,
      "discard_1_p1": 183,
      "draw_1_p2": 184,
      "discard_1_p2": 185,
      "draw_1_p3": 186,
      "discard_1_p3": 187,
      "draw_1_p4": 188,
      "discard_1_p4": 189,
      "draw_1_p0": 190,
      "discard_1_p0": 191,
      "draw_1_p5": 192,
      "discard_1_p5": 193,
      "draw_1_p6": 194,
      "discard_1_p6": 195,
      "draw_1_p7": 196,
      "discard_1_p7": 197,
      "draw_1_p8": 198,
      "discard_1_p8": 199,
      "draw_1_p9": 200,
      "discard_1_p9": 201,
      "draw_1_s1": 202,
      "discard_1_s1": 203,
      "draw_1_s2": 204,
      "discard_1_s2": 205,
      "draw_1_s3": 206,
      "discard_1_s3": 207,
      "draw_1_s4": 208,
      "discard_1_s4": 209,
      "draw_1_s0": 210,
      "discard_1_s0": 211,
      "draw_1_s5": 212,
      "discard_1_s5": 213,
      "draw_1_s6": 214,
      "discard_1_s6": 215,
      "draw_1_s7": 216,
      "discard_1_s7": 217,
      "draw_1_s8": 218,
      "discard_1_s8": 219,
      "draw_1_s9": 220,
      "discard_1_s9": 221,
      "draw_1_z1": 222,
      "discard_1_z1": 223,
      "draw_1_z2": 224,
      "discard_1_z2": 225,
      "draw_1_z3": 226,
      "discard_1_z3": 227,
      "draw_1_z4": 228,
      "discard_1_z4": 229,
      "draw_1_z5": 230,
      "discard_1_z5": 231,
      "draw_1_z6": 232,
      "discard_1_z6": 233,
      "draw_1_z7": 234,
      "discard_1_z7": 235,
      "draw_2_hidden": 236,
      "draw_2_m1": 237,
      "discard_2_m1": 238,
      "draw_2_m2": 239,
      "discard_2_m2": 240,
      "draw_2_m3": 241,
      "discard_2_m3": 242,
      "draw_2_m4": 243,
      "discard_2_m4": 244,
      "draw_2_m0": 245,
      "discard_2_m0": 246,
      "draw_2_m5": 247,
      "discard_2_m5": 248,
      "draw_2_m6": 249,
      "discard_2_m6": 250,
      "draw_2_m7": 251,
      "discard_2_m7": 252,
      "draw_2_m8": 253,
      "discard_2_m8": 254,
      "draw_2_m9": 255,
      "discard_2_m9": 256,
      "draw_2_p1": 257,
      "discard_2_p1": 258,
      "draw_2_p2": 259,
      "discard_2_p2": 260,
      "draw_2_p3": 261,
      "discard_2_p3": 262,
      "draw_2_p4": 263,
      "discard_2_p4": 264,
      "draw_2_p0": 265,
      "discard_2_p0": 266,
      "draw_2_p5": 267,
      "discard_2_p5": 268,
      "draw_2_p6": 269,
      "discard_2_p6": 270,
      "draw_2_p7": 271,
      "discard_2_p7": 272,
      "draw_2_p8": 273,
      "discard_2_p8": 274,
      "draw_2_p9": 275,
      "discard_2_p9": 276,
      "draw_2_s1": 277,
      "discard_2_s1": 278,
      "draw_2_s2": 279,
      "discard_2_s2": 280,
      "draw_2_s3": 281,
      "discard_2_s3": 282,
      "draw_2_s4": 283,
      "discard_2_s4": 284,
      "draw_2_s0": 285,
      "discard_2_s0": 286,
      "draw_2_s5": 287,
      "discard_2_s5": 288,
      "draw_2_s6": 289,
      "discard_2_s6": 290,
      "draw_2_s7": 291,
      "discard_2_s7": 292,
      "draw_2_s8": 293,
      "discard_2_s8": 294,
      "draw_2_s9": 295,
      "discard_2_s9": 296,
      "draw_2_z1": 297,
      "discard_2_z1": 298,
      "draw_2_z2": 299,
      "discard_2_z2": 300,
      "draw_2_z3": 301,
      "discard_2_z3": 302,
      "draw_2_z4": 303,
      "discard_2_z4": 304,
      "draw_2_z5": 305,
      "discard_2_z5": 306,
      "draw_2_z6": 307,
      "discard_2_z6": 308,
      "draw_2_z7": 309,
      "discard_2_z7": 310,
      "draw_3_hidden": 311,
      "draw_3_m1": 312,
      "discard_3_m1": 313,
      "draw_3_m2": 314,
      "discard_3_m2": 315,
      "draw_3_m3": 316,
      "discard_3_m3": 317,
      "draw_3_m4": 318,
      "discard_3_m4": 319,
      "draw_3_m0": 320,
      "discard_3_m0": 321,
      "draw_3_m5": 322,
      "discard_3_m5": 323,
      "draw_3_m6": 324,
      "discard_3_m6": 325,
      "draw_3_m7": 326,
      "discard_3_m7": 327,
      "draw_3_m8": 328,
      "discard_3_m8": 329,
      "draw_3_m9": 330,
      "discard_3_m9": 331,
      "draw_3_p1": 332,
      "discard_3_p1": 333,
      "draw_3_p2": 334,
      "discard_3_p2": 335,
      "draw_3_p3": 336,
      "discard_3_p3": 337,
      "draw_3_p4": 338,
      "discard_3_p4": 339,
      "draw_3_p0": 340,
      "discard_3_p0": 341,
      "draw_3_p5": 342,
      "discard_3_p5": 343,
      "draw_3_p6": 344,
      "discard_3_p6": 345,
      "draw_3_p7": 346,
      "discard_3_p7": 347,
      "draw_3_p8": 348,
      "discard_3_p8": 349,
      "draw_3_p9": 350,
      "discard_3_p9": 351,
      "draw_3_s1": 352,
      "discard_3_s1": 353,
      "draw_3_s2": 354,
      "discard_3_s2": 355,
      "draw_3_s3": 356,
      "discard_3_s3": 357,
      "draw_3_s4": 358,
      "discard_3_s4": 359,
      "draw_3_s0": 360,
      "discard_3_s0": 361,
      "draw_3_s5": 362,
      "discard_3_s5": 363,
      "draw_3_s6": 364,
      "discard_3_s6": 365,
      "draw_3_s7": 366,
      "discard_3_s7": 367,
      "draw_3_s8": 368,
      "discard_3_s8": 369,
      "draw_3_s9": 370,
      "discard_3_s9": 371,
      "draw_3_z1": 372,
      "discard_3_z1": 373,
      "draw_3_z2": 374,
      "discard_3_z2": 375,
      "draw_3_z3": 376,
      "discard_3_z3": 377,
      "draw_3_z4": 378,
      "discard_3_z4": 379,
      "draw_3_z5": 380,
      "discard_3_z5": 381,
      "draw_3_z6": 382,
      "discard_3_z6": 383,
      "draw_3_z7": 384,
      "discard_3_z7": 385,
      "tedashi": 386,
      "tsumogiri": 387,
      "opt_self_0_ankan": 388,
      "take_self_0_ankan": 389,
      "pass_self_0_ankan": 390,
      "opt_self_0_kakan": 391,
      "take_self_0_kakan": 392,
      "pass_self_0_kakan": 393,
      "opt_self_0_penuki": 394,
      "take_self_0_penuki": 395,
      "pass_self_0_penuki": 396,
      "opt_self_0_kyushukyuhai": 397,
      "take_self_0_kyushukyuhai": 398,
      "pass_self_0_kyushukyuhai": 399,
      "opt_self_0_riichi": 400,
      "take_self_0_riichi": 401,
      "pass_self_0_riichi": 402,
      "opt_self_0_tsumo": 403,
      "take_self_0_tsumo": 404,
      "pass_self_0_tsumo": 405,
      "opt_self_1_ankan": 406,
      "take_self_1_ankan": 407,
      "pass_self_1_ankan": 408,
      "opt_self_1_kakan": 409,
      "take_self_1_kakan": 410,
      "pass_self_1_kakan": 411,
      "opt_self_1_penuki": 412,
      "take_self_1_penuki": 413,
      "pass_self_1_penuki": 414,
      "opt_self_1_kyushukyuhai": 415,
      "take_self_1_kyushukyuhai": 416,
      "pass_self_1_kyushukyuhai": 417,
      "opt_self_1_riichi": 418,
      "take_self_1_riichi": 419,
      "pass_self_1_riichi": 420,
      "opt_self_1_tsumo": 421,
      "take_self_1_tsumo": 422,
      "pass_self_1_tsumo": 423,
      "opt_self_2_ankan": 424,
      "take_self_2_ankan": 425,
      "pass_self_2_ankan": 426,
      "opt_self_2_kakan": 427,
      "take_self_2_kakan": 428,
      "pass_self_2_kakan": 429,
      "opt_self_2_penuki": 430,
      "take_self_2_penuki": 431,
      "pass_self_2_penuki": 432,
      "opt_self_2_kyushukyuhai": 433,
      "take_self_2_kyushukyuhai": 434,
      "pass_self_2_kyushukyuhai": 435,
      "opt_self_2_riichi": 436,
      "take_self_2_riichi": 437,
      "pass_self_2_riichi": 438,
      "opt_self_2_tsumo": 439,
      "take_self_2_tsumo": 440,
      "pass_self_2_tsumo": 441,
      "opt_self_3_ankan": 442,
      "take_self_3_ankan": 443,
      "pass_self_3_ankan": 444,
      "opt_self_3_kakan": 445,
      "take_self_3_kakan": 446,
      "pass_self_3_kakan": 447,
      "opt_self_3_penuki": 448,
      "take_self_3_penuki": 449,
      "pass_self_3_penuki": 450,
      "opt_self_3_kyushukyuhai": 451,
      "take_self_3_kyushukyuhai": 452,
      "pass_self_3_kyushukyuhai": 453,
      "opt_self_3_riichi": 454,
      "take_self_3_riichi": 455,
      "pass_self_3_riichi": 456,
      "opt_self_3_tsumo": 457,
      "take_self_3_tsumo": 458,
      "pass_self_3_tsumo": 459,
      "opt_react_0_chi": 460,
      "take_react_0_chi": 461,
      "pass_react_0_chi_forced_priority": 462,
      "pass_react_0_chi_voluntary": 463,
      "opt_react_0_minkan": 464,
      "take_react_0_minkan": 465,
      "pass_react_0_minkan_forced_priority": 466,
      "pass_react_0_minkan_voluntary": 467,
      "opt_react_0_pon": 468,
      "take_react_0_pon": 469,
      "pass_react_0_pon_forced_priority": 470,
      "pass_react_0_pon_voluntary": 471,
      "opt_react_0_ron": 472,
      "take_react_0_ron": 473,
      "pass_react_0_ron_voluntary": 474,
      "opt_react_1_chi": 475,
      "take_react_1_chi": 476,
      "pass_react_1_chi_forced_priority": 477,
      "pass_react_1_chi_voluntary": 478,
      "opt_react_1_minkan": 479,
      "take_react_1_minkan": 480,
      "pass_react_1_minkan_forced_priority": 481,
      "pass_react_1_minkan_voluntary": 482,
      "opt_react_1_pon": 483,
      "take_react_1_pon": 484,
      "pass_react_1_pon_forced_priority": 485,
      "pass_react_1_pon_voluntary": 486,
      "opt_react_1_ron": 487,
      "take_react_1_ron": 488,
      "pass_react_1_ron_voluntary": 489,
      "opt_react_2_chi": 490,
      "take_react_2_chi": 491,
      "pass_react_2_chi_forced_priority": 492,
      "pass_react_2_chi_voluntary": 493,
      "opt_react_2_minkan": 494,
      "take_react_2_minkan": 495,
      "pass_react_2_minkan_forced_priority": 496,
      "pass_react_2_minkan_voluntary": 497,
      "opt_react_2_pon": 498,
      "take_react_2_pon": 499,
      "pass_react_2_pon_forced_priority": 500,
      "pass_react_2_pon_voluntary": 501,
      "opt_react_2_ron": 502,
      "take_react_2_ron": 503,
      "pass_react_2_ron_voluntary": 504,
      "opt_react_3_chi": 505,
      "take_react_3_chi": 506,
      "pass_react_3_chi_forced_priority": 507,
      "pass_react_3_chi_voluntary": 508,
      "opt_react_3_minkan": 509,
      "take_react_3_minkan": 510,
      "pass_react_3_minkan_forced_priority": 511,
      "pass_react_3_minkan_voluntary": 512,
      "opt_react_3_pon": 513,
      "take_react_3_pon": 514,
      "pass_react_3_pon_forced_priority": 515,
      "pass_react_3_pon_voluntary": 516,
      "opt_react_3_ron": 517,
      "take_react_3_ron": 518,
      "pass_react_3_ron_voluntary": 519,
      "chi_pos_low": 520,
      "chi_pos_mid": 521,
      "chi_pos_high": 522,
      "red_chi_used": 523,
      "red_chi_not_used": 524,
      "red_pon_used": 525,
      "red_pon_not_used": 526,
      "opened_hand_0": 527,
      "opened_hand_1": 528,
      "opened_hand_2": 529,
      "opened_hand_3": 530,
      "score_0": 531,
      "score_delta_0": 532,
      "final_score_0": 533,
      "score_1": 534,
      "score_delta_1": 535,
      "final_score_1": 536,
      "score_2": 537,
      "score_delta_2": 538,
      "final_score_2": 539,
      "score_3": 540,
      "score_delta_3": 541,
      "final_score_3": 542,
      "rank_0_1": 543,
      "rank_0_2": 544,
      "rank_0_3": 545,
      "rank_0_4": 546,
      "rank_1_1": 547,
      "rank_1_2": 548,
      "rank_1_3": 549,
      "rank_1_4": 550,
      "rank_2_1": 551,
      "rank_2_2": 552,
      "rank_2_3": 553,
      "rank_2_4": 554,
      "rank_3_1": 555,
      "rank_3_2": 556,
      "rank_3_3": 557,
      "rank_3_4": 558,
      "final_rank_0_1": 559,
      "final_rank_0_2": 560,
      "final_rank_0_3": 561,
      "final_rank_0_4": 562,
      "final_rank_1_1": 563,
      "final_rank_1_2": 564,
      "final_rank_1_3": 565,
      "final_rank_1_4": 566,
      "final_rank_2_1": 567,
      "final_rank_2_2": 568,
      "final_rank_2_3": 569,
      "final_rank_2_4": 570,
      "final_rank_3_1": 571,
      "final_rank_3_2": 572,
      "final_rank_3_3": 573,
      "final_rank_3_4": 574,
      "yaku_menzen_tsumo": 575,
      "yaku_riichi": 576,
      "yaku_ippatsu": 577,
      "yaku_chankan": 578,
      "yaku_rinshan": 579,
      "yaku_haitei": 580,
      "yaku_houtei": 581,
      "yaku_pinfu": 582,
      "yaku_tanyao": 583,
      "yaku_iipeikou": 584,
      "yaku_jikaze_ton": 585,
      "yaku_jikaze_nan": 586,
      "yaku_jikaze_shaa": 587,
      "yaku_jikaze_pei": 588,
      "yaku_bakaze_ton": 589,
      "yaku_bakaze_nan": 590,
      "yaku_bakaze_shaa": 591,
      "yaku_bakaze_pei": 592,
      "yaku_haku": 593,
      "yaku_hatsu": 594,
      "yaku_chun": 595,
      "yaku_double_riichi": 596,
      "yaku_chiitoitsu": 597,
      "yaku_chanta": 598,
      "yaku_ittsu": 599,
      "yaku_sanshoku_doujun": 600,
      "yaku_sanshoku_doukou": 601,
      "yaku_sankantsu": 602,
      "yaku_toitoi": 603,
      "yaku_sanankou": 604,
      "yaku_shousangen": 605,
      "yaku_honroutou": 606,
      "yaku_ryanpeikou": 607,
      "yaku_junchan": 608,
      "yaku_honitsu": 609,
      "yaku_chinitsu": 610,
      "yaku_tenhou": 611,
      "yaku_chiihou": 612,
      "yaku_daisangen": 613,
      "yaku_suuankou": 614,
      "yaku_suuankou_tanki": 615,
      "yaku_tsuuiisou": 616,
      "yaku_ryuuiisou": 617,
      "yaku_chinroutou": 618,
      "yaku_chuuren_poutou": 619,
      "yaku_junsei_chuuren_poutou": 620,
      "yaku_kokushi_musou": 621,
      "yaku_kokushi_musou_13_wait": 622,
      "yaku_daisuushi": 623,
      "yaku_shousuushi": 624,
      "yaku_suukantsu": 625,
      "yaku_dora": 626,
      "yaku_ura_dora": 627,
      "yaku_aka_dora": 628,
      "han_1": 629,
      "han_2": 630,
      "han_3": 631,
      "han_4": 632,
      "han_5": 633,
      "han_6": 634,
      "han_7": 635,
      "han_8": 636,
      "han_9": 637,
      "han_10": 638,
      "han_11": 639,
      "han_12": 640,
      "han_13": 641,
      "fu_20": 642,
      "fu_25": 643,
      "fu_30": 644,
      "fu_40": 645,
      "fu_50": 646,
      "fu_60": 647,
      "fu_70": 648,
      "fu_80": 649,
      "fu_90": 650,
      "fu_100": 651,
      "fu_110": 652,
      "fu_120": 653,
      "fu_130": 654,
      "fu_140": 655,
      "yakuman_1": 656,
      "yakuman_2": 657,
      "yakuman_3": 658,
      "yakuman_4": 659,
      "yakuman_5": 660,
      "yakuman_6": 661,
      "pingju_ryukyoku": 662,
      "pingju_kyushukyuhai": 663,
      "pingju_nagashimangan": 664,
      "pingju_sufurenda": 665,
      "pingju_sukantsu": 666,
      "pingju_suuchariichi": 667,
      "pingju_sanchahou": 668
    },
    "unk_token": "<unk>"
  }
}